["LONDON, England (CNN) -- Prince Harry led tributes to Diana, Princess of Wales on the 10th anniversary of her death, describing her as \"the best mother in the world\" in a speech at a memorial service. Here is his speech in full: . William and I can separate life into two parts. There were those years when we were blessed with the physical presence beside us of both our mother and father. Princes Harry and William greet guests at a thanksgiving service in memory of their mother. And then there are the 10 years since our mother's death. When she was alive, we completely took for granted her unrivaled love of life, laughter, fun and folly. She was our guardian, friend and protector. She never once allowed her unfaltering love for us to go unspoken or undemonstrated. She will always be remembered for her amazing public work. But behind the media glare, to us, just two loving children, she was quite simply the best mother in the world. We would say that, wouldn't we. But we miss her. She kissed us last thing at night. Her beaming smile greeted us from school. She laughed hysterically and uncontrollably when sharing something silly she might have said or done that day. She encouraged us when we were nervous or unsure. She -- like our father -- was determined to provide us with a stable and secure childhood. To lose a parent so suddenly at such a young age, as others have experienced, is indescribably shocking and sad. It was an event which changed our lives forever, as it must have done for everyone who lost someone that night. But what is far more important to us now, and into the future, is that we remember our mother as she would have wished to be remembered as she was: fun-loving, generous, down-to-earth, entirely genuine. We both think of her every day. We speak about her and laugh together at all the memories. Put simply, she made us, and so many other people, happy. May this be the way that she is remembered. Prince William's reading from St Paul's letter to the Ephesians: . I bow my knees before the Father, from whom every family in heaven and on earth takes its name. I pray that, according to the riches of His glory, He may grant that you may be strengthened in your inner being with power through His Spirit, and that Christ may dwell in your hearts through faith, as you are being rooted and grounded in love. I pray that you may have the power to comprehend, with all the saints, what is the breadth and length and height and depth, and to know the love of Christ that surpasses knowledge, so that you may be filled with all the fullness of God. Now to Him who by the power at work within us is able to accomplish abundantly far more than all we can ask or imagine, to Him be glory in the church and in Christ Jesus to all generations, for ever and ever. Amen. Thanks be to God. The Bishop of London's speech: . \"Who's cheating?\" The scene is an old people's home. Two residents are playing Beggar My Neighbor. Enter the Princess. The question from the royal visitor is unexpected but everyone laughs. Afterwards they comment on her large eyes and what life she brought into the room. One tiny incident, characteristic of countless other occasions in the Princess's public life in which she found the right word or the right gesture to bring cheer and comfort. Everyone here will have their own memories. I remember meeting Princess Diana for the very first time early in 1981 to discuss details of the wedding service in St Paul's. Even Archbishop's Chaplains have their share of proper diffidence and I was nervous entering the presence. It must have been a bewildering time for the Princess as well, but even then, at the age of 20, her capacity for empathy and her very strong intuitive power ensured that any tension soon evaporated. Prince Harry has spoken movingly and justly, as few others have the right to do, about the Princess as a mother. I want to dwell for a moment on her public work, its cost and its meaning. After her marriage, the Princess joined her natural gifts of beauty, empathy and powerful intuition with that extraordinary charge which association with the Royal Family generates. Led by our Queen and other members of the Royal Family, our constitution has developed in response to the challenges of the past century. There is a properly political sphere in which the monarch may counsel but doesn't intrude, but there is another sphere, vital to any sense of national unity and creativity, a sphere in which communities must be celebrated, common values articulated and the transcendent source of those values honored. We tend to be suspicious of public figures who wrap themselves in divinity and claim that their will is God's will, but if no-one can articulate in an un-ignorable way in the public realm the creative energy of the love that we see in Christ, the human face of God, then we shall find ourselves inhabiting a maimed and diminished society. And at a time when people are suspicious of rhetoric, the monarchy communicates by symbol and by simple speech, and the Princess brought her own gifts to this work. She was still only 26 in 1987 when she shook the hand of a patient at the opening of the Middlesex Hospital's Aids ward. It was the first in the UK and it is very hard now to credit the degree of fear and prejudice which surrounded Aids in the '80s. Those familiar with the field have no doubt that the Princess played a significant part in overcoming a harmful and even a cruel taboo in a gesture which was not choreographed but sprung from a deep identification with those who were vulnerable and on the margin. And she had a similar impact in the USA. An editorial in the New York Times in 1989 admitted ruefully that it had taken a foreign, and even a royal, dignitary to draw attention to a major public health concern in the US. Her work in the very last year of her life for the victims of landmines also caught the popular imagination internationally and certainly accelerated the adoption of the Ottawa Convention, banning the use of a weapon which disproportionately kills and maims women and children. She proved the eloquence of embrace and of touch which, of course, have been used by royal healers throughout the centuries. And as she said, in her words, \"the biggest disease today is not leprosy or TB but the feeling of being unwanted\". She sought out places of suffering, because they are so very often places of truth where the masks have been removed, and she was not afraid to be with the dying and to comfort them in an unsentimental way. Bill Deedes accompanied her on some of her visits. His response to the cynics was typically robust. He said: \"She was one who sought above all to help vulnerable people in society and who did it so well. She was good at this because she herself was vulnerable. She knew the feeling. She didn't set out to be a saint.\" The role brought great power but, like any member of the Royal Family, she also experienced the weight of expectation and the intensity of the scrutiny. Honoring but managing the role and not allowing it to take over one's personal humanity is a desperately difficult task. As we have heard from Prince Harry, his mother Diana did all that she could to prepare her sons for the work which lies ahead. She confessed to receiving a very great deal from some of those whose lives she touched. She said of John, a young Greek suffering from cystic fibrosis: \"He showed no sign of anger, no trace of bitterness but touched us all with an aura of optimism and hope for the future such that I have never before encountered.\" The love of Christ described in the lesson read by Prince William contains the essence of the spiritual life. Princess Diana recognized this quality of life in many of those, like John, whose lives she touched. It was a mystery which resonated deeply with her and for which she reached out. And the mystery is this - the more you go beyond yourself, the more you will become your true self; the more you lose yourself in loving and serving others, the more you will find yourself; the more you keep company with those who suffer, the more you will be healed. This is the knowledge which passes all understanding. This is certain and has been proved experimentally in the life of all the saints. It's easy to lose the real person in the image, to insist that all is darkness or all is light. Still, 10 years after her tragic death, there are regular reports of \"fury\" at this or that incident, and the Princess's memory is used for scoring points. Let it end here. Let this service mark the point at which we let her rest in peace and dwell on her memory with thanksgiving and compassion. Let us also, echoing the words of Prince Harry, look to the future and pray, in the words of St Paul, for all those who serve our country as members of the Royal Family and most especially for the sons who were so precious to her: . \"I pray that you being rooted and established in love may have power with all the saints to grasp what is the breadth and length and depth and height of the love of Christ and to know this love which surpasses knowledge that you might be filled with the fullness of God.\" Amen. E-mail to a friend .", "LONDON, England (CNN) -- French Foreign Minister Bernard Kouchner's declaration that France had to prepare for the possibility of war against Iran over its nuclear program was not conventional diplomatic behavior. But then Kouchner was never expected to be a soft-soaper on the diplomatic scene. French foreign minister Bernard Kouchner has a reputation for challenging convention and authority. A surprise appointment from the Socialist ranks to Nicolas Sarkozy's conservative government, the founder of Medicins Sans Frontiers has always challenged convention and authority. The former UN Secretary General Boutros Boutros-Ghali once called Kouchner 'an unguided missile' and the man himself has been known to declare: \"To change the law you sometimes have to break the law\". He was in his youth one of the leaders of the students revolt in France in May 1968. Kouchner is a humanitarian as well as a patriot, with a strong commitment to human rights. Unusually for a man of the Left, he supported the US-led intervention in Iraq (while criticizing the aftermath). But he did so on the grounds of Saddam Hussein's denial of human rights, not his possible possession of weapons of mass destruction. His and President Sarkozy's concern for human rights lies behind their eagerness to join Gordon Brown's Britain in a new push for action in Darfur. Bernard Kouchner did not come to his position with any of former President Chirac's instinctive distrust of the United States. Washington, which has been critical of some European states for their weakness in confronting Teheran, will have been delighted by his 'get serious' warning to Teheran. But the plain-speaking Kouchner is unlikely to be deterred by fears of upsetting the White House when he has criticisms to make of US policy. How much should be made of his words on Iran remains unclear at this stage. They were scarcely on the same scale as President Chirac's threat when he was still in office to retaliate with nuclear strikes against any state found to be responsible for a large-scale terrorist attack on France. But they are all of a piece with France's new high-profile style under the presidency of Nicolas Sarkozy. Mr Kouchner, for example, became the first French Foreign Minister to visit Iraq since 1988, insisting that there could only be a political solution to the country's problems, not a military one, and offering France's services as a mediator and 'honest broker' between Sunnis, Shiites and Kurds. On Iran he is, in a way, merely echoing the words of his President who declared in a speech last month that a nuclear-armed Iran would be 'unacceptable' and describing the stand-off over its nuclear program as 'undoubtedly the most serious crisis before us today'. Certainly Mr Kouchner is making clear that France no longer takes the view once expressed by President Chirac that a nuclear-armed Iran might be inevitable . In continuing to ratchet up the rhetoric over that threat and to underline the West's resolution on Iran's nuclear enrichment program Mr Kouchner is supplementing his president's warnings. Neither is saying that military intervention against Iran is imminent or inevitable. Neither has yet confirmed that France would be part of any such military action. But both are stressing the risks which are piling up as a result of Teheran's brinkmanship. Perhaps the strongest lesson though from Mr Kouchner's intervention is his underlining that the new administration in France is not a knee-jerk anti-American one -- and that France is in the business of reclaiming a role at the top diplomatic tables. E-mail to a friend .", "1. \"Für Elise\" Bob Dylan wrote \"It Ain't Me, Babe\" for Joan Baez. Written by: Ludwig van Beethoven . Written for: Some girl probably not named Elise. In fact, as far as most historians can tell, Beethoven didn't even know an Elise. Instead, the song was originally titled \"Bagatelle in A minor\" based on some handwritten notation a Beethoven researcher claimed to have seen on a now-lost copy of the sheet music. Further complicating things, Beethoven had hideous handwriting -- to the point that some scholars speculate the song was actually written \"for Therese,\" as in Therese Malfatti, one of several women who turned down a marriage proposal from the notoriously lovesick maestro. 2. \"Philadelphia Freedom\" Written by: Elton John & Bernie Taupin . Written for: Billie Jean King, as a thank-you for a tracksuit she gave Elton. And what a tracksuit it must have been! The 1975 song remains one of the most popular disco hits ever, leaving thousands of Hustle enthusiasts wondering just what Billie Jean King had to do with Philadelphia, anyway. Turns out, the song was a reference to King's pro tennis team, The Philadelphia Freedoms. Prior to 1968, tennis players were all considered \"amateurs\" and weren't eligible to receive prize money. So, if you didn't have the wealth to support yourself, you couldn't play. Billie Jean King fought against those constraints, ultimately founding Professional World Team Tennis in 1974 and turning tennis into a paid league sport. 3. \"Lola\" Written by: The Kinks' Ray Davies . Written for: A transvestite. But the question is, which one? According to Rolling Stone, \"Lola\" was inspired by Candy Darling, a member of Andy Warhol's entourage, whom Ray Davies briefly (and cluelessly) dated. If that's the case, then \"Lola\" is just another notch on Darling's song belt -- she's also referred to in Lou Reed's \"Walk on the Wild Side.\" (\"Candy came from out on the Island/ In the backroom she was everybody's darlin'.\") But, in the Kinks' official biography, Davies tells a different story. He says \"Lola\" was written after the band's manager spent a very drunken night dancing with a woman whose five o'clock shadow was apparently obvious to everyone but him. 4. \"867-5309/Jenny\" Written by: Jim Keller (of Tommy Tutone) and Alex Call . Written for: Unknown, as the songwriters apparently make up a different story about its inspiration every time they're asked. While the woman continues to remain a mystery, however, the phone number is all too real. In fact, it's been wreaking havoc ever since 1982 and the passage of time hasn't quelled of the number of crank calls. In 1999, Brown University freshman roommates Nina Clemente and Jahanaz Mirza found that out the hard way, when the school adopted an 867 exchange number for its on-campus phone system. Immediately, the girls' innocuous Room No. 5309 became a magnet for every drunk college kid with a 1980s fetish. Other unfortunate phone customers have fought back with creative and profitable solutions, like the holder of 212-867-5309, who put his phone number up for auction on eBay in 2004. Bids approached $100,000 before eBay pulled the item at the request of Verizon, the number's actual owner. 5. \"Oh, Carol\" Written by: Neil Sedaka . Written for: Carole King, naturally. Sedaka and King actually dated briefly in high school -- a romance Sedaka was able to successfully milk with \"Oh, Carol,\" a then top-10 (if now somewhat forgettable) 1959 pop song. However, the real success of \"Oh, Carol\" came a few months later, when it inspired King to write a rebuttal entitled \"Oh, Neil.\" At the time, King and her husband, Gerry Goffin, were fledgling songwriters in need of a hit tune. \"Oh, Neil\" wasn't that, but it did pay off. After Sedaka gave a tape of the song to his boss, King and Goffin landed jobs at the legendary Brill Building pop music factory, where the duo went on to write chart-toppers like \"Will You Still Love Me Tomorrow\" and \"The Loco-Motion.\" 6. \"It Ain't Me, Babe\" Written by: Bob Dylan . Written for: Joan Baez, though it clearly wasn't the nicest gift Dylan could have given her. The two met in 1961, when Baez was an up-and-coming folk singer and Dylan was a nobody from Minnesota. Desperate to make his break in the music biz, Dylan worked like crazy to get Baez's attention. He eventually ended up going on tour with her, which is how he first became famous, and also how the two began dating. For a while, they seemed like the golden couple, but things soon went downhill. During a European concert tour together in early 1965, they had a huge fight and parted ways. That May, Dylan was holed up in a hotel after being hospitalized with a virus, and Baez, hoping to remain friends, decided to bring him flowers. Sadly, that's how she found out that her ex was already dating someone else. That someone else was Sara Lownds, whom Dylan married a mere six months later. 7. \"Our House\" Written by: Graham Nash (of Crosby, Stills, Nash & Young) Written for: Joni Mitchell. In December 1968, Nash and Mitchell moved into a cozy little house in the Laurel Canyon section of Los Angeles. Though commonly left out of the hippy pantheon, Laurel Canyon was sort of a commune-home away from commune-home for San Francisco society -- not just CSN&Y, but also Jim Morrison, the Eagles, Frank Zappa, and more. \"Our House\" was directly inspired by a lazy Sunday in the Nash/Mitchell household. The couple went out to brunch, hit an antiques store, and then returned to find the house just a bit chilly, at which point Nash literally \"lit a fire,\" while Mitchell \"placed the flowers in the vase that she bought that day.\" No, really. The whole tableau seemed so ridiculously domestic to Nash that he immediately sat down and spent the rest of the day writing about it. E-mail to a friend .", "WASHINGTON (CNN) -- A wide-open presidential race and a willingness by candidates, interest groups, unions and corporations to buy TV time will lead to historic spending for political and issue-advocacy advertising in the 2008 election cycle, an analysis shows. Former Massachusetts Gov. Mitt Romney has spent the most on TV advertising so far among presidential contenders. The cost to try to influence the 2008 election could exceed $3 billion, according to TNS Media Intelligence/Campaign Media Analysis Group, CNN's consultant on political television advertising. This is nearly twice as much than what was spent in 2004 when political and issue-advocacy television advertising rang in at $1.7 billion. In 2006, $2.3 billion was spent on political and issue-advocacy TV commercials. Just about every candidate running for an office from dogcatcher to president is spending the money, said Evan Tracey, CMAG's chief operating officer. The costs to produce a TV commercial are no longer prohibitive for local and state candidates, who are turning more and more to the airwaves to reach voters.  See how spending breaks down for this year » . And interest groups have spent $6.2 million on TV ads so far this year for state and local ballot measures. On the national level, the cost of issue-advocacy television ad spending was $270 million in the first nine months of this year. Subjects ranged from the Iraq war to telecommunications reform. Television ads on health care alone total $60 million. CMAG estimates more than $3 million of the $270 million spent to air issue-advocacy ads this year has gone for commercials in states and districts that are likely to have competitive House and Senate races in 2008. Tracey said he thinks this is just the beginning of interest groups \"pivoting from legislative advocacy mode to political mode.\" \"What we expect to see between now and the end of the primaries, and through the general election, is groups will take a more aggressive stance on their advertising and actually target candidates,\" he said. With 17 Democratic and Republican candidates running for president, CMAG predicts that more than $800 million will be spent on TV ads in the battle for the White House. Up to now, the political commercials have been largely focused on the early states of Iowa, New Hampshire and South Carolina. Voters in some of the 20-plus states holding nominating contests on February 5 will start seeing ads in the coming months. Former Massachusetts Gov. Mitt Romney leads all candidates in TV spending, having aired his commercials more than 11,000 times this year at a cost of nearly $8.6 million. This is a record for the number of airings at this point in a presidential election cycle.  Watch how Romney is way ahead in ad spending » . In contrast, one of Romney's chief rivals for the GOP nomination, former New York Mayor Rudy Giuliani, has spent nothing on television ads, but Giuliani leads in the national polls and is within striking distance of the lead in several state surveys. Giuliani enjoys widespread national name recognition, while Romney does not. In the race for the Democratic nomination, Illinois Sen. Barack Obama has spent more than $2.3 million on television commercials, while New York Sen. Hillary Clinton has spent $1 million less and leads in both national and early state polls. New Mexico Gov. Bill Richardson has probably benefited the most in the Democratic contest from the $2 million he has invested in his television commercials. Richardson's humorous TV ads effectively stated his experience as a lawmaker, diplomat and executive, and positioned him as a solid second-tier candidate. Romney used his $8.6 million in television ads to introduce himself as a social and fiscal conservative to Republican voters. These voters might otherwise not know much about him other than that he was the governor of the traditionally liberal Massachusetts. Romney is leading polls in the early voting states of Iowa and New Hampshire. Further evidence of how Romney's television commercials have helped is in South Carolina. An American Research Group poll of South Carolina Republicans in August showed Romney registering at 9 percent with these influential primary voters. A month later, and with $350,000 worth of commercials aired in the two weeks leading up to the next poll, Romney was up 17 percentage points. Romney's latest ad began airing Friday in Iowa, and in it he vows to stop Iran from acquiring nuclear weapons, to boost the military by 100,000 people, to strengthen U.S. intelligence capabilities and to monitor calls into the U.S. from al Qaeda. All of these issues should play well with conservatives who participate in the Iowa caucuses. While only a handful of Democratic candidates and Romney have used the airwaves until now, Tracey said he expects this to change. \"Before the end of October, I suspect all the frontrunner candidates will be on the air,\" Tracey said. \"As we get closer to primary day, the frontrunners will be joined by all the candidates in the race who are taking their last, best shot.\" In the fight for Congress, CMAG predicts that as much as $639 million could be spent on television advertising. Democrats control the House and Senate. Tracey noted that CMAG's 2008 election cycle forecast does not take into account unforeseen events such as former Florida Rep. Mark Foley's House page scandal or the September 11 terrorist attacks. \"Politics is completely beholden to events,\" he said. \"Events will ultimately determine how much is spent, where and when.\" What television advertising challenges do candidates and interest groups face in the coming months? \"Chances are, just as what happened in 2006, voters will be numb after watching hundred and hundreds of ads,\" said Stuart Rothenberg, editor of the non-partisan Rothenberg Political Report. \"The sheer number of ads probably dilutes their importance. After a while, the ads just become lots of chatter and an ad will have to be really good to cut through the noise.\" E-mail to a friend .", "PHUKET, Thailand (CNN) -- Relatives of the 89 people killed in Sunday's plane crash in Phuket continued to arrive in the Thai resort town on Tuesday to try to identify their loved ones' remains. A Buddhist monk blesses the wreckage of One-Two-Go airline's MD-82 jet at Phuket airport on Tuesday. Most of those killed were foreign nationals, and about 36 of the bodies still have yet to be identified, according to Thailand's state-run Thai News Agency (TNA). All of the unidentified victims were foreign nationals, it reported. The U.S. Embassy in Bangkok said that five Americans were among those killed when the One-Two-Go jet crashed in bad weather as it landed at Phuket's airport on Sunday. U.S. officials had previously confirmed that four Americans died in the crash, and one survived. Eight British nationals are believed to have died, according to Foreign Secretary David Miliband. He said three were still in hospital, with one in a critical condition. Thailand's Public Health Minister Mongkol Na Songkhla said that of the 41 survivors who remain hospitalized, 38 were in stable condition and three in critical condition, according to TNA. Flight 269 was carrying 123 passengers and seven crew members when it left Bangkok for Phuket on Sunday afternoon. Nationalities of the survivors include British, American, Swedish, Iranian, Austrian, Australian, Thai, German, Irish, Italian, Israeli and Dutch, authorities said. Watch a survivor recall the fiery horror » . One man who arrived in Phuket on Tuesday from Paris described a frustrating process of trying to communicate with Thai officials in his effort to locate the remains of his brother. For some families, DNA testing may be the only way to positively identify their relatives. Meanwhile, Buddhist, Christian and Muslim leaders gathered outside Phuket's airport on Tuesday to remember those killed. The investigation into what caused the crash continues, but the strong winds and rain are a suspected factor. U.S. officials are aiding in the investigation because the aircraft -- a Boeing MD-82 -- was manufactured in the United States. One air traffic controller at Phuket airport said pilots were warned of possible wind shear, which is dramatic changes in wind speed and direction. Airport officials said that the wind at the time of the crash was 17 kilometers an hour (11 miles an hour) with stronger gusts, but no planes were delayed or diverted because of the weather conditions. The decision to land was the pilot's alone, according to Phuket's airport manager. \"Air traffic control would give weather information to pilot and warning information but the final decision is dependent on the pilot,\" Pornchai Eua-Aree said. One-Two-Go officials would not speculate on what may have happened, saying they will wait for the findings of the investigation. But they did say their aircraft were regularly checked and maintained, and denied some media reports that questioned whether the discount airline employed more inexperienced pilots for lower salaries. One-Two-Go is one of about 40 low-cost airlines operating in Asia, and the industry will be watching closely for the results of the investigation into the crash. E-mail to a friend . CNN's Andrew Stevens contributed to this report .", "(CNN) -- Filmmaker Michael Moore, whose new documentary \"Sicko\" takes on America's health care system, faced off Tuesday with CNN chief medical correspondent and practicing neurosurgeon Dr. Sanjay Gupta. Michael Moore and CNN's Sanjay Gupta argued Tuesday about Gupta's report on Moore's film \"Sicko\" Moore criticized a report Gupta did on CNN Monday on \"Sicko.\" \"He said the facts were fudged,\" Moore said, referring to Gupta, on CNN's \"Larry King Live.\" \"That's a lie. None of the facts are fudged.\" Moore and Gupta shouted and argued over data Gupta used and data Moore used. Moore said his staffers backed up the film's facts to Gupta before the report aired and that Gupta aired it knowing his facts were wrong. Gupta disputed that.  Watch Moore, Gupta make their points » . \"We try and look for some of the best sources we can possibly find,\" he said. \"Michael has a lot of different numbers. ... You're sort of cherry-picking data from different reports.\" Both agreed, however, on the basic premise of \"Sicko\": Problems abound in America's health-care system and need to be fixed. \"I thought it was a good movie, and I wanted to say that,\" Gupta said. \"I think it strikes at the irrefutable fact -- it's broken. We get it.\" He praised Moore for raising awareness of the issue. However, Gupta said he was concerned that the movie -- which notes that other developed nations such as France and Canada have universal health care --suggests that health care in those countries is free. While patients may not pay for services at the doctor's office, they do pay high taxes to fund such a system, something Gupta said he was concerned that \"Sicko\" audiences might not realize. Moore responded by saying Americans pay more in copays, deductibles and insurance premiums. \"We [America] have a system built on profit,\" the moviemaker said. He asked Gupta if the current system, which requires him to receive approval from an insurance company before performing some procedures, is cumbersome to him. \"It's a shameful system, especially when I'm dealing with some of my patients,\" Gupta said. But he questioned Moore's apparent solution -- putting health care in the hands of the Bush administration, which Moore fiercely criticized in the past, particularly in his film \"Fahrenheit 9/11.\" \"The government actually used to do things right,\" Moore said in response. \"The problem is who we put in power.\" Moore has adamantly opposed the war in Iraq and said the government should reprioritize -- a position he took many years before skepticism of the war's success abounded in Washington. \"I am sorry we've taken so much time trying to correct [Gupta's] facts here tonight instead of talking about the real issue\" -- the ailing health care system, Moore said. E-mail to a friend .", "WASHINGTON (CNN) -- Some Democrats appear to be wavering on a highly contentious House resolution labeling Turkey's treatment of Armenians in World War I as genocide. A KC-135 tanker lands at Incirlik Air Base in southern Turkey in 2003. Turkey, a longtime U.S. ally and NATO partner, was incensed by the resolution calling the killing of Armenians by Ottoman Turks genocide and threatened to block access to Incirlik Air Base after the resolution passed a House committee vote. The base, in southern Turkey near Syria, is a major resupply center for U.S. operations in Iraq and elsewhere in the Mideast and Asia. The Pentagon is preparing to set up new supply routes for troops in Iraq if Turkey cuts off U.S. access to the strategically important Incirlik, military officials said Tuesday. Ankara acknowledges the killings of Armenians during World War I but vehemently objects to the \"genocide\" label. The House Foreign Affairs Committee last week adopted the nonbinding resolution. House Speaker Nancy Pelosi said she would bring the measure to a vote of the full House sometime next month. But the Bush administration urged Congress to drop the issue, and some leading Democrats urged Pelosi not to bring it to the floor. Majority Leader Steny Hoyer signaled Tuesday that the vote might be put off. \"I said I thought we would bring this up prior to us leaving here,\" said Hoyer of Maryland. \"I have not changed on that, although I would be less than candid to say that there are a number of people who are revisiting their own positions. We will have to determine where everybody is.\" Democratic Rep. Ike Skelton, the chairman of the House Armed Services Committee, announced his opposition to the resolution last week. And Democratic Reps. Alcee Hastings of Florida and John Tanner of Tennessee, both members of the U.S. House delegation to NATO, urged Pelosi to reconsider in a letter released Tuesday. \"More than half of the cargo flown into Iraq and Afghanistan comes through Incirlik Air Base, and this base would be a key component of any plans for redeployment of our troops in the future,\" they wrote. Lt. Gen. Carter Ham, the director of operations for the Joint Chiefs of Staff, said Pentagon planners are looking at \"a broad range of options\" to keep food, fuel and ammunition flowing to U.S. troops in Iraq if Turkey blocks Incirlik. \"We're confident that we'll find ways to do that,\" Ham told reporters at the Pentagon. \"There's likely to be some increased cost and some other implications for that, and obviously we'd prefer to maintain the access that we have.\" Defense Secretary Robert Gates echoed lawmakers' concerns last week. \"About 70 percent of all air cargo going into Iraq goes through Turkey. ... About a third of the fuel that they consume goes through Turkey or comes from Turkey,\" Gates said. He also said that 95 percent of the Mine-Resistant Ambush-Protective vehicles, or MRAPs, being deployed in Iraq are flown through Turkey. The vehicles are built to withstand roadside bombs.  See Incirlik's key location » . The U.S. military issued a \"warning order\" a few days ago to ensure that alternative air crews, planes, fuel and routes are lined up if Turkey stops or restricts U.S. access to Incirlik, a source said. Jordan and Kuwait are among the alternatives the United States is considering. Some fear pursuit of the resolution would also embolden the Turks to attack Kurdish rebels in northern Iraq which could further complicate Iraqi stability, U.S. officials said. Incirlik offers 10,000- and 9,000-foot runways and 57 hardened aircraft shelters, according Globalsecurity.org, a source of background information about military issues. Globalsecurity said Incirlik has become a hub for cargo shipments to Iraq, taking over for Rhein-Main Air Base in Germany because it is closer to Iraq, reducing the strain on troops and aircraft. E-mail to a friend . CNN's Barbara Starr and Deirdre Walsh contributed to this report.", "BAGHDAD, Iraq (CNN) -- Twelve-year-old Mohammed Rasoul, his right leg severed below the knee, maneuvers on crutches over the dirt and loose stones through the Falluja graveyard. Mohammed Rasoul sitting with his mother, Jinan Khalifa, eagerly awaits his trip to the United States. Row after row of headstones stand as the deadly reminder of the tragedy the city went through as insurgents battled for control of the city. Mohammed stops at his cousin's grave. \"I feel an ache when I think of her. Every time I remember her, I cry,\" he told CNN at a visit to the grave a few months ago. As he spoke, he poured water on a tree he planted next to it. The headstone reads: \"Martyr 643, the child Hajer Ismael Khalil, 13 October 2006.\" Clutching her photograph, Mohammed says, \"My cousin died on the scene. I still remember her screams.\" The same explosion cost him his leg and his childhood. \"A car came out of nowhere. My cousin was playing with her friend,\" he says. \"I remember [the car] was green. It detonated.\"  Watch Mohammed tell his story » . His mother, Jinan Khalifa, remembers that day all too well. She was in the kitchen when she heard a deafening explosion. \"There was shattered glass from the windows falling all over us. I went outside and saw my son covered in blood from head to toe,\" she says. Her son endured 11 operations before doctors amputated his leg below the knee. Khalifa says her son put forward a tough face, but when he finally went back home the shock hit him. \"That's where his personality started to change. He stopped laughing,\" she says. \"It was tearing me up,\" Mohammed says \"It was hard for me to watch others play. And I couldn't, I couldn't walk, it agitated me.\" CNN first broadcast his story in May where it caught the attention of an American charity, the Global Medical Relief Fund, which offered to help. \"I cannot put my feelings into words,\" Khalifa says. \"An entire book would not be enough. They gave my son his hope back. The America we knew was one that came, bombed, harmed. But when this organization came forward, we saw another face of America.\" The Global Medical Relief Fund, a small charity based in New York that helps children of war and natural disasters, has arranged for surgery and treatment at the Shriners Children Hospital in Philadelphia, Pennsylvania. Elissa Montanti, the founder and director of the organization, says she was inspired to act when she first heard of Mohammed's tragic story. \"I said, 'Oh, please, let me help this boy.' \" Mohammed will arrive in the United States on Thursday afternoon. He will be fitted for a prosthetic leg in coming weeks and examined to see if he needs additional surgery. Montanti said her organization has a list of other young Iraqi children in need of help. \"The word needs to get out.\" Asked how it makes her feel to help Mohammed, she says, \"It makes me cry with joy.\" Mohammed, too, is ecstatic. \"I didn't think this act of human kindness would be presented to me,\" he says. \"I didn't have hope in Iraq -- hope that I would ever get my hope back. I didn't have a future.\" He adds, \"I want to go to America and meet this person that gave me my future back.\" When he comes back home, he wants to help rebuild Falluja, starting with his school, which was bombed during the 2004 Falluja offensive. \"I will never leave school and, God willing, I will continue my education and become an architect and build all the schools,\" he says, standing on his crutches. But first, he says, he wants to walk to water the tree he planted next to his cousin's grave. E-mail to a friend . CNN's Wayne Drash contributed to this report from Atlanta.", "NEW DELHI, India (Reuters) -- India has elected its first female president, official results show, in what supporters are calling a boost for the rights of millions of downtrodden women, despite a bitter campaign marked by scandal. Pratibha Patil, 72, is India's first elected female president. Pratibha Patil, the ruling coalition's 72-year-old nominee for the mainly ceremonial post, easily beat opposition-backed challenger and vice president, Bhairon Singh Shekhawat, in a vote by the national parliament and state politicians. \"This a victory of the people,\" Patil told reporters after official results were announced Saturday. \"I am grateful to the people of India and the men and women of India and this is a victory for the principles which our Indian people uphold.\" Patil won about two thirds of the electoral college votes. There had never been any doubt she would win, given support from the ruling coalition. The governor of the northwestern desert state of Rajasthan, she emerged on the national stage when the Congress-led coalition and its communist allies failed to agree on a joint candidate. \"This is a very special moment for us women, and men of course, in our country because for the first time we have a woman being elected president of India,\" Congress party leader Sonia Gandhi, India's most powerful politician, said. Supporters hoped Patil's candidacy would help bring issues that plague women in India, like dowry-related violence, into the public spotlight. A woman is murdered, raped or abused every three minutes on average in India. Her presidency also reflects the growing power of some women in India, where an increasing number are taking part in the workforce and in schools and hold senior positions in corporations. After the results, Patil supporters took to the streets, singing and dancing as others lit fire crackers and beat large brass drums. India has had a number of female icons in the past -- most famously Sonia Gandhi's mother-in-law, Indira, who was one of the world's first female prime ministers in 1966. But hope Patil's presidency would spark only positive talk about women's influence in India evaporated when it emerged the bank for women she helped established was closed in 2003 because of bad debts and amid accusations of financial irregularities. The employees' union has taken Patil and others to court, claiming loans meant for poor women were instead given to her brother and other relatives and not returned. She was also accused of trying to shield her brother in a murder inquiry. Prime Minister Manmohan Singh, who has dismissed accusations against her as \"mud-slinging\", said on Saturday her victory was \"a vote against the politics of divisiveness\". \"All the allegations against me are motivated and have already been answered,\" Patil said in a statement last week. Her campaign was marked by other mishaps as well. She managed to offend many minority Muslims, and anger some historians, by saying Indian women first veiled their heads as protection against 16th century Muslim invaders. Then she dismayed modern India by claiming she had experienced a \"divine premonition\" that she was destined for higher office from a long dead spiritual guru. Critics also dug up a comment she was said to have made as Maharashtra's health minister in 1975, saying people with hereditary diseases should be sterilized. E-mail to a friend . Copyright 2007 Reuters. All rights reserved.This material may not be published, broadcast, rewritten, or redistributed.", "SAN DIEGO, California (CNN) -- More than 100 homes in an upscale San Diego community were evacuated after a landslide about 60 yards wide pulled the earth from beneath a three-lane road and some of the multimillion-dollar homes that adorn it. Gina Yarbrough sent this picture of the road that collapsed in Wednesday's landslide. Mayor Jerry Sanders declared a state of emergency, asking California and the federal government to help the La Jolla community recover from the Wednesday landslide. As of Thursday morning, he had already received offers of aid from legislators, the governor's office and the White House, he said. Officials warned for at least two weeks that the ground was shifting beneath the hillside community along Soledad Mountain Road. Holes were drilled into the unsettled hillside to investigate the cause and magnitude of the shift, which earlier ruptured a water line, and according to some media reports, began cracking Soledad Mountain Road in July. On Wednesday, a 20-foot-deep chasm opened beneath the road and homes. Holli Weld told San Diego's KGTV that she was walking her son to preschool when the street collapsed.  Watch a resident recall how he had to grab his dogs and run » . \"The street was sinking before our eyes,\" she said. Authorities told KGTV that most residents were at work and only seven people were in their homes when the landslide occurred. Evacuated homeowner Russell Moore told CNN he remembers hearing the earth \"groan\" in what he called a \"slow avalanche.\" \"The asphalt that should be under my feet was 8 feet in the air,\" Moore said. \"We watched the trees snapping and cracking and more boulders come down to our feet and we were witnessing this move.\"  See photos of the hole the landslide left in La Jolla » . At least 111 homes were evacuated, but Sanders said residents would be allowed to return to 75 of those houses by early Thursday morning. Several homes were damaged and at least one was destroyed, according to media reports. Nine homes are \"red tagged,\" meaning no one is allowed to enter them, and 27 more are \"yellow tagged,\" which means residents can return for necessities, but cannot stay, Sanders said. According to the San Diego Union-Tribune, the landslide downed power lines and caused a minor gas leak. More than 2,400 customers were briefly left without electricity, but most residents had their power restored by Thursday, KGTV reported. The Red Cross opened a shelter at La Jolla High School. Deputy city engineer Robert Hawk told the Union-Tribune that the hillside has slowly been slipping for years because the soil is unstable. Landslide incidents in the neighborhood date back to the 1960s, Hawk told the newspaper. Pat Abbott, a retired geological sciences professor at San Diego State University, told the Union-Tribune that Mount Soledad is made up of weak layers of rock and that the culprit in the landslide is nature. \"Gravity pulling on the incline is pulling down masses of earth and those masses of earth have houses on top of them,\" Abbott told the paper. \"It's a geologically bad site and should not have been built on to begin with.\" E-mail to a friend ."]