["ABECHE, Chad (CNN) -- Most of the 103 children that a French charity attempted to take to France from Chad for adoption are neither Sudanese nor orphans, three international aid agencies reported on Thursday. Hundreds of women protest child trafficking and shout anti-French slogans Wednesday in Abeche, Chad. Six members of Zoe's Ark were arrested last week as they tried to put the children on a plane to France, where the charity said host families were waiting to take the children in. Three French journalists, a seven-member Spanish flight crew and one Belgian were also arrested. Representatives of the journalists and flight crew said they were unaware of problems with Zoe's Ark and thought they were on a humanitarian mission. Chadian President Idriss Deby hopes the journalists and the flight crew will be freed, his chief of staff, Mahamat Hissene, said Thursday. The president would legally be able to intervene in the case if it is transferred from a judge in the eastern city of Abeche, where the children were taken, to a judge in N'Djamena, the capital, Hissene said. The transfer will take place Monday, according to media reports. The International Red Cross Committee, the U.N. High Commissioner for Refugees and UNICEF said most of the children were living with their families before Zoe's Ark took them. The charity said the children were Sudanese orphans that it was trying to rescue from a war-torn nation. The agencies said most of the children also probably come from Chadian villages along Chad's border with Sudan. The children have been living in an orphanage in Abeche while authorities and aid agencies try to determine their identities.  Watch a report on whether the children are orphans » . Chadian authorities immediately accused the charity of kidnapping the children and concealing their identities. Chad's interior minister said Zoe's Ark dressed the children in bandages and fake intravenous drips to make them look like refugees who needed medical help. The charity workers and journalists have been charged with kidnapping and extortion and could face 20 years of hard labor if convicted. The Spaniards and Belgian are charged with complicity. The Spanish flight crew is innocent and should be released, a company executive said Thursday. \"We thought we were doing a humanitarian transport,\" said Antoni Cajal, sales director of Spain's Gir Jet charter firm. \"If an NGO [nongovernmental organization] has done something wrong, it's impossible for us to know.\" Spain's Foreign Ministry has publicly expressed its disagreement with the charges and has dispatched top diplomats to Chad to try to win the group's release. Over the weekend, the captain appealed urgently to be rescued, fearing the crew could be harmed or killed, Cajal said. But the four women and three men are in good condition in custody, Cajal said, based on his conversations with a Spanish consular official who came from Cameroon to Chad and has been able to visit them. The detention is the first problem of its kind for the company, which hopes government negotiations can resolve the issue, Cajal said. On its Web site, Zoe's Ark describes itself as a nonprofit organization based in Paris that sends teams of physicians, nurses, firefighters and other specialists to care for children in war zones and place them with families in France, who then apply for asylum on their behalf. The Red Cross, UNHCR and UNICEF said the 21 girls and 82 boys range in age from about 1 year to about 10, and they are healthy. The agencies said they have been interviewing the children individually to determine their backgrounds. \"So far, the interviews carried out with the children -- some of whom could not provide any information due to their young age -- led to the preliminary conclusion that probably 85 come from Chadian villages near the cities of Adre and Tine along the Chadian-Sudanese border,\" the agencies said. \"Ninety-one children said they had been living with their family, consisting of at least one adult they considered to be their parent,\" the agencies said, adding that interviews with the remaining 12 children were ongoing. The agencies called their investigation painstaking and challenging because of the number of children, their youth and the situation in the region. Other French charities earlier had questioned whether Zoe's Ark could legally arrange adoption of children from Darfur, and contacted French authorities, according to French newspapers and The Associated Press. French authorities have reacted angrily to the Zoe's Ark trip, calling the group's actions \"illegal and irresponsible.\" The French Foreign Ministry has said the dispute will not affect France's participation in a European peacekeeping force due to be deployed along the border between Chad and Sudan. In response to the dispute in Chad, the Republic of Congo said late Wednesday it was suspending all international adoptions, The Associated Press reported. Reporters Without Borders said it will work for the release of the three journalists arrested in Chad. The organization said photographers Marc Garmirian of the Capa news agency and Jean-Daniel Guillou of the Synchro X agency were on assignment for their news organizations and were not part of the charity's efforts. The third journalist, Marie-Agnes Peleran of the TV station France 3 Miditerranee, was traveling with the group in a personal capacity, though she carried a camera from her station, Reporters Without Borders said. E-mail to a friend . CNN's Al Goodman contributed to this report. Copyright 2007 CNN. All rights reserved.This material may not be published, broadcast, rewritten, or redistributed. Associated Press contributed to this report.", "(CNN) -- Explorer Dennis Schmitt found an island nearly two years ago near Greenland. Fishermen pass by Greenland's Ilulissat fjord in this September 2004 picture. Such a discovery would usually elicit curiosity, even wonder perhaps, but it evoked mixed feelings for the explorer. The island was once thought to be a peninsula attached to Greenland by an ice shelf or a glacier. But such a large amount of ice melted, it revealed the distinct island. \"I very quickly realized two things,\" he told CNN's Anderson Cooper during a visit to the island earlier this year. \"One [was] that this was going to be significant because it was going to be an example of climate change.\" \"The other thing was that it meant it was really happening. It wasn't a joke. It wasn't just statistics. It was really happening.\" He calls his discovery Warming Island. Many climatologists and scientists say arctic ice melt and other changes in the Earth's climate are the result of an increase in the world's temperature, a trend widely called global warming. Many global warming experts say the phenomenon, if unchecked, is capable of altering the world's climate and geography. In the worst-case scenario, experts say oceans could rise to overwhelming and catastrophic levels, flooding cities and altering seashores. Other scientists and observers, a minority compared to those who believe the warming trend is something ominous, say it is simply the latest shift in the cyclical patterns of a planet's life. Most of the scientific community believes that some warming is occurring across the globe and through some layers of the atmosphere. But why it is occurring and what that means for the future is scientifically and politically contentious. The Earth's temperature averages about 60 degrees Fahrenheit (about 16 degrees Celsius). The average surface temperature has warmed one degree Fahrenheit (0.6 degrees Celsius) during the last century, according to the National Research Council. The temperatures were relatively unchanged from 1880 to 1910, according to the U.S. Environmental Protection Agency. They rose till about 1945, cooled until about 1975 and have risen steadily to present day. There are several possible reasons for the warming, scientists say. A change in the Earth's orbit or the intensity of the sun's radiation could change, triggering warming or cooling. The reason most cited -- by scientists and scientific organizations -- for the current warming trend is an increase in the concentrations of greenhouse gases, which are in the atmosphere naturally and help keep the planet's temperature at a comfortable level. The amount of carbon dioxide in the atmosphere, for instance, has increased by 35 percent since the dawn of the industrial age, according to the United Nations' Intergovernmental Panel on Climate Change, commonly referred to as the IPCC. The presence of methane is now 151 percent above pre-industrial levels, but the rate of increase has slowed in recent decades, according to the EPA. Meanwhile, nitrous oxide increased by about 18 percent during the past 200 years. Many scientists and experts who have studied global warming believe the increase is primarily the result of human activities, like the burning of fossil fuels, emissions from vehicles and the clearing of forests. \"For the last 30 years, there's no way there's anything natural that can explain it,\" Stephen Schneider, a professor of environmental studies at Stanford University in California, said. \"A vast bulk of the knowledgeable and honest community ... will say the science is settled and humans are at least a majority of the reason behind the warming,\" he added. Many scientific organizations share Schneider's view, ranging from the national academies of the countries that comprise the G8 to the National Research Council, the American Meteorological Society and the American Geophysical Union. But there are those who do not share his view, and among the skeptics is Richard Lindzen, a professor of atmospheric sciences at the Massachusetts Institute of Technology. \"We've suddenly taken to reading tea leaves,\" he said. \"When we saw cooling from 1940 to 1970, we were proclaiming global cooling. Since then, there's been a few tenths of global warming, so we're proclaiming global warming.\" He believes the current warming trend is the result of natural variability, where a planet goes through phases of warming and cooling and the human contribution to it is minimal. \"The Earth is always getting colder and warmer,\" he said. \"It's always changing. In fact, this is true of any fluid-covered planet.\" Asked about glacial melt, which many observers point to as evidence of global warming, Lindzen said the way glaciers change and move are phenomena largely unexplained. \"We don't know why, but it's perfectly clear that glaciers change even though the temperature is cooling at the place that they've occurred,\" he said. \"What we're doing is cherry picking any event that occurs and then saying that's occurring due to global warming.\" Yet, for Schneider, it is a cause for concern and alarm. \"We're already in serious melt, nobody can explain it. The models don't predict it,\" he said. \"We don't know what's going on up there. All we know is that we could be triggering something really nasty.\" The greatest point of contention is the possible implications for future political and economic policies for the world's nations. The IPCC in February 2007 projected that if carbon dioxide levels doubled relative to pre-industrial levels, temperatures could rise between 3.6 to 8.1 degrees Fahrenheit (2 to 4.5 degrees Celsius) by 2100. The lower end of the range could cause more intense hurricanes, droughts, wildfires and flooding, Schneider said. The higher end could lead to the catastrophes commonly associated with the visions of Hollywood filmmakers. Uncertainties, however, plague such forecasts, which are based on computer simulations and models. The models contemplate factors associated with how the atmosphere, oceans and continents interact, all natural elements that have unpredictability intrinsic to them. \"Exactly how much it's going to warm up, we don't know,\" Schneider said. \"That it's going to warm up? I'd bet anything on that.\" E-mail to a friend .", "MOGADISHU, Somalia (CNN) -- An enraged crowd dragged the body of an Ethiopian soldier through the streets of Somalia's capital Thursday after gun battles with Islamic insurgents killed 19 people, witnesses reported. In a brutal echo of a 1993 battle involving Somali militias in which the bodies of U.S. troops were dragged through the streets, crowds Thursday shouted \"God is great\" as they pulled the bruised, bullet-riddled corpse through a dusty Mogadishu neighborhood. The body was bound hand and foot with wire and wrapped in a sheet of plastic when insurgents pulled it out of a car and left it with the crowd in the northern Mogadishu neighborhood of Suqa Holaha, witnesses reported. Nine Ethiopians are reportedly part of the 19 dead. Another battle broke out on the city's south side Thursday morning between Ethiopian troops and insurgents armed with heavy machine guns and rocket-propelled grenades. The fighting drove hundreds more people from their homes, on top of the tens of thousands aid agencies say have fled in recent weeks. \"Ethiopians will launch violent attacks on us, for some of their comrades have been killed today,\" said Rahma Nor Omar, an elderly woman in the capital. \"They will be like wounded animals.\" Witnesses put the death toll from the day's clashes at 19, including Ethiopian troops, insurgents and civilians. Ethiopian troops arrived in Somalia in December 2006 to help a weak Somali government drive the Islamic Courts Union out of Mogadishu and restore a U.N.-backed transitional government after a decade and a half of near-anarchy. The Islamists responded by launching an insurgency against Somali government and Ethiopian troops that has lasted nearly a year. The United States accused the ICU of harboring suspected al Qaeda figures, including three men wanted in the 1998 bombings of U.S. embassies in Tanzania and Kenya, and raised no objections to Ethiopian presence in Somalia. Washington has long been concerned that Somalia could turn into a safe haven for terrorists, but ICU leaders denied harboring al Qaeda suspects. E-mail to a friend .", "BOLINGBROOK, Illinois (CNN) -- The disappearance of a suburban Chicago police sergeant's wife is now being treated as a potential homicide, and her husband is a suspect, authorities said Friday. Stacy Peterson, 23, has been missing from her suburban Chicago home since October 28. In another development, a judge signed an order to exhume the body of Drew Peterson's third wife, who was found drowned in a bathtub in 2004, said Will County State Attorney James Glasgow. Peterson, 53, said he last spoke to 23-year-old Stacy Peterson -- his fourth wife -- the night of October 28. Drew Peterson initially told the media he believed his wife ran off with another man, but he hasn't repeated that accusation. CNN has been unable to contact Drew Peterson for comment. The couple have been married four years and have two children, who have been interviewed for the investigation, Glasgow said. Drew Peterson also has older children from a previous marriage. Investigators have twice searched the couple's home and vehicles, and removed several items, including computers, said Illinois State Police Capt. Carl Dobrich. Drew Peterson allowed a limited search on the night his wife was reported missing, but investigators were not allowed to look throughout the entire house and were given access to only one of the vehicles at that time, Dobrich said. \"Early on, we looked at this as a missing persons case, but also believed strongly ... it was strongly starting to look at Drew Peterson as being a person of interest,\" Dobrich said. \"I would say that right now, Drew Peterson has gone from being a person of interest to being a suspect.\" New information turned up during the investigation also raised questions about the death of Peterson's third wife, Kathleen Savio, which was ruled an accident by a coroner's jury, Glasgow said. \"There are strong indications that it was a homicide,\" he said. \"That's why we are doing the exhumation, because there are tests that need to be done that weren't done during the first autopsy.\"  Watch why authorities want to exhume the body » . Glasgow cited abrasions on Savio's body and a gash on her head that could not be readily explained. \"Our main thrust is to determine whether or not it was a homicide, and as we do that, we will see if there is any evidence that implicates anyone,\" he said. Glasgow, who was not state attorney at the time of Savio's death, said he reviewed the case file before deciding to reopen the case. \"With 29 years of experience, there was no doubt in my mind it wasn't an accident,\" he said. \"That was clear.\" In 2002, Savio was charged once with battery and once with domestic battery against her husband, but was found not guilty at trial, Glasgow said. Another time, she tried to bring domestic battery charges against Peterson, but no charges were ever filed. Savio's sister, Sue Doman, said Savio expressed fear of Drew Peterson. \"She told me all the time, 'He's gonna kill me. It's gonna look like an accident,' \" Doman said. Doman said she didn't believe her sister could have died in the way the investigation concluded. \"I don't understand accidental drowning. You just don't drown in the bathtub, especially a small whirlpool. You just don't do that,\" she said. Meanwhile, friends and family of Stacy Peterson said she expressed concerns about her husband. A friend, Steve Cesare, has told CNN he received e-mail from her describing her relationship as abusive. The woman's aunt, Candace Aikin, of El Monte, California, said Stacy Peterson confided in her that there were problems during a visit to the Peterson home in suburban Chicago last month. \"She said that she was afraid because he was following her around 24/7, even inside the house,\" Aikin said. \"He was very obsessed and stalking her, even inside her house. She was very, very full of stress and just not happy in her marriage at all,\" Aikin said.  E-mail to a friend .", "QUEBEC, Canada -- Third seed Julia Vakulenko will face comeback queen Lindsay Davenport in her first WTA Tour final at the Bell Challenge on Sunday. Julia Vakulenko will seek her first victory on the WTA Tour at the Bell Challenge in Quebec. The Ukrainian battled through with a 6-1 4-6 7-5 victory over American qualifier Julie Ditty in the semifinals. The 24-year-old, who reached the fourth round of the U.S. Open, had previously twice lost at the last-four stage this year in Las Vegas and Berlin. She reached a career high of 33rd in the world rankings back in May, but is now 36th. \"Sometimes you play your best and win easy, but sometimes you don't play your best and really have to fight hard,\" said Vakulenko, who squandered points for 5-3 leads in both the second and third sets. \"I'm just going to try my best -- I've never played her and I'm looking forward to it.\" Former world No. 1 Davenport is seeking her second win in three tournaments since returning from a one-year hiatus to have a baby. The 31-year-old, who is unseeded after accepting a wild-card to enter the Canadian tournament for the first time, also had to battle to beat Russian second seed Vera Zvonareva 6-2 6-7 (3-7) 6-3 in the semifinals. The three-time Grand Slam winner has surged back up the rankings from 234th to 126th after winning her comeback tournament in Bali and then reaching the last four in Beijing. The American has now beaten Zvonareva in all six encounters between the two players. \"I played well in the first set and had some chances early in the second set, but I didn't quite capitalize on them. I was able to come back but at 4-4 and 5-5 I just didn't return well enough,\" Davenport said. \"I was happy I was able to regroup in the third set. Physically I feel good. There are lots of positives I can take from it, especially beating a really good player and now being in the final. \"I want to be the one on the offensive and not the defensive, and that's what I'm going to try to do. \"I was trying to watch the first semifinal and see if that helped, but I play so much differently than Julie Ditty that it was hard to get anything from it.\"  E-mail to a friend .", "ISLAMABAD, Pakistan (CNN) -- Hours after declaring a state of emergency Saturday, Pakistani President Pervez Musharraf ordered troops to take a television station's equipment and put a popular opposition leader under house arrest. President Pervez Musharraf explains his actions in a televised address Saturday. Musharraf also suspended the constitution and dismissed the Pakistan Supreme Court's chief justice for the second time. On Sunday, police arrested the Javed Hashmi, the acting president of ex-Prime Minister Nawaz Sharif's opposition party was arrested, along with 10 aides, The Associated Press reported. Hashimi was arrested when he stepped outside his house in the central city of Multan, AP reported. The country is at a critical and dangerous juncture -- threatened by rising tensions and spreading terrorism, Musharraf said in a televised address to the nation after declaring martial law. As Pakistani police patrolled the streets of the capital, Islamabad, Musharraf said his actions were \"for the good of Pakistan.\"  Watch Musharraf's speech » . There was quick condemnation from within and outside his country. The Supreme Court declared the state of emergency illegal, claiming Musharraf -- who also is Pakistan's military chief -- had no power to suspend the constitution, Chief Justice Iftikhar Mohammed Chaudhry said. Shortly afterward, government troops came to Chaudhry's office and told him the president had dismissed him from his job. Justice Abdul Hameed Dogar was quickly appointed to replace him, according to state television. It was the second time Chaudhry was removed from his post. His ousting by Musharraf in March prompted massive protests, and he was later reinstated.  See a timeline of upheaval in Pakistan » . Musharraf complained in his speech that the media -- which he made independent -- have not been supportive, but have reported \"negative\" news. Early Sunday, two dozen policemen raided the offices of AAJ-TV in Islamabad, saying they had orders to take the station's equipment. The government also issued a directive warning the media that any criticism of the president or prime minister would be punishable by three years in jail and a fine of up to $70,000,  said Talat Hussain, director of news and current affairs for AAJ.  Watch a former Pakistani P.M. call the developments in his country 'disturbing' » . U.S. Secretary of State Condoleezza Rice -- who is in Turkey for a conference with Iraq and neighboring nations -- said The United States doesn't support any extra-constitutional measures taken by Musharraf. \"The situation is just unfolding,\" Rice said. \"But anything that takes Pakistan off the democratic path, off the path of civilian rule is a step backward, and it's highly regrettable.\" A senior Pakistani official said the emergency declaration will be \"short-lived,\" and will be followed by an interim government. Martial law is only a way to restore law and order, he said. Mahmud Ali Durrani, Pakistan's ambassador to the United States, agreed. \"I can assure you, he will move on the part of democracy that is promised ... and you will see that happen shortly.\" Musharraf was re-elected president in October, but the election is not yet legally official, because the Supreme Court is hearing constitutional challenges to Musharraf's eligibility filed by the opposition. Under the constitution, Musharraf couldn't run for another term while serving both as president and military leader. The court allowed the election to go ahead, however, saying it would decide the issue later. Some speculated that the declaration of emergency is tied to rumors the court was planning to rule against Musharraf. Musharraf has said repeatedly he will step down as military leader before the next term begins on November 15 and has promised to hold parliamentary elections by January 15. Meanwhile, popular opposition leader Imran Khan said early Sunday that police surrounded his house in Lahore, barged in and told him he was under house arrest. Musharraf also had Khan placed under house arrest during a government crackdown in March 2006. Asked about Musharraf's actions Saturday, Khan said, \"We are going to oppose this in every way.\" \"None of us accept ... this whole drama about emergency.\" Former Prime Minister Benazir Bhutto -- who arrived in Karachi Saturday from Dubai, where she had gone to visit her family -- described a \"wave of disappointment\" at Musharraf's actions.  Watch crowds surround Bhutto upon her arrival » . Bhutto -- who returned to Pakistan last month after several years in exile -- wants to lift her Pakistan People's Party to victory in January's parliamentary election in the hope she can have a third term as prime minister. The nation's political atmosphere has been tense for months, with Pakistani leaders in August considering  a state of emergency because of the growing security threats in the country's lawless tribal regions. But Musharraf, influenced in part by Rice, held off on the move.  Watch a report on the volatile situation in Pakistan » . Musharraf, who led the 1999 coup as Pakistan's army chief, has seen his power erode since the failed effort to oust Chaudhry. His administration is also struggling to contain a surge in Islamic militancy. E-mail to a friend . Copyright 2007 CNN. All rights reserved.This material may not be published, broadcast, rewritten, or redistributed. Associated Press contributed to this report.", "(CNN) -- The chief operating officer of the National Children's Museum was arrested Tuesday and is charged with distributing child pornography over the Internet, authorities said. Robert A. Singer is accused of sending images depicting child pornography to people he believed to be a 12-year-old girl and her 33-year-old mother, according to a statement issued by U.S. Attorney Michael Garcia of the Southern District of New York. In reality he was communicating with an undercover detective for the New York Police Department. Some of the pornographic images were sent from Singer's computer at the museum, according to an affidavit filed in support of the charges by a special agent who investigates child pornography and child exploitation for U.S. Immigrations and Customs Enforcement. The Washington museum posted a message on its Web site saying officials there are \"horrified\" by news of Singer's arrest. They reported that he has been suspended from his post, effective immediately, and is barred from the property. Singer, 49, was arrested at his home in Falls Church, Virginia, by federal agents, according to the prosecutors' statement. Authorities allege he engaged in several instant messaging \"chats\" and e-mail communications with the undercover detective, posing as the woman and her daughter, from August  to September. He is charged with five counts of distributing child pornography in interstate commerce. If convicted on each count, he would face a sentence of up to 140 years in prison -- up to 20 years for the first count and up to 40 years for each additional count, prosecutors said. Singer allegedly initiated contact with the undercover detective, posing as the mother, in an America On Line chat room called \"Cuties.\" The chat room attracts people who \"are known to trade in pornographic images, including child pornography,\" according to an affidavit filed in the case by a special agent who investigates child pornography and child exploitation for U.S. Immigration and Customs Enforcement. \"On five separate occasions in August 2007, Singer sent several images of child pornography over the Internet to the mother and the daughter, including images depicting sexual acts between minors and adults and images depicting known victims of child exploitation,\" prosecutors said. In his communications with the supposed daughter, Singer pretended to be a 15-year-old boy, authorities said. In August 2007, he sent her two images featuring child pornography, according to the affidavit, with the instruction, \"just delete it when you are done.\" A search of Singer's AOL account activity showed that from July to September, he sent about 80 images featuring child pornography to people including the detective, authorities said in the statement. Also, the search revealed that he had received about 10 images and one video depicting child pornography. Singer was expected to appear before a U.S. magistrate judge later Tuesday. He is identified in the complaint as a spokesman for the National Children's Museum, but a spokeswoman who asked not to be identified said he was promoted to chief operating officer within the past few months. He has been employed by the museum for four years, she said. In a written statement, the museum said it was notified by the Department of Homeland Security and ICE of Singer's arrest. \"We are horrified by the charges,\" the statement said. \"This news is deeply upsetting to the National Children's Museum family.\" \"As its essence, the National Children's Museum is about enriching the lives of children,\" the statement said. \"We are educators, child advocates and parents. Anyone who does anything that might endanger the welfare of a child has no place here. Harming children is against everything we stand for as an organization and as individuals.\" The museum, formerly known as the Capital Children's Museum, has been closed to the public since 2004, and operates from administrative offices, the statement said. A new facility is being built and is scheduled to open in 2012.  E-mail to a friend .", "(CNN)  -- With his hands and feet shackled and his face obscured by his long hair, Chester Arthur Stiles made his initial court appearance in Las Vegas, Nevada, on Wednesday morning on charges stemming from the videotaped rape of a 2-year-old girl. Chester Stiles appears Wednesday in a Las Vegas, Nevada, courtroom. Stiles, 37, was taken into custody Monday night after a Henderson, Nevada, police officer pulled over the white Buick Century he was driving. Prosecutors added a couple more charges before Wednesday's hearing, bringing the total to 23 felony counts, including a charge of lewdness with a minor, sexual assault and the use of a child in the production of pornography, according to a statement issued by the Clark County, Nevada, court. One of the lewdness charges stems from a 2004 incident, while the others are related to the videotape, the court said. Judge Deborah Lippis set November 19 as the date for the preliminary hearing. After the hearing, Stiles' court-appointed attorney said his client was overwhelmed by the public opinion in the case. \"I think he's a little out of it,\" public defender Jeff Banks said. Jerry T. Donohue, the attorney for the girl's mother, told CNN that the child on the videotape was younger than 3 when the abuse occurred. The girl, who is now 7, was found last month after a nationwide search. The girl's mother said on \"The Dr. Phil Show\" Wednesday that she was \"relieved\" about Stiles' arrest, although it would have been \"better if they found him dead.\" The woman said she will testify against Stiles if the case goes to court. She told Phil McGraw that her daughter remembers nothing about the videotaped assault and that she recently had a conversation with the girl about inappropriate touching. She said her daughter told her that if someone touched her inappropriately, the girl would scream and tell her mother. But, she told McGraw, \"I don't trust anybody now.\" Although she is in a relationship with a man her daughter calls \"Dad,\" she said, \"I don't feel comfortable leaving her with him, nor with anybody else. ... I just cry and blame it on myself.\" Eight-and-a-half months pregnant, she said the incident has placed a lot of strain on her. Asked if she would rather not have known about the assault, she said, \"Yes, I could have lived without knowing it.\" A former girlfriend of Stiles' said that, before the arrest, she lived in fear after going to police to identify the suspect after seeing enhanced photos from the videotape on the local news. \"I've had my share of nightmares,\" Elaine Thomas told CNN's Nancy Grace. Thomas said she screamed when she recognized the photos on television and had no choice but to contact police about the man she had thought was a \"weapons enthusiast\" with only a minor criminal record.  Watch Thomas say how she felt when she saw the photos » . \"How could I not tell them who that man was? That little girl suffered unimaginable things, and I knew for a fact it was him,\" Thomas said. Another former girlfriend of Stiles', Tina Allen, said this month she thinks she is the reason Stiles came in contact with the girl and is \"mortified\" by the allegations against him. \"He said he'd been in the Navy and, you know, I was looking for a strong guy to represent to my sons what I thought they needed to be,\" Allen said. Allen said she took Stiles to a crowded apartment where her son and daughter lived. Also living in the apartment were a family friend and her daughter, the alleged assault victim. Todd Allen, Tina Allen's son, said he recognized his old apartment from scenes in the video.  E-mail to a friend . CNN's Ed Payne and Ted Rowlands contributed to this report.", "JOHANNESBURG, South Africa -- South African fast bowler Dale Steyn took a career-best five for 34 as the Proteas took a tight grip on the first test against New Zealand in Johannesburg. Steyn's career-best 5-34 was his fourth five-wicket haul in 14 tests. New Zealand were bowled out for 118 in reply to South Africa's 226 and the home side piled on the agony by reaching 179 for two in their second innings. Hashim Amla and Jacques Kallis shared an unbeaten stand of 159 as South Africa stretched their lead to 287. South Africa's bowlers excelled to bring their side back into the game after their disappointing first innings. They snapped up five wickets in the morning session when the Kiwis could only muster 56 runs. Former New Zealand captain Stephen Fleming made 40 but the next best score was new cap Ross Taylor's 15. Fleming was struck on the right forearm by Steyn and did not field during the afternoon. Coach John Bracewell said he had gone for precautionary X-rays but there was only bruising. New Zealand, 41 for two overnight, lost nightwatchman Shane Bond, bowled by a Steyn yorker, before Makhaya Ntini claimed the crucial wicket of Fleming, who was well caught by AB de Villiers diving to his left at third slip. Scott Styris and Taylor scraped 19 runs in 10 overs before more wickets tumbled. Steyn's figures bettered his previous best of five for 47 against the same opponents at Centurion two seasons ago. It was his fourth five-wicket haul in 14 tests. Ntini took three for 47 and Kallis two for 11. South Africa made an uncertain start to their second innings with openers Herschelle Gibbs and captain Graeme Smith out cheaply, but Amla and Kallis blunted the attack and then took charge. They batted together for 205 minutes, Amla facing 230 balls and hitting 13 boundaries in his 85 while Kallis hit 12 fours off 122 deliveries in reaching 76. The Kiwis were left to regret  Brendon McCullum's failure to hold a chance from Amla off Shane Bond, when the batsman had only scored two. \"The ball was hard and new and we were trying to get momentum. It cost us a lot,\" said coach John Bracewell. E-mail to a friend .", "(Real Simple) -- Here are five great ways to enjoy your summer. Lazing in a hammock is one of the best ways to spend a summer evening. Best way to cut jeans into shorts  -- What better way to declare the start of summer? The key to cutting off jeans is not to go too short too soon. Slip on the jeans and mark the desired length on one leg with chalk. \"Take them off, fold the leg at the mark, and iron the fold,\" says Caroline Calvin, creative director of Levi's. \"Then cut just under the crease with fabric scissors. Lay the short jean leg on top of the other side and cut to evenly match.\" Repeat as needed to get the length you want. Ninety-degree days? Bring 'em on! The best way to catch fireflies --  How? With womanly wiles: \"Fireflies blink to attract a mate,\" explains naturalist Lynn Havsall, director of programs at the George B. Dorr Museum of Natural History, in Bar Harbor, Maine. \"Males fly around while females sit in trees, in shrubs, or on the ground. So find a female and watch her blinking pattern. Then imitate the pattern with a pen flashlight and the males will come to you.\" ]A plus: The bugs move slowly, so they're easy to trap in a jar. Punch some holes in the lid and add a little grass and a piece of fruit for moisture. Admire your pretty night-lights till bedtime, then let them go. The best way to run on the beach -- Who needs a treadmill when you have miles of shoreline? Running on the beach can get you into great shape. Take it from lifeguard Benjamin Guss, 25, of Del Mar, California, who recently qualified to compete in this year's Iron Man triathlon (yes, that means swimming 2.4 miles, biking 112 miles, and then running a marathon -- consecutively) in Kailua-Kona, Hawaii. Beware, shoeless Joes. If you choose to run barefoot, keep your workouts brief at first to allow tender soles to build up calluses. \"You can get blisters, even burns, from hot, soft sand,\" says Guss. \"I like to run barefoot, but for more than a couple miles, I wear shoes.\" Know your sand. \"In soft sand, one mile is like two,\" says Guss. You may work foot and leg muscles you don't always use, so start slowly. And hard sand can be as tough on your legs as the road, so wear running sneakers. Pick the right time to run. \"My favorite time is in the evening,\" says Guss. \"The wind dies down, and the sand isn't that hot.\" To work harder, fill small bags with sand to use as hand weights. The best way to get in and out of a hammock -- Everyone looks good lazing in a hammock  -- it's getting in and out that's tricky. To make it less so, try these tips from Penny Waugh, a buyer for http://www.hammocks.com/. • Position your backside toward the hammock's center and tilt back until you reach a 45-degree angle, with the hammock parallel to your rear. • Gently sit back into the hammock and let it level out. • Swing your legs up and stretch them out. • Lie back. Loll. Sigh contentedly. For a graceful exit, sit upright and swing your legs off, anchoring your feet on the ground. Then push with your behind, gathering momentum to stand. \"It's tricky, since there's nothing to hold on to,\" says Waugh. \"But it's good for the glutes.\" The best way to tie espadrilles -- Apply this lace-up logic from Meghan Cleary, author of \"The Perfect Fit: What Your Shoes Say About You.\" • Slide your foot fully into the shoe and plant it firmly on the floor. • Cross and tie the laces once behind the ankle, then bring them forward, cross and tie again, and continue up the leg, depending on how long the laces are. The calf is the maximum height -- any higher and you'll look like a gladiator. • Each time you cross and tie, secure the laces slightly tighter than is comfortable, since they will loosen a bit when you walk. Just don't cut off your circulation. • For a streamlined leg, make the final tie in the back. Create a more whimsical look by putting the final tie in front with a small bow. E-mail to a friend . Get a FREE TRIAL issue of Real Simple - CLICK HERE ! Copyright 2007 Time Inc. All rights reserved."]