["AMMAN, Jordan (CNN) -- In the sunbathed schoolyard of the Shmisani Institute for Girls in Amman, Jordan, principal Sanaa Abu Harb makes an announcement over the speaker system. Iraqi students at the Shmisani school in Amman gather around a teacher. One in 5 students there is Iraqi. \"All Iraqi girls come outside now. All Iraqi girls. Iraqi girls only!\" she repeats several times, making sure the message is clear and waving away Jordanian pupils attracted by the commotion. Dozens of girls in green apron-like uniforms pour out into the courtyard and cluster on the top level of a stone staircase overlooking a concrete playground. Harb wants the CNN crew to see how many Iraqi refugee girls her school is accommodating. This school year, she says, 145 students are Iraqi -- roughly 20 percent of the students at this state-funded institution -- with another 40 Iraqi children on a waiting list.  Watch Iraqi girls describe a long way from home » . The reason behind the jump in the number of Iraqis at the school is a new government policy: For the first time since the start of the Iraq war, Jordan is allowing all Iraqi children -- regardless of refugee status -- to enroll in state-funded schools. Simply, this means that even illegal refugees with no paperwork can send their kids to school with no questions asked. The move is cementing a massive population shift in the Middle East. More than 2.2 million Iraqis have fled the violence in their homeland, most of them seeking refuge in neighboring Jordan and Syria, according to humanitarian officials. Jordanian Minister of Education Khalid Touqan says he expects Jordan to accommodate 40,000 to 50,000 Iraqi students this year. That's more than double the number of Iraqi children enrolled in public school two years ago. Harb, on the front line of the phenomenon, says the influx is putting a strain on her school. Even with some U.N. and U.S. aid to Jordan, there's still not enough money. \"We need more teachers here, more resources, more buildings, more chairs for all Iraqi students and our students,\" she says. In a nearby neighborhood, in the study room of the Ahmed Toukan School for Boys, a handful of Iraqi kids talk of their experience living far from home. Seated at a rectangular table covered with a red and white tablecloth, the boys tell stories of horror and displacement. Eighteen-year-old Qutaiba lost five immediate family members before moving to Jordan to try to live a normal life. Matter-of-factly and with a straight-ahead stare, he repeats the number: \"Five members.\" Most of the boys and young men from Iraq have missed several years of school -- up to a four-year educational gap that will delay not only their high school graduation, but also their entry into the workforce. All say, though, that they feel lucky to have gotten out, even if the violence in their country means always having to be on the move, ready to live far from home and away from loved ones. \"It's not strange for me to be in the middle of people I don't know,\" says eleventh grader Ziad Tarek Al Shamsi. \"I had friends in Iraq when I was small, I left them. In America, I left them. I came here, I left them.\" He pauses: \"But you have to miss your country.\" The United Nations High Commissioner for Refugees estimates up to 250,000 school-age Iraqi children are in Jordan. Many of them are enrolled in private institutions. But as families run out of money they had when they left Iraq, they turn to public schools. Even so, more than a month into the new academic year, fewer Iraqi families than first anticipated enrolled their kids in schools this year. According to the charity Save the Children, 21,000 Iraqi children have so far enrolled in Jordanian classrooms. As a result, the government extended the deadline for student applications and cut down on the required paperwork for Iraqi families. The lower registration numbers were attributed in part to illegal refugees' fears of being identified through their children's school records. Regardless of what the final number will be this year, the population shift in the Middle East is, according to UNHCR head Antonio Guterres, the largest urban refugee situation in the world. Iraqi families are changing the social fabric of Jordanian society. About 10 percent of Jordan's population is now made up of Iraqi refugees -- the estimates range from 500,000 to 750,000 of them. The schoolchildren are living examples of how the Iraq war may permanently change the Middle East. \"Iraqi children will be incorporated and integrated within our mainstream line of education,\" says Touqan, the education minister. \"We will not run a parallel system of education.\" E-mail to a friend .", "(CNN) -- After weeks of controversy over Michael Mukasey's views on waterboarding, the Senate late Thursday approved the former judge's nomination for attorney general by a 53-40 vote. Waterboarding threatened to derail the approval of President Bush's nominee to lead the Justice Department. President Bush nominated Mukasey to replace longtime ally Alberto Gonzales, who resigned in September. The nomination had been considered at risk after a number of Democratic senators opposed Mukasey because of questions that arose from his views on the terror interrogation technique known as waterboarding and the president's power to order electronic surveillance. Mukasey, a former federal judge in New York, told senators he considers waterboarding \"repugnant,\" but he could not categorically say whether the technique amounts to torture, which U.S. and international law bans. Waterboarding is a technique that involves restraining a suspect and pouring water on him to produce the sensation of drowning. Mukasey's confirmation was all but assured last week when two key Democrats on the Senate Judiciary Committee -- Sens. Dianne Feinstein of California and Chuck Schumer of New York -- said they would vote in favor of Mukasey despite the controversy. \"The Department of Justice, once the crown jewel among government institutions, is adrift and rudderless,\" Schumer said Tuesday -- the same day the committee voted 11-8 to send Mukasey's nomination to the Senate floor. \"It desperately needs a strong and independent leader at the helm to set it back on course and I believe Judge Mukasey is that person.\" Schumer said that in a meeting Friday the nominee said that Congress would be within its rights to pass a law that bans waterboarding across all government agencies and that the president \"would have absolutely no legal authority to ignore\" it. Schumer said he believed Mukasey would be more likely to find waterboarding illegal than an interim attorney general. \"Indeed, his written answers to our notices have demonstrated more openness to ending the practices we abhor than either of this president's previous attorney general nominees have.\" But Mukasey's pledge to enforce such a law rang hollow with Sen. Patrick Leahy, D-Vermont, the Judiciary Committee's chairman. \"Some have sought to find comfort in Judge Mukasey's personal assurance that he would enforce a future, new law against waterboarding if this Congress were to pass one,\" Leahy said Tuesday. \"Unsaid, of course, is the fact that any such prohibition would have to be enacted over the veto of this president.\" However, the committee's ranking Republican, Sen. Arlen Specter of Pennsylvania, said he believed Mukasey would enforce a law banning waterboarding. \"He could have said a lot of things which would have given me more assurances,\" Specter said earlier. \"But he is intelligent; he's really learned in the law. He's strong, ethical, honest beyond any question. He's not an intimate of the president.\" A majority of Americans consider waterboarding a form of torture, but some of those say it's OK for the U.S. government to use the technique, according to a poll released Tuesday. Asked whether they think waterboarding is a form of torture, more than two-thirds of respondents, or 69 percent, said yes; 29 percent said no. Asked whether they think the U.S. government should be allowed to use the procedure to try to get information from suspected terrorists, 58 percent said no; 40 percent said yes. The CNN/Opinion Research Corp. telephone poll of 1,024 American adults was carried out over the weekend and had a sampling error of plus or minus 4.5 percentage points. E-mail to a friend .", "ORME, Tennessee (CNN) -- The drought in the Southeastern United States means more than just brown lawns to the folks in Orme, Tennessee. Water flows from their taps for just three hours each evening. A 1961 firetruck loads up with water from a hydrant in Alabama to haul back to Orme, Tennessee. The mountain spring that supplies water to the town usually dries up at the end of summer, but just for a few days. This year it dried up early, on August 1, and hasn't revived, leaving the town's 145 residents high and dry and relying on water trucked in from the next state. Every day at 6 p.m., Orme Mayor Tony Reames turns a big valve to release water from the town's tank. When he turns the crank again at 9 p.m., taps in the town run dry. \"When they cut it back on we jump for joy,\" Orme resident Debbie Cash said. \"And then you only have it for three hours.\" Three hours to do all the laundry, bathing, dishwashing and animal watering that has to be done.  Watch how Cash copes » . The old mining town could be the canary in the coal mine for the rest of the region. Just 150 miles to the southeast, the 4.5 million people who live in and around Atlanta, Georgia, are nervously watching water levels go down at their major reservoir. The drought has highlighted an ongoing struggle between Georgia, Alabama and Florida over rights to water from the Chattahoochee River. \"All of these people that are on the river systems better take note, because once your streams and tributaries to the river start drying up, the river isn't far behind,\" Reames said.  See photos of a Atlanta's shrinking Lake Lanier reservoir » . Volunteers take turns three days a week driving a tanker truck or Orme's diesel-belching 1961 fire truck to a hydrant near Bridgeport, Alabama, 2½ miles down the road. Making several round trips, they haul about 25,000 gallons of water back to Orme each day. Bridgeport, which gets its water from the Tennessee River, doesn't charge its neighbor. Stevenson and New Hope, Alabama, also help out, occasionally bringing trucks full of water to the hydrant, where it's transferred to the Orme trucks.  See where Orme has to go for water » . But things are looking up in Orme. A pipeline from Bridgeport is nearly complete, built with the help of a $378,000 grant from the federal government. \"With this new water coming in, then we'll have it made,\" Cash said. \"Now we won't have to worry about it no more.\" In addition, an Austin, Texas, company called H2O Guard is planning to donate water-saving sink aerators, shower heads and toilet valves to everyone in Orme  on November 17, company spokesman Robert Easter said. \"We think we're going to get another 90 gallons' savings per day per household,\" Easter said. \"That'll make that little water tower in that town go from three hours to four hours without any change in anyone's habits.\" Reames said residents have found creative ways to conserve, flushing toilets with condensation water from air conditioners and undrinkable water from swimming pools that were filled early in the summer. It's a lesson for everyone. \"Cherish the water you got and be kind of careful with it,\" Cash said, \"because you never know if you will be out of water.\" E-mail to a friend . CNN's Jim Kavanagh contributed to this report.", "(CNN) -- China has suspended exports of the Aqua Dots toys contaminated with a chemical that can convert to a powerful \"date rape\" drug, the state-run Xinhua news agency reported Saturday. The toys have caused some children who swallowed the craft toys to vomit and lose consciousness. China suspended exports of the Aqua Dots toys that contain a chemical that converts into a \"date rape\" drug. The agency said that the General Administration of Quality Supervision, Inspection, and Quarantine (AQSIQ) has ordered an investigation by quality control agencies and will release results as soon as they are available. The AQSIQ did not reveal the name of the toys' producer, Xinhua said. U.S. safety officials voluntarily recalled about 4.2 million of the Chinese-made toys Wednesday. Scientists have found the highly popular holiday toy contains a chemical that, once metabolized, converts into the toxic \"date rape\" drug GHB (gamma-hydroxy butyrate), Scott Wolfson, a spokesman with the U.S. Consumer Product Safety Commission (CPSC), told CNN. \"Children who swallow the beads can become comatose, develop respiratory depression or have seizures,\" a CPSC statement warned. The arts-and-craft beads, which have been selling since April at major U.S. retail stores under the name \"Aqua Dots,\" have also been distributed in Australia under the name \"Bindeez Beads.\" The Bindeez toys were recalled Tuesday by Melbourne-based Moose Enterprise Pty. Ltd. after three children in Australia swallowed large quantities of the beads and were hospitalized. \"I was so frightened because I thought she wasn't going to make it,\" Heather Lehane told CNN affiliate Network 7 of her 10-year-old daughter, Charlotte, who was hospitalized in Australia after ingesting some of the beads. In the United States, the Washington-based safety commission said it has in recent days received two reports detailing the severe effects of the digested beads, which are part of a craft kit aimed at kids 4 years and older. The CPSC said a boy nearly 2 years old \"swallowed several dozen beads. He became dizzy and vomited several times before slipping into a comatose state for a period of time.\" The commission said the toddler was hospitalized and has since \"fully recovered.\" The second incident involved a child who vomited, fell into a coma and was hospitalized for five days. It was not immediately clear whether the child had made a full recovery. Toronto-based toy distributor Spin Master Ltd. stopped shipping the Aqua Dots toys and asked retailers to pull them off their shelves, where they were previously sold for $17 to $30. Anyone with Aqua Dots at home should return the product to the company, CPSC spokeswoman Julie Vallese said. The toy had been named toy of the year in Australia and recently crested Wal-Mart's list of top 12 Christmas toys. Wal-Mart on Thursday listed the toys on its Web site as \"out of stock online\" and had removed them from their top toy list as well. This latest recall is part of a larger batch of recalls of Chinese-made toys that have swept across the country. Last month alone, U.S. government safety officials and retailers voluntarily recalled at least 69,000 Chinese-made toys over concerns of excessive amounts of lead paint, which can cause hazardous lead poisoning. E-mail to a friend . CNN's Janine Brady, Jason Carroll, Laura Dolan, Julie O'Neill and Leslie Wiggins contributed to this report.", "(CNN) -- Tens of thousands of Congolese refugees fled camps Tuesday in the Democratic Republic of Congo as rebel troops attacked government forces in the area, the U.N. refugee agency said. Refugees move along a road Tuesday in Mugunga, near Goma, in the Democratic Republic of Congo. A press release from the U.N. High Commissioner for Refugees said it didn't appear rebels had targeted the camps, but it reported some were looted after camp residents, classified as internally displaced persons, fled. Roads to Goma, about 10 miles from the camps, were crowded with refugees and local residents fleeing the fighting, the UNHCR reported. Torrential rain made the movement even more difficult. \"The main road toward Sake was crowded with people; we had difficulties getting through,\" UNHCR field safety adviser Pierre Nazroo was quoted as saying in the agency's release. \"Internally displaced people are moving from site to site, direction Goma.\" UNHCR spokesman Ron Redmond said, \"They have been living in extremely difficult conditions anyway. Now they have nothing but what they can carry.\" Redmond added, \"These are people in poor health; they are soaking wet because of the torrential downpours. They need shelter, they need water, they need a lot of assistance so we're going to have to move quickly to get that help to them because a lot of them are already in a weakened state.\" While the Congolese government accused troops under rebel general Laurent Nkunda of staging the attack, a Nkunda spokesman denied the allegation, according to a report from the Integrated Regional Information Networks, a U.N.-affiliated news service. The spokesman, Bwambale Kakolele, said Rwandan Hutu rebels who also operate in the area were behind the attack, that report said. A spokesman for the U.N. military mission in the Congo said it was uncertain which group attacked the Congo army outpost near the village of Kishangazi, according to the U.N.-affiliated news service. \"We think it could have been insurgents close to Nkunda who attacked, but we cannot rule out the [Rwandan rebels],\" spokesman Col. Pierre Cherayron was quoted as saying. The UNHCR identified the affected camps as Mugunga I, Mugunga II, Lac Vert and Bulengo, saying about 28,000 had abandoned the first three camps and about 2,000 had left Bulengo. The UNHCR said 375,000 Congolese in North Kivu province have been forced from their homes in the past year. In the past two months alone, 160,000 have fled their homes amid the fighting between renegade troops and government forces, the agency said. North Kivu is in eastern Congo near the borders of Rwanda and Uganda. Congolese President Joseph Kabila has tried to gain a cease-fire with the rebels in the area under Nkunda, but fighting continues as hard-liners among the rebels and in the government have blocked reconciliation efforts, according to the International Crisis Group, an nongovernmental organization looking for solutions to conflicts. E-mail to a friend .", "(LiveWire) -- Voluble Gary Vaynerchuk, 31, the host of \"Wine Library TV,\" an online video show, has been known to lick rocks, suck leather and eat dirt while on camera, all to illustrate the unique properties of wine. \"Wine Library TV\" host Gary Vaynerchuk discusses four spooky wine varieties for Halloween show. Of a \"wild and gamey\" red from Rioja, Spain, Vaynerchuk says, \"Hit a deer on the road. Throw a bunch of cherries on it. Take out your knife, cut the deer. Bite it. That's the flavor profile.\" That kind of attitude appeals to people who are mystified by the arcane lexicon of traditional wine journals or turned off by what they perceive as elitist barriers. Across the Internet, budding wine geeks are discovering a burgeoning number of Web sites, blogs, bulletin boards and other outlets that preach the gospel of the grape in terms they can understand. About 40,000 Internet viewers  -- many of them 20-somethings -- have a daily appointment with \"Wine Library TV.\" The low-budget video blog is produced five days a week from a nondescript office in the three-level wine retail operation that Vaynerchuk's family owns in Springfield, New Jersey. Vaynerchuk has a discerning nose and palate, and he doesn't dumb down his subject. Yet he stuffs his patter with sports and pop-culture references -- and the kind of language a Wine Spectator critic would be unlikely to employ. The mission of wine sites like \"Wine Library TV,\" say several of the people behind these new outlets, is to demystify wine (and in some cases, sell it, too). Using the language, attitude and new media that appeal to a young, tech-savvy generation, they advocate trusting one's own palate rather than obeying powerful wine critics. Some of the sites also provide opportunities for average wine drinkers to share their opinions. One site, SavorEachGlass.com, declares its dedication to \"exploring the spirit of wine for a new generation,\" with reviews, online journals and essays that explain the finer points of winemaking  -- all with attitude. \"The (wine) establishment is about ratings and 'reputation,'\" says the site's founder, Tynan Szvetecz, 29. \"It's about collecting the 'good' stuff as defined by someone else's palate and tastes. That bores a younger generation.\" \"We're not afraid to be smartasses,\" he continues. \"We make fun of ourselves, old-world wine makers, new-world wine makers, and anyone else we can get our hands on.\" In the U.S., interest in wine is exploding. While consumption has leveled out in traditional wine-producing countries such as France, Italy and Spain, especially among young people, it has trended upwards in the U.S. for 15 straight years. The U.S. is projected to overtake No. 2 Italy by the end of 2007, according to the annual report The U.S. Wine Market: Impact Databank Review and Forecast a leading industry trade publication. Many of the new converts to wine are the so-called Millennials, the under-30 age group coveted by beverage marketers and so comfortable online that they're also called iGen, or the Internet Generation. One of the wine Web sites targeting a younger demographic is VineSugar.com, which features a blog called \"Wine Burps.\" \"We love wine but hate the elitism,\" writes founder, Ryan O'Donnell. \"After all, it's just grape juice.\" With rants about wine tasting fees, a feature spotlighting \"wine hotties\" working at California wineries, as well as interactive maps that plot and rate wineries, VineSugar.com leaves little doubt about its target audience. CellarTracker.com, an online wine community, appeals to more established wine collectors. The site provides free software  -- designed by Eric LeVine, a fortuitously named former Microsoft software developer  -- that allows wine enthusiasts to create an online inventory of their wines. The 39,000 users (who count 6 million bottles in their virtual cellars) post reviews of their wines and access scores and other data via PDAs and cell phones. Community tasting notes shed light on how cellar-worthy wines are evolving, helping others decide when to crack open a treasured bottle. Corkd.com, another online community of wine fans, already had 40,000 users when Vaynerchuk purchased the site last year. The free service allows users to catalog and review wines. Instead of having \"friends\" as on Facebook, members identify \"drinking buddies\" and check out what they're drinking. In the growing presence of wine fans on the Internet -- newbies as well as connoisseurs -- Vaynerchuk sees a movement. \"They're part of forums, they meet up (offline),\" he says. \"It's about bringing people together. It's all that's right about wine.\" Vaynerchuk should know. The 300-plus shows he has taped in the past two years have developed a cult following of online fans, who call themselves \"Vayniacs,\" share wine tips and obsess about their hero on the site's forum. On a recent rainy afternoon, Vaynerchuk barreled, unrehearsed and unscripted, through a 20-minute show in a single take. He wrapped up Wine Library TV episode No. 337 with what has become his signature line. \"You, with a little bit of me, we're changing the wine world, aren't we?\" E-mail to a friend . LifeWire provides original and syndicated lifestyle content to Web publishers. Neil Edward Schlecht is a freelance writer based in Litchfield County, Connecticut and the author of more than a dozen travel guides.", "AMMAN, Jordan (CNN) -- In the sunbathed schoolyard of the Shmisani Institute for Girls in Amman, Jordan, principal Sanaa Abu Harb makes an announcement over the speaker system. Iraqi students at the Shmisani school in Amman gather around a teacher. One in 5 students there is Iraqi. \"All Iraqi girls come outside now. All Iraqi girls. Iraqi girls only!\" she repeats several times, making sure the message is clear and waving away Jordanian pupils attracted by the commotion. Dozens of girls in green apron-like uniforms pour out into the courtyard and cluster on the top level of a stone staircase overlooking a concrete playground. Harb wants the CNN crew to see how many Iraqi refugee girls her school is accommodating. This school year, she says, 145 students are Iraqi -- roughly 20 percent of the students at this state-funded institution -- with another 40 Iraqi children on a waiting list.  Watch Iraqi girls describe a long way from home » . The reason behind the jump in the number of Iraqis at the school is a new government policy: For the first time since the start of the Iraq war, Jordan is allowing all Iraqi children -- regardless of refugee status -- to enroll in state-funded schools. Simply, this means that even illegal refugees with no paperwork can send their kids to school with no questions asked. The move is cementing a massive population shift in the Middle East. More than 2.2 million Iraqis have fled the violence in their homeland, most of them seeking refuge in neighboring Jordan and Syria, according to humanitarian officials. Jordanian Minister of Education Khalid Touqan says he expects Jordan to accommodate 40,000 to 50,000 Iraqi students this year. That's more than double the number of Iraqi children enrolled in public school two years ago. Harb, on the front line of the phenomenon, says the influx is putting a strain on her school. Even with some U.N. and U.S. aid to Jordan, there's still not enough money. \"We need more teachers here, more resources, more buildings, more chairs for all Iraqi students and our students,\" she says. In a nearby neighborhood, in the study room of the Ahmed Toukan School for Boys, a handful of Iraqi kids talk of their experience living far from home. Seated at a rectangular table covered with a red and white tablecloth, the boys tell stories of horror and displacement. Eighteen-year-old Qutaiba lost five immediate family members before moving to Jordan to try to live a normal life. Matter-of-factly and with a straight-ahead stare, he repeats the number: \"Five members.\" Most of the boys and young men from Iraq have missed several years of school -- up to a four-year educational gap that will delay not only their high school graduation, but also their entry into the workforce. All say, though, that they feel lucky to have gotten out, even if the violence in their country means always having to be on the move, ready to live far from home and away from loved ones. \"It's not strange for me to be in the middle of people I don't know,\" says eleventh grader Ziad Tarek Al Shamsi. \"I had friends in Iraq when I was small, I left them. In America, I left them. I came here, I left them.\" He pauses: \"But you have to miss your country.\" The United Nations High Commissioner for Refugees estimates up to 250,000 school-age Iraqi children are in Jordan. Many of them are enrolled in private institutions. But as families run out of money they had when they left Iraq, they turn to public schools. Even so, more than a month into the new academic year, fewer Iraqi families than first anticipated enrolled their kids in schools this year. According to the charity Save the Children, 21,000 Iraqi children have so far enrolled in Jordanian classrooms. As a result, the government extended the deadline for student applications and cut down on the required paperwork for Iraqi families. The lower registration numbers were attributed in part to illegal refugees' fears of being identified through their children's school records. Regardless of what the final number will be this year, the population shift in the Middle East is, according to UNHCR head Antonio Guterres, the largest urban refugee situation in the world. Iraqi families are changing the social fabric of Jordanian society. About 10 percent of Jordan's population is now made up of Iraqi refugees -- the estimates range from 500,000 to 750,000 of them. The schoolchildren are living examples of how the Iraq war may permanently change the Middle East. \"Iraqi children will be incorporated and integrated within our mainstream line of education,\" says Touqan, the education minister. \"We will not run a parallel system of education.\" E-mail to a friend .", "PATUAKHALI, Bangladesh (CNN)  -- Survivors of a storm that killed more than 3,000 people in the impoverished nation of Bangladesh grieved and buried their loved ones Monday as they waited for aid to arrive. Villagers grieve in Patargata, around 125 miles south of Dhaka, capital of Bangladesh, Monday. The number of dead killed from Cyclone Sidr -- now at 3,114 -- is expected to rise yet further as the South Asian nation continues to assess the damage. The Bangladesh Red Crescent fears the death toll could be 5,000 -- perhaps even reaching as high as 10,000. In the fishing village of Galachipa, in Patuakhali district, Dhalan Mridha was grieving for family members who died in the cyclone after ignoring an alert issued by authorities. \"Nothing is going to happen. That was our first thought and we went to bed. Just before midnight the winds came like hundreds of demons. Our small hut was swept away like a piece of paper, and we all ran for shelter,\" Mridha, a 45-year-old farm worker, told The Associated Press. On the way to a shelter, Mridha lost contact with his wife, mother and two children. The next morning he found their bodies. The Category 4 cyclone raked Bangladesh's southwest coast on Thursday with maximum sustained winds of 241 km/h (150 mph), destroying fishermen's hamlets and villages. Thousands are still missing, while an estimated 280,000 others are unable to return to their homes which were wiped out by the storm. Many grieving families are now burying loved ones in single graves as no male members are available to dig them. Most houses in the region are made of flimsy materials such as bamboo and corrugated iron, and had no chance of withstanding the storm's powerful winds. In addition, the storm-struck area is criss-crossed by a huge river delta which surged as Sidr pushed through, wiping out many villages and littering the river's shores with debris.  Watch as people are left to fend for themselves » . Low-lying Bangladesh is already prone to flooding which has wiped out the country's rice production -- a major food staple for the impoverished country. Improved warning systems and shelters have kept the number of deaths far lower than the disastrous cyclones in the region of 1970 and 1991, when the tolls were in the hundreds of thousands. Bangladesh President Iajuddin Ahmed visited the devastated region Sunday, handing out some aid to the crowds of people before members of the international media. It was seen largely a token effort as hundreds were left empty-handed and furious. Security officials struggled to hold back the crowd.  See dramatic photos of storm survivors » . Sidr has already ruined Bangladesh's rice harvest, but the international community is rallying to make sure the country does not suffer as acutely as it has in the past. Nearly a million people died after massive floods wiped out the country's rice production in 1974. International aid organizations promised initial packages of $25 million during a meeting with Bangladesh agencies Monday, the U.N.'s World Food Program said. The United States has offered more than $2 million as an initial contribution for emergency relief, and sent two U.S. Navy carriers to help in recovery operations. In addition, the U.S. Agency for International Development (USAID) is airlifting in relief supplies and an 18-person Department of Defense medical team is in Bangladesh helping the estimated 15,000 injured by the storm. Bangladesh's government held an emergency Cabinet meeting Saturday to assess the disaster and discuss recovery issues, Bangladeshi government spokesman Fahim Munaim told CNN. Officials fear the scope of the destruction may be much more extensive since there are remote areas where conditions cannot yet be determined. Munaim said nearly a third of Bangladesh's 64 districts were affected by the cyclone, most of those along the southern coast. The Bangladeshi military is working to provide shelter for the many people who have been displaced. International aid groups -- including Save the Children, World Vision, and the Red Crescent, which already have offices in Bangladesh -- are deploying resources to the cyclone-stricken region but -- like the government -- they have found it nearly impossible to reach the more remote areas to assess conditions. Roads to remote areas are either blocked by massive trees fallen by the storm, or so severely damaged that it is impossible for vehicles to use. Clearing could take weeks in the remote areas because it must be done by hand -- there are no chainsaws and modern machinery to speed up the process. Along the broken road that leads into Kolapara, the body of an 8-year-old girl called Rummie was carefully carried away for burial. Overwhelmed with sadness, her mother Khadija was steadied by a relative. \"I am feeling too much pain in my heart,\" she said. \"I have lost my daughter, so I am a victim of the cyclone as well.\" E-mail to a friend . CNN's Dan Rivers contributed to this report.", "GLASGOW, Scotland -- World champions Italy clinched qualification for Euro 2008 after goals in the first and last minutes gave them a pulsating 2-1 victory at Hampden Park -- killing off Scotland's hopes of reaching the finals. Luca Toni celebrates his early goal as Italy won 2-1 in Scotland to clinch qualification from Group B. Luca Toni shot Italy in front but Scotland recovered to dominate and Barry Ferguson bundled home a 65th-minute leveller. However, Christian Panucci headed an injury-time winner after a controversial decision to award Italy a free-kick. The result also means France have sealed qualification, along with Italy, from Group B without playing a game. In a match played in torrential rain, Italy enjoyed the best possible start by taking the lead after just 70 seconds.    Gianluca Zambrotta spotted Antonio Di Natale unmarked in the box, and picked him out with a throw-in as Scotland were caught napping. Di Natale swept the ball into the path of Toni who delicately flicked into the top left corner from six meters out. The home side almost conceded a second goal 60 seconds later. This time, Toni turned provider and his cut-back was met by Mauro Camoranesi who fired over from close-range. Toni then shrugged off two challenges before drawing a decent save from Craig Gordon with a well-struck effort that the goalkeeper did well to block at the near post. At the other end, Scotland were denied the opportunity to haul themselves back into the match when a thunderous drive from Lee McCulloch appeared to be handled by Zambrotta inside the area but penalty claims were ignored. Spurred on by a sense of injustice, the hosts cranked up the pressure on their visitors. Ferguson fired over from a James McFadden corner, before Alan Hutton nodded agonisingly wide of the upright following another perfect delivery from the Everton man. Scotland then produced some wonderful passing football, which culminated in a tight-angled drive from Ferguson, but Gianluigi Buffon dived low to smother. Then came another scare for the home side. Gordon was forced to pull a save out of the top drawer to deny a point-blank effort from Massimo Ambrosini, before Di Natale rifled the rebound into the back of the net. The assistant referee raised his flag for offside but television replays suggested the official may have called it wrong. Only last-gasp defending from the Italians prevented the Scots from grabbing a morale-boosting leveller on the stroke of half-time. David Weir rose above everyone else in a packed box to meet Ferguson's corner and his header appeared to be heading for the top corner before Andrea Pirlo somehow managed to nod off the line. A free-kick in a dangerous area provided Italy with the chance to start the second half as emphatically as they had started the first when Paul Hartley hauled down Camoranesi just outside the box. Pirlo seized on the chance and looped the ball over the wall but, despite a reputation as a dead-ball specialist, his effort was easily dealt with by Gordon. Instead, it was Scotland who found the back of the net as Hampden erupted with 65 minutes gone. McFadden's free-kick deflected into the path of McCulloch in front of goal. He was denied by Buffon, but the rebound fell kindly to Ferguson and the captain gratefully rifled home from close-range. With just over 15 minutes to go, Scott Brown was withdrawn for Kenny Miller as Scotland went for broke. The Derby striker quickly began to cause the Italians problems and delivered a wonderful diagonal cross to the feet of McFadden but he fired wide when it looked easier score. Scotland's impossible dream ended in the cruellest possible way when Italy snatched a last minute goal to secure their own qualification for Euro 2008. Hutton appeared to be barged over in front of the corner flag but the referee inexplicably awarded the free-kick the other way and Panucci rose to meet Pirlo's cross and nod home the winner. Italy coach Roberto Donadoni said: \"We knew it was going to be a physical match given the atmosphere. \"But through their character and desire, the lads were fantastic. They worked so hard, they deserve this. Qualifying for Euro 2008 is amazing. It's something positive after all that happened last week (the death of the Lazio fan).\" Captain Fabio Cannavaro: \"This was a victory won with the heart. It was difficult to play in this stadium, with that atmosphere it was like a cauldron. \"We played really well and managed to win. We showed once again that we are a strong and compact team and when we need to win we do everything to show that we are the world champions. \"In Italy we play a high level of football, we've won the Champions League and the World Cup but unfortunately at this moment we are being noticed for something else.\"  E-mail to a friend .", "(CNN) -- Authorities in Azerbaijan recently uncovered a radical Islamic terror plot against the U.S. Embassy in the capital, Baku, prompting the facility to close its doors to the public Monday, Azerbaijan and U.S. officials told CNN. The Bibi Heybat Mosque, just outside the capital Baku. As a precaution, Britain also shut its embassy in Baku to the public on Monday \"following security concerns nearby,\" Britain's Foreign Office said. The terror plot was unraveled after a weekend raid outside Baku that netted several suspected members of the radical group, two U.S. officials who asked not to be identified and a spokesman for Azerbaijan's National Security Ministry told CNN. U.S. State Department spokesman Sean McCormack stressed that the details \"are still unfolding,\" and the threat \"may or may not be\" linked to the Saturday raid. \"There were some specific and credible threat information concerning the embassy and plans by militants to in some way do harm to individuals in and around the U.S. Embassy there,\" McCormack said, noting that no specific individuals were targeted. Several days ago, an Azerbaijani army officer who had connections to a radical Islamic group seized four assault rifles, a machine gun and 20 hand grenades from his military unit and hid them in the outskirts of Baku, the ministry spokesman and U.S. officials said. Government security forces tracked down the group and arrested several members during a sweep on Saturday in the village of Mastaga, about 20 miles (32 km) northeast of Baku, the spokesman said. One suspected member of the militant group resisted arrest and was killed in the sweep, the spokesman said. Several others are still at large, he added. He said the terror plot also targeted Azerbaijani government buildings. The U.S. Embassy in Baku issued a warden message warning Americans in Azerbaijan to take precautions. \"While there is no information at this time that other American or Western interests in Azerbaijan are being targeted, the U.S. Embassy encourages Americans to maintain a high level of vigilance and take appropriate steps to bolster their own personal security,\" it said. Azerbaijan is a former Soviet republic that borders the Caspian Sea, and lies just north of Iran. McCormack said U.S. authorities are working closely with their counterparts in Baku and will determine when normal embassy operations will resume. He said he expects the embassy to limit its operations on Tuesday, as well. E-mail to a friend . CNN's Igor Malakhov in Moscow, Zain Verjee in Washington and Roger Clark in London contributed to this report ."]