["PARIS, France -- World number three Novak Djokovic crashed out of the Paris Masters after being trounced in his opening match by veteran Frenchman Fabrice Santoro on Wednesday. Fabrice Santoro returns the ball during his shock second-round victory against Novak Djokovic. The 34-year-old Santoro, who beat world No. 5 Andy Roddick at the Lyon Grand Prix last week, again rose to the occasion in front of his home fans as he stormed to a 6-3 6-2 second-round victory against the Serb. It was the first time the two players had met, with Djokovic making his first outing since losing to David Nalbandian in the semifinals of the Madrid Masters two weeks ago. Djokovic, like the American Roddick, has already qualified for the season-ending Masters Cup and will now have extra time to prepare for the event in Shanghai starting next month. The 20-year-old said he was struggling following dental surgery to remove two wisdom teeth. \"I couldn't give my 100 percent, not even 30 percent of my possibilities,\" Djokobvic said. \"He deserved to win. I'm still on medications. I didn't practise for a whole week, I only started practising two days ago. Physically, I'm not feeling at all good.\" The result is a boost for rising British star Andy Murray, who earlier kept alive his hopes of an unexpected place at the Masters Cup by winning his first match in Paris and was expected to face Djokovic. The 20-year-old, who has missed three months this season due to a wrist injury, beat Jarkko Nieminen of Finland 7-6 (7-5) 6-3 to progress into the third round. The 15th seed is seeking to overtake Tommy Haas, who holds the eighth and final place ahead of the showpiece event in Shanghai. Murray, who trails the German by just three points, has not beaten Djokovic in three meetings so far but he has never played his unseeded next opponent Santoro. Ninth seed Haas, who has struggled with illness and injury this year, will play Djokovic's compatriot Janko Tipsarevic in the second round. Murray, who won his second title this year at the St Petersburg Open last Sunday, made a confident start against Nieminen and showed little sign of the stiff back he suffered after a minor car crash on Monday. He held his serve to love against a player who was beaten in the final of the Swiss Indoors event by Roger Federer last weekend, but then struggled for his best form as the first set went to a tiebreak. The Scot was broken just one point after having a winner overturned following an on-court appeal, but he leveled immediately and then broke Nieminen again to win a third successive game before serving out for victory. Defending champin and fourth seed Nikolay Davydenko, one of six players to have already qualified for Shanghai, beat Argentina's Juan Del Potro 7-6 (7-3) 6-1 in his opening match on Wednesday. The Russian, fined for \"lack of effort\" after his defeat by Croatian qualifier Marian Cilic in St Petersburg, will next face Marcos Baghdatis of Cyprus in round three after Baghdatis shocked 13th seed Ivan Ljubicic. Ivo Karlovic broke Roger Federer's serve for the first time in his life, but the top seed and world number one progressed in a late match on Wednesday. Croatian Karlovic, the tallest man in tennis at 2.08 metres, went down 6-4 4-6 6-3 as Federer played for the first time at the Bercy event since 2003. Federer had gone 67 service games over four previous matches without a loss before Karlovic ended his duck to claim their second set. But the Swiss top seed got straight back in harness, breaking to start the final set and rolling ahead against a man he had just beaten days earlier in the Basel semifinals. World numbet two Rafael Nadal also reached the third round after thrashing Italy's Filippo Volandri 6-3 6-1. The Spaniard will next play Stanislas Wawrinka of Switzerland, who won by the same scoreline against 16th seed Juan Ignacio Chela of Argentina. E-mail to a friend .", "(InStyle) -- After years in the bronze age, when sun-kissed cheeks and gloss reigned supreme, fall's return to glamour means that lipstick is making a major comeback. Lipstick outsold gloss by $76 million last year, and beauty companies are racing to launch new formulas that are more wearable than ever. So pucker up. We'll show you how to apply lipstick perfectly, along with the most flattering shades for day and night. For foolproof application, stick with sheer, subdued shades in the morning and save deep, bold colors (which require more time and precision) for night. Daytime equation . 1. Condition and protect with a balm that contains sunscreen, like Softlips Raspberry with Green Tea SPF 20. \"Dab some on immediately after getting out of the shower, when your lips are still a little moist,\" suggests Hollywood pro Kara Yoshimoto Bua. The smoother your lips, the more perfect your lipstick will look. 2. Choose a soft shade such as rose or nude that you can apply straight from the tube. A hydrating formula ensures a smooth coat of color. Try Neutrogena Moistureshine Soothing Lipsheers in Fresh Rose. 3. Blot, reapply and blot again to remove excess oils and create a stain, says Bua. \"The color looks more natural and lasts longer.\" Instead of tissues, use lint-free blotting papers, like Boscia Fresh Blotting Linens ($10). Nighttime equation . 1. Exfoliate before applying a bold hue like red or burgundy. Sally Hansen Gentle Peel for Rough Lips ($10; at drugstores) uses fruit enzymes to remove dry patches. 2. Create a base with a gel-based primer that fills in fine lines around the mouth and helps lipstick go on more smoothly. One to try: Olay Regenerist lip treatment ($19; at drugstores). 3. Define the borders of your mouth with a pencil to prevent color from bleeding, says Robin Fredriksz, who gave Barrymore her deep fuchsia lip. To avoid an unnaturally dark outline, use a shade that's lighter than your lipstick, like Revlon Colorstay lip liner in Plum ($8; at drugstores). 4. Brush on color for more control. Try: Shu Uemura Kolinsky Portable Extra lipbrush ($35) with Isadora Perfect Moisture lipstick in Bordeaux Red ($11). Makeup artists' favorites . Just like us, cosmetics pros use the same lipsticks again and again. From the just right daytime rose to the classic evening red, here are some of their all-time go-to picks for day and night. Carmindy's neutral picks for day are designed to \"enhance your natural lip color.\" For night she recommends dark berry or true red for all skin tones. Her clients: Heidi Klum and Jamie-Lynn Sigler. Day shades: Benefit Silky Finish in Candy Store, $16; Givenchy Rouge Interdit in Secret Pink, $26. Night colors: Nars in Scarlet Empress, $23; Revlon Super Lustrous in Love That Red, $8; at drugstores. AJ Crimson likes a subtle pink or sheer beige for all skin tones during the day. For night he recommends bright red for fair complexions and a deep purple for darker ones. His clients: Missy Elliot and Amerie. Day shades: Chanel Rouge Hydrabase in Pink Sugar, $25; Laura Mercier in Candy Pink, ($22). Night colors: Maybelline Moisture Extreme in Royal Red, $7; at drugstores; MAC in Cyber, ($14). Melissa Silver uses fuchsia on cool skin tones and peachy nude on warm ones for day. For night, she says, \"anyone can wear plum or sheer red.\" Her clients: Renée Zellweger and Cindy Crawford. Day shades: Clinique Colour Surge Butter Shine in Fresh Watermelon, $14; Lancôme Le Rouge Absolu in Nectariche, $25. Night colors: MAC in Spice It Up!, $14; Sonia Kashuk in Sheer Cherry Blossom, $8. E-mail to a friend . Get a FREE TRIAL issue of InStyle - CLICK HERE! Copyright © 2007 Time Inc. All rights reserved.", "(InStyle.com) -- A hit TV show. An Emmy. A summer blockbuster. A new company. A wedding! Katherine Heigl has every reason to smile for our camera. A star -- and a trio of gorgeous looks -- is born. The Ingénue: \"This is my favorite look of the three just because it's sexy but not overtly so,\" Heigl says. \"I like simple hair and makeup.\" There has been a self-tanning mishap . As Katherine Heigl crosses the parking lot of the sandwich shop at the Roosevelt Golf Course at Griffith Park in Los Angeles, she walks stiffly, holding her arms away from her like a paper doll and apologizing profusely for running 10 minutes late. Earlier, she'd sprayed her entire body with self-tanner, which refused to dry. She resorted to having her fiancé, musician Josh Kelley, take a blow-dryer to her (didn't work). So here she is, in a strapless, ankle-length Juicy Couture sundress (donned to accommodate the residual stickiness), fanning herself and wondering how mottled the tan will be when (or if) the lotion ever sets. Not that one bum experience could turn her off beauty products. \"I love everything new,\" says Heigl, 28, who, in addition to being nominated for an Emmy for best supporting actress on \"Grey's Anatomy,\" just started a production company at Fox. \"When I was in Rhode Island filming this summer, I went to Sephora for the first time. It was like my holy mecca.\" She recently had her bathroom vanity renovated with a high counter to make more room for the large drawers below that hold her well-organized loot. Then there's her deal with Coty to be the face of Nautica's new women's fragrance in January. Considering this fondness for all things beauty -- as well as Heigl's impressive acting range -- she plays TV dramedy as deftly as cinematic romantic comedy, as in the mega-hit \"Knocked Up\" and next year's 27 Dresses -- it seems natural for her to be In Style's first ever triple-cover girl. These three looks take her from girl-next-door to red-carpet knockout to pixie-coiffed vamp. The star, whom pals call Katie (and Hollywood calls the Next Big Thing), popped out her retainer to talk about makeup, breakouts and what boys like. KATHERINE HEIGL: I'm so sorry, I have to take out my Invisalign before I eat. IN STYLE: Who knew you wore them? I guess that's the point of Invisalign. KH: I got them because of this wonky tooth. I was like, OK, I can't take it. It's awesome because every two weeks you switch to a new retainer. Pretty much the perfect way to describe Invisalign is Netflix for your teeth. IS: Right -- the things we do for beauty. So, how did you like being transformed into three such different looks? KH: It was fun. I was working with such great hair and makeup people. And to have these professionals turning you into someone else is pretty neat. IS: Do you ever go without makeup? KH: There was a time when I would. Now that I get followed by photographers, I'm really paranoid about it. I do not want to be the \"Look What This Celebrity Looks Like Without Makeup\" picture. I'm clearly vain, and I don't need that. Plus, I like products. IS: How often do you go through your drawers and purge? KH: Often, because people send me a lot of stuff now, which is exciting. I love getting those boxes. [Into the tape recorder:] Send me a box of makeup, Stila! When that happens, I feel like I have to clean out and give stuff to my sister, mom and friends because there comes a point of gluttony that I can't accept. IS: How do you think you express your personality through style? KH: I'm a big hair-up person. Last night at work they put my hair in two French braids to keep it flat under the scrub cap. I thought it looked cute and that I could pull it off after I'd slept on it. And ... no. So I thought I could recreate it myself ... no again. As far as clothing style goes, I fluctuate almost as much as I do with beauty products. I like to shop for sweaters -- maybe it's the New Englander in me. I'm building a house in the mountains in Utah, so I tell myself I'm \"preparing\" for that. I like sweaters -- they're like scrubs -- you don't have to suck it in or worry about the bloat. IS: Do you know how you want your hair and makeup at your wedding? KH: I have an idea, but it's so dependent on the dress, and I haven't gotten there yet. My sister is getting married too, so we looked for dresses together. After about five stores I was like, \"I'm done.\" Everyone says, \"You just know when you put that dress on.\" My sister found the right dress just like that. So I know it can happen. But it's grueling. IS: Wait, so your mom has two daughters getting married within months? KH: My poor mother is probably like, \"Why, God? Why?\" But I hired a planner. I want the day to be spectacular, but mostly I want it to be fun. And I don't want to freak out or stress. IS: Does your fiancé have any particular opinions about your look? KH: Josh wouldn't mind if my hair was brown, if it was still long -- that's such a boy thing. IS: Would you ever wear a wig out? KH: I'd contemplate it, but I don't know if I actually have the courage to pull it off. I once wore a long hair-extension ponytail, and someone asked me if it was real, like I was one of those dolls when we were little, and the hair just cranks out. IS: How would you describe your skin? KH: My skin is sensitive, so everything bothers it. And I'm the jerk who keeps switching products and making it worse. IS: How do you treat a breakout? KH: I got a great product at Ona Spa called Sebuspot. I've tried so many that were disappointments, but maybe I stand too close to the mirror examining my pores. If I backed up, things might look fine. IS: What do you always carry in your bag? KH: Powder, because I get shiny. And lip balm, either the Smith's Rosebud Salve or C.O. Bigelow's Mentha Lip Shine in Black Cherry Soda from Bath & Body Works. It's shiny with a little shimmer and tastes so good. IS: An In Style.com reader wants to know how you maintain a healthy body image in Hollywood. KH: I train with Harley Pasternak. I love him with my whole soul and follow his 5-Factor diet. I first said, \"I'm never going to be -- nor do I want to be -- an uber-athletic girl.\" It's just not me and I don't have that kind of discipline. He said, \"I just want you to be healthy.\" A lot of what we focus on is posture. I slump into myself when I get stressed. If I were going to play an action hero, I'd have to get that look. But I'd never maintain it. For me it's never about achieving a look that's impossible. E-mail to a friend . Get a FREE TRIAL issue of InStyle - CLICK HERE! Copyright © 2007 Time Inc. All rights reserved.", "(Mental Floss) -- 1. The SPAM® Museum . SPAM marks its 70th anniversary in 2007 which is also the Chinese Year of the Pig. If the on-site \"wall of SPAM\" is any indication, a tour through the SPAM Museum in Austin, Minnesota, is guaranteed fun for the whole canned-pork-loving family. SPAM's parent company, Hormel Foods, opened the establishment in 2001 to the tune of almost 5,000 cans of SPAM. One of the main attractions is a scale model of a SPAM plant, where visitors can don white coats and hairnets while pretending to produce America's favorite tinned meat. 2. National Museum of Funeral History . It's pretty hard to argue with the motto \"Any Day Above Ground is a Good One.\" So goes the backhanded optimism of the National Museum of Funeral History, a Houston facility that opened in 1992. Visitors are treated to exhibits that include a Civil War embalming display and a replica of a turn-of-the-century casket factory. In addition, the museum boasts an exhibit of \"fantasy coffins\" designed by Ghanaian artist Kane Quaye. These moribund masterpieces include a casket shaped like a chicken, a Mercedes-Benz, a shallot, and an outboard motor. According to Quaye, his creations are based on the dreams and last wishes of his clients, which -- let's be honest -- really makes you wonder about the guy buried in the shallot. 3. The Hobo Museum . If you're bumming around but looking for a good time, be sure to take a load off in Britt, Iowa, at The Hobo Museum, which details the history and culture of tramps. Bear in mind, though, that the museum kind of, well, slacks on hours and is only open to the public during the annual Hobo Convention. Luckily, tours can be arranged by appointment any time of year. Of course, if you're interested in the Hobo Convention, lodging is available all over the area, but it's a safe bet that most of your compatriots will be resting their floppy hats at the \"hobo jungle,\" located by the railroad tracks. Both the event and the museum are operated by the Hobo Foundation, which --incidentally -- also oversees the nearby Hobo Cemetery, where those who have \"caught the westbound\" are laid to rest. 4. The Mütter Museum . Originally, the College of Physicians of Philadelphia erected the Mütter Museum as a creative way to inform medical students and practicing physicians about some of the more unusual medical phenomena. (You know, babies with two heads, that sort of thing.) But today, it primarily serves as a popular spot for anyone interested in the grotesque. There, you'll find the world's largest colon, removed from a man who died -- not surprisingly -- of constipation. Also on display: an OB-GYN instrument collection, thousands of fluid-preserved anatomical and pathological specimens, and a large wall dedicated entirely to swallowed objects. 5. The Barnum Museum . What better way to honor \"Greatest Show on Earth\" founder P.T. Barnum than with a mediocre museum in Bridgeport, Connecticut? Some visitors will appreciate the museum's ridiculously detailed miniature model of a five-ring circus. But only circus freaks (and by that we mean \"enthusiasts\") will get a kick out of seeing a stale piece of cake from the wedding of Barnum's 40-inch-tall sidekick, General Tom Thumb. 6. The Conspiracy Museum . There's more than one theory about the assassination of John F. Kennedy, so why not have more than one museum devoted to it as well? Most JFK buffs are familiar with the Sixth Floor Museum housed in the former Texas School Book Depository, which recounts all those boring \"mainstream\" details of the late president's life leading up to his death at the hands of Lee Harvey Oswald. But just down the street, the Conspiracy Museum offers fodder for those less apt to buy into The Man's propaganda. For the most part, the museum specializes in showings of the Zapruder film and explanations of contrary assassination theories, including other gunmen on the grassy knoll and possible mafia involvement. 7. The Museum of Questionable Medical Devices . Take two trips to the Museum of Questionable Medical Devices and call us when you've lost all faith in the medical profession. Thanks to curator Bob McCoy (who recently donated the collection to the Science Museum of Minnesota), those in search of history's quack science can find what they're looking for in the St. Paul tourist attraction, whether it's a collection of 19th-century phrenology machines or some 1970s breast enlargers. If you make the trip, be sure to check out the 1930s McGregor Rejuvenator. This clever device required patrons to enclose their bodies, sans head, in a large tube where they were pounded with magnetic and radio waves in attempts to reverse the aging process. 8. Cook's Natural Science Museum . What began as a training facility for Cook's Pest Control exterminators blossomed into one of the few museums in the country willing to tell the tale of the pest. At Cook's Natural Science Museum in Decatur, Alabama, visitors can learn everything they ever wanted to know about rats, cockroaches, mice, spiders, and termites ... all for free. And while most people would rather step on the live specimens than learn about them, museum exhibits such as the crowd-pleasing Pest of the Month keep reeling in patrons. 9. Vent Haven Ventriloquist Museum . So, what do you get when you combine the loneliness of a pet cemetery with the creepy flair of vaudeville? The Vent Haven Ventriloquist Museum, of course -- where dummies go to die. The Fort Mitchell, Kentucky, museum was the brainchild of the late William Shakespeare Berger, who founded the site as a home for retired wooden puppets. In fact, he collected figures from some of the country's most famous ventriloquist acts. And with more than 700 dummies stacked from floor to ceiling, you're bound to feel like you're stuck inside a 1970s horror flick -- albeit a really good one. But sadly, when Berger gave the tour, you could totally tell his mouth was moving. 10. The Trash Museum . Mom wasn't kidding when she said one man's trash is another man's treasure. At the Trash Museum in Hartford, Connecticut, the Connecticut Resources Recovery Authority (CRRA) turns garbage into 6,500 square feet of pure recycling entertainment! T . our the Temple of Trash or visit the old-fashioned town dump. And for your recycler-in-training, head across the state to the Children's Garbage Museum, where you can take an educational stroll through the giant compost pile, get a glimpse of the 1-ton Trash-o-saurus, or enjoy the company of resident compost worms. E-mail to a friend . For more mental_floss articles, visit mentalfloss.com . Entire contents of this article copyright, Mental Floss LLC. All rights reserved.", "PARIS, France (CNN) -- Interpol on Monday took the unprecendented step of making a global appeal for help to identify a man from digitally reconstructed photos taken from the Internet that it said showed him sexually abusing underage boys. This moving image shows how police used software to unscramble the image. (Source: Interpol) The man's face was disguised by digital alteration, but the images were capable of being restored, according to a bulletin from Interpol -- the international police agency based in Lyon, France. Interpol Secretary General Ronald K. Noble said the pictures have been on the the Internet for several years, but investigators have been unable to determine the man's identity or nationality. \"We have tried all other means to identify and to bring him to justice, but we are now convinced that without the public's help this sexual predator could continue to rape and sexually abuse young children whose ages appear to range from six to early teens,\" Noble said. He said there is \"very good reason to believe that he travels the world in order to sexually abuse and exploit vulnerable children.\" Interpol has determined the photos were taken in Vietnam and Cambodia. \"The decision to make public this man's picture was not one which was taken lightly,\" said Kristin Kvigne, assistant director of Interpol's Trafficking in Human Beings Unit. The suspect's photo and more information can be seen online at Interpol's Web site. E-mail to a friend .", "Reuters is a global information company providing material tailored for professionals in the financial services, media and corporate markets. Its information is trusted and drives decision making across the globe. In October 1851 Paul Julius Reuter, a German-born immigrant, opened an office in the City of London which transmitted stock market quotations between London and Paris via the new Calais-Dover cable. 18 months earlier he had used pigeons to fly stock prices between Aachen and Brussels, a service which operated for a year until the gap in the telegraph link was closed. Reuters, as the agency soon became known, eventually extended its service to other European countries. It also expanded the content to include general and economic news from all around the world. In 1865 Reuters was first in Europe with news of President Lincoln's assassination in the United States. As overland telegraph and undersea cable facilities developed, the business expanded beyond Europe to include the Far East in 1872 and South America in 1874. In 1883 Reuters began to use a \"column printer\" to transmit messages electrically to London newspapers and in 1923 pioneered the use of radio to transmit news internationally. In 1927 it brought in the teleprinter to distribute news to London newspapers. Today Reuters has over 16,900 staff in over 94 countries across the globe, and is the world's largest international multimedia news agency, with 196 bureaux serving approximately 131 countries. In 2006 Reuters filed over two and a half million news items, including 656,500 alerts, from 209 countries around the world, published in 18 languages. Although Reuters is best known as the world's largest international multimedia news agency, more than 90% of its revenue derives from its financial services business. Some 370,000 financial market professionals working in the equities, fixed income, foreign exchange, money, commodities and energy markets around the world use Reuters products. The company supplies news -- text, graphics, video and pictures -- to media organizations across the globe. It also provides news to businesses outside the financial services sector, as well as direct to consumers. E-mail to a friend .", "(CNN) -- Six of the seven college students killed in a massive house fire Sunday morning in Ocean Isle Beach, North Carolina, attended the University of South Carolina, a university official said Sunday. \"This is a very sad day for the University of South Carolina family,\" Dennis A. Pruitt, the vice president for student affairs, told reporters. The seventh fatality is believed to be a Clemson University student, he said. The six survivors -- who were treated and released from Brunswick Community Hospital -- are also USC students, he said. Pruitt said the bodies were being sent to Chapel Hill, North Carolina, for identification.  Watch home video showing the house in flames » . \"It is difficult to ascertain exactly who was in the house and who was not,\" Pruitt said, explaining that several area houses were filled with college students visiting for the weekend. Newspaper deliveryman Tim Burns was aghast when he first saw the inferno early Sunday morning. He tried to approach the door but the flames were too intense, he told the Associated Press. \"When I was going up to the entryway, you could hear the windows above me explode,\" Burns said. \"When I knew the flames had taken over, I don't think I've ever felt as helpless in my life.\" The USC students were affiliated with the Delta Delta Delta sorority and the Sigma Alpha Epsilon fraternity, Pruitt said, although he stressed that the weekend was not an official Greek function. \"It just so happens, as on many university campuses, that certain sororities and certain fraternities hang around together,\" he said. One person described as \"unaccounted for\" was later confirmed dead, Ocean Isle Beach Mayor Debbie Smith told CNN. \"We suffered a terrible tragedy at Ocean Isle this morning,\" Smith said in a news conference. \"Nothing like this has ever happened at Ocean Isle Beach, and we hope it never will again.\" She said officials had not yet contacted all the victims' families, and that they were not yet releasing their names. The mayor said one of the 13 people in the house was related to the house's owner. Smith said the house was fully \"engulfed\" in flames around 7 a.m. when the fire department arrived on the scene, about five minutes after the fire department was notified. She said the house had working smoke detectors, AP reported. Officials are investigating the cause of the fire, Smith said. \"We ran down the street to get away,\" Nick Cain told the AP. The University of North Carolina student was staying at a house about 100 feet away. Some of his friends had met several people staying at the house that burned down. \"The ash and the smoke were coming down on us. We were just trying to get away,\" Cain told the AP. Ocean Isle Beach is a popular resort destination along the southern coast of North Carolina. The 7-mile-long island's year-round population is about 425, while the summer season population is about 25,000, according to the town's Web site.  E-mail to a friend .", "WASHINGTON (CNN) -- Attacks are down 75 percent in recent months in a perilous stretch of neighborhoods in northeastern Baghdad, prompting a U.S. military officer to proclaim Monday that security there is \"dramatically improving.\" Concerned citizens have helped troops improve security in parts of Baghdad, a military official says. People line the streets, cars congest them, trash collectors and other city workers have returned, local leaders are holding community meetings again and \"markets have come back like gangbusters,\" said Army Col. Don Farris, commander of 2nd Brigade Combat Team, 82nd Airborne Division. He added that the largely Sunni al Qaeda in Iraq presence has been \"crushed\" since the beginning of May. However, there are still dangers, most notably the threats posed by Iranian-backed Shiite militants, Farris said. Speaking to Pentagon reporters via video link from Baghdad, Farris cited several factors he said contributed to the improving security situation. Among them is the \"surge,\" the additional U.S. troops deployed earlier this year.  Watch how old rivalries have been posing problems » . Also helping improve the security situation are the cease-fire by radical Shiite cleric Muqtada al-Sadr's Mehdi Army and the development of a program that employs \"concerned local citizens\" to assist U.S. and Iraqi forces, Farris said. Some of those citizens are members of local Sunni \"awakening councils,\" comprised of former militants -- often armed -- who create neighborhood watch groups to root out the insurgent elements in an area. Especially in the last six weeks, Farris said, civic and religious leaders have seen outsiders operating in the area and troops have made arrests, two Iranian operatives among them . \"From my foxhole, in our sector, it is working,\" he said of the improving security in the area. \"I can only speak to what I see in my sector and I am encouraged.\" Farris' sector -- which includes the Sunni-dominated district of Adhamiya and Sadr City, the Shiite slum where militants have demonstrated a strong presence -- has seen a \"remarkable turnaround,\" he said. Many of the communities in his area have been wracked with sectarian warfare and terrorized by insurgents and death squads. Despite improvements in the security situation, Farris warned that \"we still have a lot of work to do\" because there doesn't appear to be any sign that Shiite extremists with links to Iran are halting their activities. Farris said troops also are still finding explosively formed penetrators, which are often delivered or manufactured by Iran. Nine such bombs were found in late October, he said. There are intelligence reports indicating weapons and money are still flowing into Sadr City, he said. There are also problems returning refugees and displaced people to their homes in the area, Farris said, because \"essential services\" like water and electricity are not yet up to snuff. Though a \"trickle\" of families has returned home and many are asking when they can return, Farris said he believes residents will return en masse only when basic services are in better shape. Paul Folmsbee, a State Department provincial reconstruction team leader, said at the same news conference that his personnel was handling development issues involving law, governance, economic development and essential services. Farris' Monday remarks echo a string of similar assertions made by U.S. and Iraqi military officials over recent weeks. The military officials say they are seeing signs of Sunni-Shiite reconciliation. At a press conference earlier Monday in Baghdad, Brig. Gen. Ed Cardon, deputy commander for support of Multi-National Division-Center, discussed a \"definite period of progress\" in his region on the southern Baghdad outskirts. E-mail to a friend .", "(CNN) -- Officials are searching for the driver of a white truck seen on Santiago Canyon Road on Sunday, near the time the Santiago fire started, Orange County authorities said Friday. Chief Chip Prather holds a photo of a white truck similar to the one seen on Santiago Canyon Road. \"These people are not suspects at this time,\" Orange County Fire Authority Chief Chip Prather said. \"They are persons of interest who were seen near the fire in a vehicle like this.\" The vehicle is a white, 1998 to 2004 Ford F150 pickup with chrome tubular running boards. Prather said the information came from a lead called into the investigation's tip line. A $250,000 reward has been offered for information leading to the arrest of the person or persons responsible for the blaze.  Watch how residents feel about arsonist » . The Santiago fire, now 27,000 acres and still burning, was deliberately set, officials said Thursday. Several mandatory evacuations remain in place for the Santiago fire, which has destroyed 14 homes and various other structures. Late Friday afternoon, the blaze moved into Silverado Canyon, authorities said. Sheriff's deputies were evacuating residents in the fire's path.  Watch the Santiago flames rage » . Authorities also suspect arson in the Rosa fire in San Diego County, which burned more than 400 acres before being fully contained. There was no information on the investigation. Elsewhere, the Los Angeles County District Attorney's Office filed arson charges Friday against a 41-year-old Sun Valley man who witnesses said set a fire in the West Hills neighborhood and walked away. Catalino Pineda is one of five people who have been arrested in arson investigations this week, but none of them has been linked to the major wildfires raging across Southern California. Pineda was arrested Wednesday after witnesses said they saw him lighting a fire on a hillside, police said. The fire was quickly extinguished. The witnesses followed Pineda to a nearby restaurant and called police, who arrested him. Pineda was expected to be arraigned in Van Nuys Superior Court Friday, Deputy District Attorney Steven Frankland said. He is charged with one count of arson of a structure or forest. Pineda is being held on $75,000 bail and faces up to six years in prison if convicted. In San Bernardino, east of Los Angeles, John Rund, of Hesperia, was arrested Wednesday on arson charges after a witness reported seeing him in brush near the starting point of a fire Tuesday, the sheriff's department said. That fire was quickly put out by passers-by. Investigators are trying to determine if Rund, 48, may have ties to other wildfires. He is being held on $750,000 bail. The San Bernardino County District Attorney's Office on Thursday filed arson charges against Anthony Riperti, 47, of Redlands. A statement from the office did not say when or where Riperti is accused of setting a fire. He is being held on $250,000 bail. In San Diego County, the sheriff's department this week arrested an adult and a juvenile allegedly seen by an anonymous tipster starting a fire in Vista in the northern part of the county. In a written statement, the sheriff's department identified the adult as Gorgonio Nava. The Vista fire Department extinguished the blaze before it grew out of control, the statement said. Investigators have determined that the Grass Valley fire in San Bernardino County was not caused by arson, and a preliminary investigation into the cause of the 11,675-acre Slide fire seems to indicate arson was not a factor, sheriff's spokeswoman Cindy Beaver said. More than 1,600 homes have been destroyed in the past week by Southern California wildfires. E-mail to a friend .", "(CNN) -- The partnership started as a single shop on Oxford Street in London, opened in 1864 by John Lewis. Today the partnership is an organization with bases throughout the UK, with supermarkets and department stores, employing approximately 67,100 people. All 67,100 permanent staff are Partners who own 26 John Lewis department stores, 183 Waitrose supermarkets, an online and catalogue business, John Lewis Direct a direct services company - Greenbee, three production units and a farm. Every Partner receives the same scale of bonus, based on a fixed percentage of their annual wage. The bonus for 2006 was 18% equivalent to 9 weeks pay, which was rolled out for every employee. Chairman Sir Stuart Hampson retired at the end of March 2007, his successor is Charlie Mayfield. Hampson's salary for January 26, 2006 to January 26, 2007 was $1.66 million which included the partnership bonus of $250,000. John Lewis' consolidated revenue for the last financial year was $11.4 billion.  E-mail to a friend ."]