["(CNN) -- The company was founded in 1985 by seven communications industry veterans -- Franklin Antonio, Adelia Coffman, Andrew Cohen, Klein Gilhousen, Irwin Jacobs, Andrew Viterbi and Harvey White. One of Qualcomm's first products was OmniTRACS, introduced in 1988, which is currently the largest satellite-based commercial mobile system for the transportation industry. Today, Qualcomm's patent portfolio includes approximately 6,100 United States patents and patent applications for CDMA and related technologies. More than 130 telecommunications equipment manufacturers worldwide have licensed QUALCOMM's essential CDMA patents. Qualcomm is among the members of the S&P 500 Index, Fortune 500, and a winner of the U.S. Department of Labor's\" Secretary of Labor's Opportunity Award.\" The company has been listed among Fortune's \"100 Best Companies to Work For in America\" for nine years in a row and the magazine's list of\" Most Admired Companies.\" Qualcomm's Annual revenue for 2006 was $7.53 billion, with a net income of $2.47 billion. E-mail to a friend .", "(CNN) -- A girl who was shown on a videotape being sexually assaulted in Las Vegas has been found and is safe, officials in Nye County, Nevada, said Friday. Chester Arthur Stiles, 37, is being sought as a suspect, police say. \"We have found the child, Madison. She's safe. The detectives say she is in good condition,\" Nye County Sheriff Tony De Meo said. The girl, now 7, was shown in a sex video made four years ago, Detective David Boruchowitz said at a news conference Friday night. She was found Friday with family in Las Vegas after thousands of tips poured in, thanks to an appeal by police to the news media to show the girl's picture. CNN and other news organizations did so until the child was found, when De Meo asked them to stop showing the picture. \"The mother has cooperated with us,\" De Meo said. \"We believe that the mother was not aware of anything that went on with this young girl,\" he said. \"It was very sad for her to find this out.\" A former Las Vegas animal trainer, Chester Arthur Stiles, 37, a resident of Pahrump, Nevada, has been identified as a suspect and is being sought in the case, De Meo said. Pahrump is about 60 miles west of Las Vegas.  Watch what's known about Stiles » . Stiles was a distant friend of the girl's family, De Meo said. Someone close to Stiles has told investigators that Stiles is a \"survivalist type\" and always carries a weapon, Nye County District Attorney Bob Beckett said. De Meo addressed Stiles directly: \"Turn yourself in to your local law enforcement agency,\" he said. \"Understand this: Law enforcement not only has a long arm, but a long memory. You will not be forgotten by members of this agency or any other law enforcement agency.\"   The FBI is also seeking Stiles on state charges of sexual assault and lewdness with a minor under the age of 14 in a separate matter, De Meo said. Police, who had called Stiles a person of interest, began calling him a suspect late Friday. There appeared to be physical similarities between Stiles and the man in the videotape, De Meo said. \"Nothing that I have seen in my career comes close to what this girl has gone through. Whoever this person is is a predator that, as far as I'm concerned, belongs in custody and, if successfully prosecuted, in jail for as long as the law allows,\"  De Meo said earlier.  Detectives said the child showed little emotion during the rapes, indicating she may have been brutalized before. Nevadan Darren Tuck recently gave police the videotape, saying he found it in the desert, De Meo said. Police said the tape was in his possession at least since May before he handed it over to authorities. He is being sought on a parole violation for failure to pay child support, but police -- who want to question him further -- have been unable to locate him. Tuck, who also allegedly showed the tape to others before giving it to police, faces a possible 10-years-to-life sentence for exhibiting pornography and another one to six years for possession of child pornography, De Meo said. Harry Kuehn, Tuck's attorney, said this week on CNN's \"Nancy Grace\" that Tuck was \"racked by indecision\" about what to do with the tape once he realized what it was. Asked why, Kuehn said, \"He's explained that to us, and at this point, we're not going to share that, because it goes to the defense of the matter.\" \"You have to consider what kind of concerns my client had; He's previously dealt with the sheriff's office in Nye County; it was previously unsatisfactory,\" the attorney said.  E-mail to a friend .", "(Mental Floss) -- They say a lot of artistic expression is motivated by self-loathing. But not for these folks! Long before the Material Girl ordered papa to stop preaching, these six puffed-up virtuosos knew darn well how to strike a pose. Alfred Hitchcock didn't leave people in suspense about how he felt about actors. Here's to the creative types who managed to raise egotism to an art form. Alfred Hitchcock . Hitchcock was, without question, one of the towering geniuses of cinema. And, like many greats, he wasn't exactly the best collaborator. Hitchcock was particularly trying for screenwriters, who felt he never properly credited them for their work. But he was notoriously hard on actors. He was once quoted as saying, \"Actors are cattle\" -- a quip that stirred up a huge outcry (actors can be so touchy). In response, he issued this correction: \"I have been misquoted. What I really said is, 'Actors should be treated as cattle.'\" Although it began accidentally (when he was short an actor for the film \"The Lodger\"), Hitchcock soon made it his egotistical trademark to appear in his own films, amassing a total of 37 cameos throughout his career. Ayn Rand . The egotist's egotist, author Ayn Rand (born Alissa Zinovievna Rosenbaum) is the patron saint of Thinking You're Better Than Everybody Else. Her most famous novels, The Fountainhead and Atlas Shrugged, are massive dramatizations of Objectivism, her self-spun Oscar-the-Grouch philosophy for success. Objectivism champions ego and accomplishment, shuns all religion as folly, and condemns any form of charity or altruism as counterproductive to society. Rand's novels often focus on protagonists (invariably men) who are shunned by others because of their genius, but then persevere over the foolishness of morons to prove said genius and emerge triumphant. Not surprisingly, she saw humility as a weakness and regarded laughing at yourself as \"spitting in your own face.\" So, just how much did Rand believe in her own philosophy? Let's just say a lot. With signature modesty, she ranked herself as the philosophical equal of Aristotle and Thomas Aquinas. Orson Welles . When you create a cinematic masterpiece such as \"Citizen Kane\" at the ripe old age of 25, you're bound to get a big head. But Welles was convinced of his own importance much earlier than that. In fact, \"Citizen Kane\" might have been sparked by nothing more than a bruised ego. After all, it's said he devised the film as a withering exposé of newspaper mogul William Randolph Hearst because Hearst slighted Welles at a dinner party. Of course, after the unparalleled success of \"Citizen Kane,\" Welles's arrogant side didn't get any less subtle. Do yourself a favor: Track down a recording of Welles' outtakes for a TV commercial for frozen peas. You'll hear everything you need to know about the filmmaker's oversized ego. A classic quote goes: \"In the depths of your ignorance, what is it you want?\" Frank Lloyd Wright . As the brains behind the Robie House, Fallingwater, Taliesin West, the Guggenheim, and countless other design benchmarks, Frank Lloyd Wright is arguably the genius of 20th-century architecture. And, boy, did he know it! Wright was notorious for believing he was superior to mere mortals. In fact, the architectural egomaniac frequently acted as though the rules -- even those of geography and climate -- did not apply to him. But when you're Wright, you're right. In 1935, department store magnate Stanley Marcus (of Neiman-Marcus fame) commissioned the architect to design his Dallas home, but the project quickly went sour. Wright's avant-garde floor plan included \"sleeping porches\" that required his client to sleep outdoors year-round. In addition, Marcus' small bedroom \"cubicles\" came equipped with almost no closet space. When Stanley respectfully explained that (a) temperatures during summer nights in Dallas often exceed 80 degrees and (b) a high-fashion tastemaker might need bigger closets, Wright threw a series of tantrums. Fortunately for the voyeur in us all, said tantrums usually took place in letter form. Preserved and occasionally displayed at the Dallas Museum of Art, they make for delicious reading. Salvador Dalí . \"Every morning when I awake, the greatest of joys is mine: that of being Salvador Dalí.\" Yup, he actually said that. Everything about the legendary Surrealist painter (he of the melting clocks) -- from his whacked-out paintings to his curled-up mustache -- was designed to shock, destroy convention, cause scandal, and stir controversy. Criticized for choosing to live under General Franco's fascist government in Spain, Dalí defended his position by stating that he didn't care about others so long as he could be king. Not exactly a man of the people. If he wasn't getting enough attention, he was known to walk the streets of New York City clanging a hand bell. Of course, this is also the guy who once said, \"The thought of not being recognized [is] unbearable.\" Need another telling quote? \"At the age of 6 years, I wanted to be a chef. At the age of 7, I wanted to be Napoleon. My ambitions have continued to grow at the same rate ever since.\" Apparently, so did his ego. Al Jolson . Plenty of performers this side of Gallagher have been labeled \"the world's greatest entertainer.\" But Al Jolson really, really believed it. The vaudeville singer, actor, dancer, and comedian was born Asa Yoelson in Seredzius, Lithuania, in what was then part of Imperial Russia. As a performer, he was known for hijacking the action in the middle of shows, ad-libbing, or just stopping to talk to the audience. During a 1911 performance of the critically hated \"Paris is a Paradise for Coons\" (title not edited for political correctness), Jolson stopped and asked the audience if they'd rather hear him sing than see the rest of the play. The crowd roared with applause, and Jolson ditched the whole program and took over. From that moment on, no one else could share the stage with him. Unlike some of the egomaniacs on this list, however, Jolson can be forgiven somewhat for his arrogance. According to most contemporary accounts, he actually was the greatest in the world. But, despite the enormity of his contributions to stage and screen, Jolson's legacy has become a political hot potato because of his use of stage blackface (considered highly offensive now, but pretty common at the time). E-mail to a friend . For more mental_floss articles, visit mentalfloss.com . Entire contents of this article copyright, Mental Floss LLC. All rights reserved.", "PARIS, France -- AC Milan's Brazilian midfielder Kaka has been named European player of the year, lifting France Football's Ballon d'Or award. Kaka has already claimed all of the game's major prizes. His success comes two years after his fellow countryman, Barcelona's Ronaldinho, claimed the award . The 25-year-old Kaka was a major factor in AC Milan's triumphant Champions League campaign. The runner-up was Manchester United's Portuguese winger Cristiano Ronaldo with Barcelona's Argentinian midfielder Lionel Messi finishing third. \"This is very special for me - it culminates an astonishing year for me,\" Kaka said. \"It's the top prize around and the only way to win something like this is to play for a team like AC Milan. It's great to be part of a team that wins.\" At 25 years old, he has already won all the game's major prizes, individually and collectively. He was part of Brazil's 2002 World Cup winning squad, although he was limited to just 19 minutes as a substitute against Costa Rica. He was top scorer in last season's Champions League, helping Milan to avenge their loss to Liverpool in the 2005 final. He won the Italian domestic title in his first season at Milan having joined from Brazilians Sao Paulo for$ 8.5 million, a sum that Milan president Silvio Berlusconi then described as peanuts. E-mail to a friend .", "(CNN) -- BUPA is an international health and care company with bases on three continents and more than eight million customers. BUPA began as The British United Provident Association in 1947 to preserve freedom of choice in health care. It believed that with a National Health Service being introduced a year later, there would still be a need for a complimentary service enabling people from all walks of life to afford the benefits of choice in where, when and by whom they were treated. Led by the growing public demand for health care and a lack of quality private accommodation BUPA initiated the Nuffield Homes Charitable Trust - later renamed Nuffield Hospitals. BUPA's biggest and original business is health insurance in the UK, both for individuals and corporations that want to look after the health of their employees. More than half of the UK's top companies are BUPA customers. The company's UK care homes offer specialist care to residents who include the elderly, the mentally ill, young people with physical or learning disabilities and people with conditions such as Parkinson's and Huntington's diseases. BUPA is a leading healthcare company in the UK, Spain, Australia, Ireland, Hong Kong, Thailand, Malta and Saudi Arabia. BUPA International supplies health cover to expatriates in over 180 countries. Sanitas, the BUPA business in Spain, has one million insured customers who have access to a network of 18,000 medical professionals and 450 medical centres. E-mail to a friend .", "(CNN) -- The owner of a North Carolina beach house where seven college students died in a weekend fire said Monday that his family's \"lives were just changed forever\" by the tragedy. Chip Auman said his 18-year-old daughter survived the fire but was hospitalized and in stable condition because of complications from smoke inhalation. \"The thought of losing a child is unimaginable to me, and as a father my heart goes out to the families that lost a loved one in this situation,\" he said. Auman said the situation was \"hard to fathom.\" \"There's just no words to describe what we've been going through,\" he said, asking for prayers for survivors and the families of those who died. \"We're numb, we're confused, we're heartbroken.\" Two college campuses mourned Monday. Six University of South Carolina students and a Clemson University student died in the fire early Sunday morning in Ocean Isle Beach, North Carolina. Six other South Carolina students were able to get out of the house in time. The six were treated and released from nearby Brunswick Community Hospital, but Auman's daughter was hospitalized again in Hartsville, South Carolina. Authorities from the state Bureau of Investigation and the federal Bureau of Alcohol, Tobacco, Firearms and Explosives are leading the investigation into the cause of the fire. Ocean Isle Beach Mayor Debbie Smith said the house was \"engulfed\" in flames when the fire department arrived on the scene, about five minutes after being notified. The flames shot into the sky and ultimately left little more than portions of the framing. Fire officials do not believe foul play was involved.  Watch a neighbor's video, fears of fast-burning fire » . Dennis A. Pruitt, the vice president for student affairs for the University of South Carolina, said investigators have said it would be Tuesday or Wednesday before the identities of the victims are confirmed publicly. It could be as much as a month until investigators know the cause of the fire, Pruitt said. The university did not cancel classes on Monday, but Pruitt said arrangements had been made for those who need to go home or stay out of class at the 28,000-student campus. Pruitt said meetings had been held Sunday with members of Delta Delta Delta sorority and Sigma Alpha Epsilon fraternity. The South Carolina students were affiliated with those houses, he said, although he stressed that the weekend was not an official Greek function. He also said counselors and ministers were available to help students deal with the loss of their classmates. The university president, Dr. Andrew Sorenson, contacted the families of those who died in the fire to express the condolences and support of the university community. Jay Laura, student president of the USC chapter of Sigma Alpha Epsilon, said the campus would pull together after the tragedy. \"If any place can come together to help in the healing process and the aftermath of an event like this, it is South Carolina,\" Laura said at a Monday afternoon press conference. Fire survivor Tripp Wylie, a 20-year-old South Carolina sophomore, said he jumped out of a third-story window into a canal to escape the flames and was unable to get back in to help his friends. \"I could see a buddy of mine off to the left who had gotten out. He was just yelling at me to jump and stuff,\" Wylie told CNN affiliate WYFF. \"The smoke was pouring out, couldn't really breathe, so I had to make a quick decision. [I] just kind of leaned out the window and luckily I jumped far enough to make it into the canal.\" Neighbors flocked to see the fire as firefighters battled and ultimately got the blaze under control.  See the scenes of devastation » . George Smith, who lives across the street from the house, said he heard sirens between 6:30 and 7 a.m. and went outside to see \"the whole sky lit up.\" \"The whole house was completely engulfed in flames, up to about 20 feet,\" he said. \"I have never seen [a fire] move so fast.\" George Smith said the house's occupants were \"partying in there yesterday and into the night.\" After about 10:30 p.m. Saturday they quieted down, he said. Linda Sing said she was walking her dog when she saw the fiery destruction. She noted that firefighters had saved an adjacent house by spraying it down with water. \"We knew there were people in there, but we hoped and prayed they'd gotten out,\" Sing said. \"This is the worst thing I've ever seen. We've had hurricanes, but this is worse.\" Ocean Isle Beach is a popular resort destination along North Carolina's southern coast. The year-round population of the 7-mile-long island is about 425, but it swells to about 25,000 during the summer season, according to the town's Web site. E-mail to a friend .", "LONDON, England (CNN) -- The head of Britain's intelligence services has warned that children as young as 15 are becoming involved in terrorist-related activity. Jonathan Evans, the chief of MI5, also said that at least 2,000 people in Britain pose a threat to the country's security because of their support for al Qaeda-inspired terrorism. \"As I speak, terrorists are methodically and intentionally targeting young people and children in this country. They are radicalising, indoctrinating and grooming young, vulnerable people to carry out acts of terrorism,\" he told a gathering of newspaper editors in Manchester. Evans said the figure of 2,000 -- an increase of 400 since November 2006 -- only included those the intelligence services knew about and that the actual number could be double. He said there had been 200 terrorist convictions in Britain since the September 11 attacks. The MI5 head added that over recent years much of the command and inspiration for attack planning in the UK had come from al Qaeda's remaining core leadership in the tribal areas of Pakistan. However, he said in the last 12 months terrorist plots on British soil were increasingly inspired by al Qaeda cadres in other countries, including in Iraq and East Africa. \"There is no doubt now that al Qaeda in Iraq aspires to promote terrorist attacks outside Iraq. There is no doubt that there is training activity and terrorist planning in East Africa -- particularly in Somalia -- which is focused on the UK,\" he told the Society of Editors meeting. According to Evans, there had been \"no decrease\" in the number of Russian covert intelligence officers operating in Britain since the end of the Cold War. He said that resources that could be devoted to counter-terrorism were instead being used to protect Britain against spying by Russia, China and others. \"A number of countries continue to devote considerable time and energy trying to steal our sensitive technology on civilian and military projects and trying to obtain political and economic intelligence at our expense,\" he said. E-mail to a friend .", "SAN DIEGO, California (CNN) -- You must know what's really driving the immigration debate. It's the culture, stupid. Ruben Navarrette Jr.: Some opponents of immigration, even the legal kind, fear changes in local culture. Immigration restrictionists -- and by that, I mean those who want to limit all immigration, even the legal kind -- like to pretend they're so high-minded. Yet they can't help themselves. They always take the low road and harken back to the nativism that greeted earlier waves of immigrants. The restrictionists insist that what bothers them are merely practical concerns: that our borders aren't secure, that so many immigrants are coming into the country illegally, and that the new arrivals are burdening schools and draining social services once they get here. Really? If that's the extent of it, then why does the conversation quickly turn to the impact -- both real and perceived -- that immigrants have on American culture through everything from taco trucks to Spanish-language billboards. That seems to be the issue in North Dakota, where, according to a recent article in USA Today, towns facing tough economic times are nonetheless resisting a cultural transfusion that could save them. In Cooperstown, the locals opposed efforts to bring in a hog plant and a dairy, because those kind of dirty and hard jobs are likely to attract ... guess who? American kids who work at Starbucks? Nope. The article quotes Orville Tranby, a local community leader in Cooperstown, who says that some residents have told him \"face to face\" that such facilities might attract Hispanic immigrants who could change the local culture. You'll find the same fear in Lewisburg, Tennessee. Not long ago, an employee at a local library came up with the radical idea of a bilingual story time where children could hear tales read to them in Spanish. Townspeople wanted no part of that. They demanded that all books purchased by the library, or even donated, be in English-only. These stories are ridiculous, but they're also helpful. They illustrate what some people are really concerned about with immigration, and it goes well beyond words like \"legal\" or \"illegal.\" It's the perception that the country is becoming more Hispanic, that Spanish is replacing English, that Hispanic immigrants are weakening American identity, and that Main Street is turning into Little Mexico. A leader of the vigilante Minuteman movement moronically called it the \"colonization\" of the United States. This sort of rhetoric is all about fear -- that those who thrive in the dominant culture are losing their primacy, that the mainstream is being polluted by foreigners, and that our children are going to live in a world where they're going to have to work a lot harder to keep up. It conjures up the alarm bells that Benjamin Franklin set off about German immigrants in the late 18th century, who he insisted could never adopt the culture of the English, but would \"swarm into our Settlements, and by herding together establish their Language and Manners to the Exclusion of ours.\" It popped up in the mid-19th century amid worries that Chinese immigrants were \"unassimilable,\" which led to Congress approving the explicitly-named Chinese Exclusion Act of 1882. And it helped welcome the 20th century when Massachusetts Sen. Henry Cabot Lodge warned that immigrants (read: the Irish) were diluting \"the quality of (U.S.) citizenship\" and others complained that Italian immigrants were uneducated, low skilled, apt to send all their money to their home country and prone to criminal activity. Where have we heard that before? And when will we hear it again? After all, Hispanics may be the latest group to find themselves in a culture war with nativists. But they won't be the last. Ruben Navarrette Jr. is a member of the editorial board of the San Diego Union-Tribune and a nationally syndicated columnist. You can read his column here. The opinions expressed in this commentary are solely those of the writer. E-mail to a friend .", "ROME, Italy -- Mauro Camoranesi scored with 13 minutes left to earn Juventus a 1-1 home draw with Serie A leaders Inter Milan on Sunday. Julio Cruz is mobbed by team-mates after giving Inter the lead in their 1-1 draw at Juventus. Camoranesi picked up a headed knock-down from substitute Vincenzo Iaquinta before seeing his shot deflect off defender  Walter Samuel to leave goalkeeper Julio Cesar helpless. Inter took a first-half lead when Argentine striker Julio Cruz broke Juve's offside trap and latched onto Brazilian midfielder Cesar's through ball before firing past Gianluigi Buffon. The result means Inter retain their unbeaten record this season, despite injury problems that saw the likes of Patrick Vieira, Francesco Toldo, Marco Materazzi and Dejan Stankovic ruled out. The defending champions are now two points clear of Fiorentina at the top of the table, with Roma a point further behind and Juventus in fourth place. Earlier in the day, Roma missed out on the chance to close the gap on Inter when a late collapse saw them throw away a two-goal lead to draw 2-2 at Empoli. First half goals from French winger Ludovic Giuly and Matteo Brighi had put the visiting Romans in charge and for more than an hour they looked set to cruise to victory. But with 23 minutes remaining Ighli Vannucchi reduced the deficit and Sebastian Giovinco snatched an injury time equaliser to deny Luciano Spaletti's injury-depleted team. Siena snatched a share of the spoils from Parma in a 2-2 draw as Daniele Galloppa scored in the last minute while Napoli needed an injury time goal from striker Ezequiel Lavezzi to deny rock-bottom Reggina their first win of the season, forcing them to settle for a 1-1 draw in the south. E-mail to a friend .", "(CNN)  -- One Australian soldier, three civilians and Taliban militants were killed early Friday during heavy fighting in southern Afghanistan, according to information from Australian and NATO officials. Four Australian troops have now died in the conflict in Afghanistan. The incident occurred in Tarin Kowt in Uruzgan province, where Taliban militants killed an Australian commando, the Australian Defence Ministry said. The 26-year-old commando -- Pvt. Luke Worsley of Sydney -- served with the Special Operations Task Group. This is the fourth Australian troop to die in the Afghan conflict. \"The action in which Private Worsley died only concluded in the last few hours and was characterized by heavy, close quarter fighting. The SOTG was conducting an operation to clear an identified Taliban bomb making facility in Uruzgan province, when the soldier was hit by small arms fire,\" Chief of the Defence Force Air Chief Marshal Angus Houston said. NATO's International Security Assistance Force said \"a significant number of Taliban insurgents were killed or captured as part of the operation. Taliban insurgents initiated the firefight which lasted several hours.\" Gen. Carlos Branco, ISAF spokesman, said it is not known how the civilians, two women and a child, died. \"However, we do know that the insurgents fired upon ISAF soldiers from the compound in which the Afghan civilians (two women and one child) were found after the fight. ISAF makes all effort to prevent losses of innocent civilian lives.\"  E-mail to a friend ."]