["HELSINKI, Finland (CNN) -- An 18-year-old authorities say shot eight people inside his high school in southern Finland, before turning the gun on himself, has died, police said. An image from a video posted on YouTube by \"Sturmgeist89.\" The shooting appeared to have been planned out in graphic videos posted on Internet file-sharing site YouTube. At a news conference this afternoon, police confirmed the dead numbered two girls, five boys and the school's headmistress at Jokela High in Tuusula, a quiet town around 50 kilometers (30 miles) north of Helsinki. Ten other people were taken to a hospital with minor injuries. The shooter, whom police identified as Pekka Eric Auvinen, died at Toolo Hospital, authorities said. Police said he took his own life. It was the first school shooting in Finland since 1989, when a 14-year-old student shot and killed two others in the coastal town of Rauma, the Finnish news agency STT reported. Police said Auvinen is from Tuusula and who acted alone. He had no previous criminal record and had never threatened anyone from the school before, they added. Auvinen published a manifesto online demanding war on the \"weak-minded masses\" and pledged to die for his cause.  Watch Auvinen fire weapons in video from his Web page » . YouTube appeared to have removed 89 videos linked to his account, many of them featuring Nazi imagery, shortly after the incident. Finnish media reported someone posted a message two weeks ago on the Web site, warning of a bloodbath at the school. A video posted earlier Wednesday, by \"Sturmgeist89,\" was titled \"Jokela High School Massacre - 11/7/2007.\" \"Sturmgeist89\" identified himself as Auvinen, and said he chose the name \"Sturmgeist\" because it means \"storm spirit\" in German. The video showed a picture of the school, which then disintegrated to reveal two images of Auvinen against a red background, pointing a gun at the screen. The clip is accompanied by the song \"Stray Bullet\" from rock band KMFDM. Eric Harris and Dylan Klebold, the students behind the 1999 Columbine High School massacre, also cited that group's lyrics. Another short video clip, called \"Just Testing My Gun,\" showed Auvinen loading and cocking a handgun. He fired and hit several pieces of fruit in a wooded area; the camera then showed a close-up of the destroyed fruit, and then a full-screen shot of him again. He waved at the camera and then walked out of view. The site indicated that the youth appeared to be fascinated with killing. As well as video footage of the Columbine school shootings, it also included clips of the 1993 Waco siege in the United States, the 1995 sarin gas attack in Tokyo, and bombs falling on Baghdad during the 2003 invasion. Many showed victims being wheeled away or people running for their lives. Throughout all of this, the single word \"DIE\" constantly flashed across the screen. Other video clips included Nazi-war-criminal footage. In the rambling text posted on the site, Auvinen said that he is \"a cynical existentialist, anti-human humanist, anti-social social-Darwinist, realistic idealist and god-like atheist. \"I am prepared to fight and die for my cause,\" he wrote. \"I, as a natural selector, will eliminate all who I see unfit, disgraces of human race and failures of natural selection.\" The police said at this afternoon's press conference that they had been fired at when they arrived at the school at 11.45 p.m. local time (9.45 a.m. GMT). They described the scene as chaotic, with some of the 460 students, ranging in age from 12 to 18, breaking windows in an attempt to escape. When the police's special SWAT unit entered the high school they found the gunman unconscious and in critical condition in the lower lobby of the building with a gunshot wound to his head. Police assume he tried to take his own life as no officers fired at him.  Several bodies were also found in the same location, where the shooting is believed to have begun, they added. They could not confirm comments by some students that Auvinen was firing through doors. Police also said that the gun Auvinen used, which was fully licensed, had been purchased less than a month ago on October 19. The legal age limit to own a gun in Finland is 18, which Auvinen passed in June of this year. He had a recommendation from a shooting club when he obtained the gun, police added, and practised sharp-shooting as a hobby at a shooting range. Finland, which enjoys a strong tradition of hunting, has a high proportion of gun ownership, with two million firearms owned in a nation of only five million. The Associated Press reported comments from Kim Kiuru, one of the school's teachers, on radio station YLE. Kiuru described how the headmistress used the public address system around noon to tell pupils to stay in classrooms. He said he locked his classroom door, then waited in the corridor for more news. \"After that I saw the gunman running with what appeared to be a small-caliber handgun in his hand through the doors towards me, after which I escaped to the corridor downstairs and ran in the opposite direction, \" Kiuru said. The agency reported Kiuru as saying that he saw a woman's body as he fled the school, before telling his pupils to leave the building through the windows.  E-mail to a friend . Copyright 2007 CNN. All rights reserved.This material may not be published, broadcast, rewritten, or redistributed. Associated Press contributed to this report.", "LONDON, England -- France coach Raymond Domenech has again omitted striker David Trezeguet from his squad for this month's friendly against Morocco and the Euro 2008 qualifier against the Ukraine. Happier times: David Trezeguet celebrates after scoring for Juventus against Torino. Trezeguet has scored scored 10 goals in 11 Serie A matches for Juventus this season -- including two hat-tricks -- but has failed to win his way back into the 24-man party. The 29-year-old, who last played for France in the 1-0 home defeat by Scotland in September, was furious after being dropped for the games against Lithuania and the Faroe Islands. He played no part as Domenech's team overtook the Scots at the top of Group B with comfortable victories last month. The coach said: \"David is having a great start to the season with Juventus, but he's in competition for a place. If we qualify, the Euro 2008 will be in eight months. A lot of things can happen in between. \"I hope David will help Juventus win the Italian league title and that he will be at the Euro 2008 with us, and that he will find his form again for France.\" Domenech has again included young Lyon forward Hatem Ben Arfa, who made his debut as a substitute against the Faroes and scored the final goal in a 6-0 victory. Ben Arfa is joined in the squad by club-mate Karim Benzema, while Bolton's Nicholas Anelka is also among the forwards named despite still recovering from an injury. Captain Patrick Vieira is ruled out due to injury, but the Inter Milan midfielder will join up with the squad anyway. \"A player of Patrick's dimension is going to be missed, but we just have to accept it and get on with it. Pat should be coming to see us because he's a leader, and he's the captain,\" Domenech added. France face the Moroccans on November 16 and then travel to the Ukraine on November 21. Domenech's team will qualify for the finals if Italy beat Scotland at Hampden on November 17. If the Glasgow game ends in a draw, France will need at least a point in Kiev to book their ticket. France squad: Goalkeepers: M Landreau (Paris St Germain), S Frey (Fiorentina), U Rame (Bordeaux). Defenders: E Abidal (Barcelona, P Evra (Manchester United), W Gallas (Arsenal), B Sagna (Arsenal), L Thuram (Barcelona), S Squillaci (Lyon), F Clerc (Lyon).  Midfielders: A Diarra (Bordeaux), L Diarra (Arsenal), M Flamini (Arsenal), C Makelele (Chelsea), J Rothen (PSG), J Toulalan (Lyon), S Nasri (Marseille). Strikers: N Anelka (Bolton), H Ben Arfa (Lyon), K Benzema (Lyon), S Govou (Lyon), T Henry (Barcelona), F Malouda (Chelsea), F Ribery (Bayern Munich). E-mail to a friend .", "(CNN) -- Polygamist sect leader Warren Jeffs tried to hang himself earlier this year while he was in jail awaiting trial, according to court documents unsealed by a Utah judge on Tuesday. Sect leader Warren Jeffs arrives in court to hear the verdict against him September 25 in St. George, Utah. Jeffs, the leader and so-called prophet of the 10,000-member Fundamentalist Church of Jesus Christ of Latter Day Saints, is now awaiting sentencing after being convicted on two counts of being an accomplice to rape. The documents, released by Fifth District Judge James Shumate at the request of the media, also indicate that Jeffs confessed to \"immorality\" with a \"sister\" and a daughter more than 30 years ago. Among the documents is a competency report on Jeffs completed in April, in which social worker Eric Nielsen wrote that throughout the month of January, Jeffs refused food and drink and developed ulcers on his knees from kneeling in prayer for hours. On January 28, the report said, he attempted to hang himself in his cell. In the days following the suicide attempt, while he was on suicide watch, Jeffs on separate occasions threw himself against the wall and banged his head on the wall. Jail transcripts show that Jeffs' suicide attempt came three days after a visit with his brother, Nephi, in which he said, \"I am not the prophet. I never was the prophet, and I have been deceived by the powers of evil ... I ask for everyone's forgiveness.\" Jeffs also told his brother: \"Farewell forever.\" The day before that, Jeffs told a follower in a phone conversation that he was \"covered with immorality with a sister and a daughter when I was younger.\" In the FLDS, members call adult women \"sister,\" and Jeffs' meaning was unclear. Jeffs' defense attorneys, who argued against the release of the documents, said in a motion opposing the unsealing of the statements that Jeffs recanted them the following month. Defense attorneys claim Jeffs' medical condition influenced his state of mind when the statements were made. They presented Shumate with a letter from another Jeffs attorney, arguing that the statements' release could influence an Arizona jury when Jeffs stands trial in that state. Jeffs, 51, was convicted in September of being an accomplice to rape. He was accused of using his religious influence over his followers to coerce a 14-year-old girl into marriage to her 19-year-old cousin. He faces a sentence of up to life in prison when he is sentenced November 20. The FLDS -- which is not affiliated with the mainstream Mormon church -- is based in the side-by-side border towns of Hildale, Utah, and Colorado City, Arizona. Jeffs, a former school headmaster, is the son of the sect's previous president and \"prophet,\" Rulon Jeffs, who died in 2002. Jeffs was on the FBI's 10 most wanted fugitives list when he was arrested in August 2006 outside Las Vegas, Nevada. Critics say that inside the FLDS, marriages are arranged for girls as young as 13, and competition for brides may be reduced by exiling male teens and young men. If male followers are excommunicated, critics claim, wives and children can be reassigned. During Jeffs' trial, defense attorneys claimed authorities were persecuting Jeffs because of his religious beliefs, including practicing polygamy as the way to heaven. If Jeffs disavowed being the prophet of the FLDS, it could cause upheaval within the secretive sect. However, two of his followers who spoke to CNN -- although FLDS members usually do not talk to reporters -- said they do not believe he made the statements. \"He is a perfectly priestly man,\" said a woman who identified herself as Cathy. \"He is a man of God, and we will always love him. Once a prophet, always a prophet.\" Her husband, Patrick, told CNN, \"It's hogwash. I don't believe it ... I will always consider him my prophet.\" E-mail to a friend . CNN's Gary Tuchman contributed to this report.", "SHANGHAI, China -- Championship leader Lewis Hamilton spun out of the Chinese Grand Prix to send the world title race to a cliffhanger finale in Brazil on October 21. A disconsolate Lewis Hamilton leaves his car after spinning into the gravel trap in Shanghai. Rookie Hamilton can still clinch the crown with third place in the closing race, but saw his 12-point lead cut to four by McLaren team-mate Fernando Alonso in Shanghai. The Spaniard finished second behind Ferrari's Kimi Raikkonen, who also kept his title hopes alive by moving within seven points of Hamilton. The young Briton started the race in pole position and at one stage led Raikkonen by more than eight seconds as he again showed superb skills in the wet conditions. However, the 22-year-old stayed out on the drying track too long in his wet tires, which deteriorated at an alarming rate to let Finland's Raikkonen take the lead. And when Hamilton -- who won in Japan last week to give himself the chance of clinching the title this weekend -- finally headed toward the pit lane, he spun out onto the gravel to end his chances with 25 laps to go. Raikkonen and Alonso both switched to dry tires on the 32nd of the 56 laps, with the Finn going on to win by by 9.8 seconds for his fifth victory this season -- one more than both Hamilton and Alonso. Raikkone's team-mate Felipe Massa was third, while fourth place was claimed by Toro Rosso's Sebastien Vettel, who was last week reprimanded for causing an accident in Japan behind the safety car while Hamilton was cleared of any wrongdoing. Britain's Jenson Button was fifth in a Honda ahead of Vettel's team-mate Vitantonio Liuzzi, while Germany's Nick Heidfeld was seventh for BMW Sauber and David Coulthard of Scotland took the final point for Red Bull. Hamilton was still confident he could bounce back after suffering his first retirement of the season. \"I'm sorry for the team but I can still do it, don't worry,\" he said. \"When I got out of the car I was just gutted because it was my first mistake all year, and to do it on the way into the pits was not something I usually do. \"You cannot go through life without making mistakes. But I am over it and we look forward to Brazil. The team will be working hard to make sure the car is quick enough there, and we still have points in the bag. \"We were having a great race and we didn't know if it was going to rain or not. The tyres were getting worse and worse and you could almost see the canvas underneath. When I came into the pits it was like ice, I couldn't do anything about it.\" McLaren boss Ron Dennis refused to blame his driver or his team for the spin-off. \"It's too extreme to say anyone made a mistake in this. It has been a very competitive season between our drivers and it will go on for another Grand Prix,\" Dennis said. \"I don't think we did anything dramatically wrong and neither did Lewis. But the circuit was considerably drier than the pit lane entrance. That's what made the difference. \"It was easy to say that we could have stopped earlier, but would it have made a difference? All the top teams -- Ferrari and ourselves -- were trying to get through the rain and straight onto a dry tire.\" Alonso, who qualified for the race in fourth, is seeking to become the third driver to win three world titles. \"The result was good today and the eight points are a help for sure,\" he said. \"I think the championship will still be very difficult because I know it will not be easy to take four points from Lewis. \"I need something dramatic if I want to win. With a normal race it will be impossible.\" Raikkonen added: \"We are back in the championship and it will be interesting in the final race. \"Hopefully the car is good and it will be a battle all weekend. It is not just up to us though, we saw today that anything can happen, but we are back in the championship.\"  E-mail to a friend .", "(CNN) -- As part of an effort to share the best practices of modern business among organizations across the globe, CNN is talking to some of the world's top executives. In line with this, CNN will be hosting three events looking at modern strategies in today's business arena. The first of these master classes will be based at the China Europe International Business School in Shanghai and will be aired November 10 and 11. One of the guests at the event will be Howard Schultz, chairman of the international coffee shop chain Starbucks. He will be part of a live discussion at the master class and will take questions that you, the CNN audience, put to him. As the head of a coffee empire that now boasts over 12,000 stores and recorded revenues in 2006 of $7.8 billion, Schultz is well equipped to tackle questions on the best ways to succeed in today's business world. The CNN Boardroom Master classes will take place in the homes of the world's largest stock markets -- Shanghai, New York and London. It airs on November10 at 2115 and November 11 at 0115 & 1615 HKT.  E-mail to a friend .", "(CNN) -- This week MME speaks to the man charged with boosting growth in the Kingdom of Bahrain: Sheikh Mohammed bin Isa Al Khalifa. Sheikh Mohammed is concerned the nuclear dispute with Iran  is deterring potential investors . As chief executive of the Economic Development Board, one of Sheikh Mohammed's main tasks is to ensure Bahrain stays ahead of its competitors. The government's pushing ahead with economic reforms to reduce the Kingdom's dependence on oil. But with crude prices near $100 a barrel, John Defterios asked whether the appetite for change had diminished. SM: The reforms are being done for aspirational reasons rather than necessity, so we are trying to enter the post-oil area because we want to. And therefore, because of this aspirational aspect, trying to get to as opposed to people pushing us somewhere we don't want to go. JD: How do you redefine Bahrain's role? Traditionally it's been a financial center, but you have Qatar, Saudi Arabia, Dubai even Abu Dhabi emerging in financial services. How you redefine it to sustain a lead? SM: The rising tide lifts a lot of places and as the region is booming and growing, financial services are growing throughout the region. Bahrain's strengths have been and will continue to be its human capital, the people that have led the financial sector and the long standing regulations that have been established in Bahrain. JD: Strategically and a geopolitical question here: the Crown Prince came out and declared what Iran's intentions really are -- in his view -- for a nuclear policy, and called for greater diplomacy right ahead of a visit by the President of Iran to the country. What's the motivation here? SM: We feel that the distraction caused by the Iranian nuclear issue is holding investment back in the region as a whole, and increasing the security threat of the region. Nobody is debating the right to peaceful nuclear power, but we all have that need and we all need a peaceful resolution to this. JD: Historically, Iran has even made claims against Bahrain, what do you do now moving forward now? Do you bring Russia, China, the United States and the European Union closer together, in terms of where we should be going in the future? SM: We've resolved our historical issue with Iran, and we are well beyond that, but going forward... This is such a important issue affecting security worldwide, that we feel it is important and at a level high enough that we need all powers involved because it does affect everybody. JD: Can the GCC (Gulf Cooperation Council) become much tighter as an organization to have a voice in that process; as opposed to speaking from the sidelines and hoping that the major powers move forward? SM: Absolutely, I mean, the GCC is speaking with a unified voice. The Kingdom of Saudi Arabia came out with a proposal for providing nuclear fuel from an independent authority; this was completely backed from the GCC. We are all moving forward and are willing to play a beneficial role to resolve this issue. Meet the Sheikh: . Sheikh Mohammed bin Isa Al Khalifa is chief executive of the Economic Development Board, the organization responsible for stimulating and supporting growth of the Bahraini economy. He was appointed in June 2005, following 10 years working directly for His Highness Sheikh Salman bin Hamad Al Khalifa, Crown Prince, Commander-in-Chief of the Bahrain Defense Force and Chairman of the Economic Development Board. From 1995 to 1999, he was director of the Crown Prince's office. In 1999, he was appointed head of the court and also deputy head of the Crown Prince's International Scholarship Program. During this time, Sheikh Mohammed was heavily involved with the Crown Prince's initiatives to liberalize the telecommunications sector and with labor market and economic reforms. A keen motor sports enthusiast, Sheikh Mohammed was deputy board chairman of the Bahrain International Circuit and is a former vice president of the Bahrain Motor Club, now known as the Bahrain Motor Federation. Sheikh Mohammed, who is married with two sons and one daughter, was born on April 14, 1969. In 1992, he received a bachelor's degree in economic theory from the American University, Washington DC. Two years later, he received a post-graduate diploma in business studies from the London School of Economics. (source: Bahrain Economic Development Board) E-mail to a friend .", "ALGIERS, Algeria (CNN) -- Rescuers are sifting through the rubble of the United Nations headquarters in Algiers hoping to find survivors after a powerful bomb ripped off the building's facade and leveled nearby U.N. offices. Rescuers and bomb experts search for survivors in the rubble of a destroyed building. It was one of two suspected car bombs that struck Algiers within 10 minutes of each other. The death toll is unclear: the official government count is at least 26, but hospital sources in Algiers told CNN affiliate BFM-TV that 76 people were killed in the two blasts. A statement from the United Nations said 45 people were reported killed. Algerian Interior Minister Noureddine Yazid Zerhouni blamed a militant Islamic group with ties to al Qaeda for the attacks, which also targeted a building housing Algeria's Constitutional Council and Supreme Court. In a posting on an Islamist Web site, the group al Qaeda Islamic Maghreb claimed responsibility. CNN could not immediately corroborate that claim, but the Web site is known to carry messages, claims and videos from al Qaeda and other militant groups. In the posting, the bombers were identified as Sheikh Ibrahim Abu Othman and Abdel Rahman Abu Abdel Nasser al-Asimi. It said two trucks were filled with \"no less than 800 kg (1,763 pounds) of explosives.\" The group called the operation \"another successful conquest and a second epic that the knights of faith have dictated with their blood, defending the wounded Islamic nation and in defiance to the Crusaders and their agents, the slaves of America and the sons of France.\" At least 10 U.N. staffers were among those killed, according to U.N. spokeswoman Marie Okabe. The offices of the UN High Commissioner for Refugees -- located across the street from the U.N. headquarters -- were leveled by a blast that struck about 9:30 a.m. (3:30 a.m. ET) Tuesday. \"Our offices are basically destroyed now, nothing works,\" UNHCR spokesman Ron Redmond said from its Geneva headquarters. Watch his full interview . He said rescuers are working into the night trying to get to the trapped U.N. workers. \"It's a very serious situation still with the U.N. in Algiers,\" he said. In a strongly worded statement, U.N. Secretary-General Ban Ki-moon condemned what he called \"an abjectly cowardly strike against civilian officials serving humanity's highest ideals under the U.N. banner.\" \"The perpetrators of these crimes will not escape the strongest possible condemnation -- and ultimate punishment -- by Algerian authorities and the international community,\" Ban said in the written statement. He said he has sent senior advisers and other top U.N. officials to head to Algiers to assist in the investigation and rescue effort. Most of those killed in the coordinated attacks were victims of the first suspected car bombing near the Constitutional Council -- which oversees elections -- and Supreme Court in the Algiers neighborhood of Ben Aknoun, according to the state-run Algeria Press Agency. That blast struck a bus outside the targeted building, killing many of those on board, the news agency reported. One man said he heard the first blast then the second exploded in front of him. \"I saw the trees falling and the glass shattering in front of me. I had to run away from the car,\" he said. Zerhouni said the attack was the work of the Salafist Group for Preaching and Combat (GSPC), the same group that took responsibility for an attack in April in downtown Algiers that killed 33 people. That group also uses the name al Qaeda Islamic Maghreb after merging with al Qaeda earlier this year. It abandoned small-scale attacks in favor of headline-grabbing blasts after it joined with al Qaeda. CNN International Security Correspondent Paula Newton said the merger combined the expertise of Algerian guerrillas with the operational ability of al Qaeda in North Africa, enabling the group to penetrate the usually extensive security in high-profile areas of Algiers. She said the group's goal is to destabilize countries like Algeria, Morocco and Tunisia, which it sees as enemies of the Islamic state. Zerhouni said police interrogations of GSPC members arrested in the wake of the April attack revealed that Algeria's Constitutional Council and Supreme Court were on a list of GSPC targets. Algeria, which has a population of 33 million, is still recovering from more than a decade of violence that began after the military government called a halt to elections which an Islamist party was poised to win. Tens of thousands of people died in the unrest. Although the country has remained relatively peaceful, recent terrorist attacks have raised fears of a slide back to violence. E-mail to a friend .", "MADRID, Spain -- Lionel Messi scored for the sixth game in a row as Barcelona defeated big-spending Atletico Madrid 3-0 to stay in touch with Primera Liga leaders Real Madrid. Messi (left) is congratulated by Ronaldinho after scoring again in Barcelona's 3-0 win over Atletico Madrid. Barcelona had thumped Atletico 6-0 on their own ground last season and the visitors were out for revenge -- but conceded twice in four minutes. After 15 minutes, Italian goalkeeper Christian Abbiati let a routine Messi cross slip out of his hands and Deco rolled home into the empty net. Four minutes later Messi played a great one-two with Ronaldinho and rifled a shot past Abbiati for his sixth goal of the season and Xavi added a third late on. \"It was a deserved victory against a rival that we have had problems with in the past,\" explained Barca coach Frank Rijkaard. \"We scored twice in quick succession and then we controlled the match using aggression and with the team attacking and defending as a unit.\" \"Conceding two early goals inside four minutes is not easy to turn around especially against Barcelona,\" admitted Atletico coach Javier Aguirre. It was Barcelona's fourth straight league win but they still trail Real Madrid by two points after the champions beat Recreativo Huleva 2-0. Dutch international Ruud van Nistelrooy, the league's top-scorer last season, scored on 72 minutes before Gonzalo Higuain netted in the final minute to keep Real at the summit. Luck deserted them when Wesley Sneijder hit the post but Van Nistelrooy scored in the final quarter hour before Higuain struck to keep them two points clear at the top. Real have made their best start since 1991 but coach Bernd Schuster's rotation policy has been questioned with the German chopping and changing his team. \"It was an important victory because it is the final match before we go away on international duty,\" said Dutch winger Arjen Robben. \"We are now top for the next two weeks and can build on that when we return.\" Villarreal, now four points behind Real, lost for only the second time in 15 matches with a 3-2 reverse against Osasuna. Sevilla, third last season, are in a crisis after losing their fourth league game in a row with a goal from Riki handing Deportivo La Coruna a surprise 1-0 win. Sevilla have just six points from their first six matches and are 13 points behind Real. Levante's Abel Resino became the first Spanish league coach to be sacked this season, after their 3-0 home loss to Real Zaragoza. . The 47-year-old Resino, a former goalkeeper at Atletico Madrid, joined Levante in January as a replacement for Juan Ramon Lopez Caro. The Valencia-based club are bottom of the table with only a point from seven matches. E-mail to a friend .", "LONDON, England (CNN) -- There are some circuits that are cornerstones of the Formula 1 calendar: the Monacos and Silverstones whose every twist and turn are known intimately by the drivers and engineers. Then there are the newer circuits -- Malaysia and Bahrain, for instance -- but even these have become familiar to the drivers and their backroom boffins. Fuji Speedway employees pose behind a scale model of the new circuit and in front of an overhead view. Next week they have something completely new to contend with: a track that has yet to see a single F1 team put in a single lap. The Japan Grand Prix is to return to the Fuji Speedway, a circuit that hasn't seen an F1 race since 1977 (though now with a substantially different track layout). The Fuji circuit will be familiar to fans of classic arcade games. The old Fuji Speedway was the setting for the 1982 arcade game Pole Position (released by Namco in Japan and Atari in the rest of the world). The most notable aspect of the circuit is the vision of Mount Fuji, Japan's tallest mountain, looming in the distance. Though the move to this picturesque location is not without its controversies. The Suzuka track -- which had held Japanese Grands Prix between 1987 and 2006 -- had been popular with drivers and fans alike, but for this year and the next the Japanese Grand Prix will be held at Fuji. However an announcement by Formula One Management (FOM) this month revealed that Suzuka will return to the calendar for 2009 -- on the condition that the circuit makes some approved modifications -- with the location of the Japanese Grand Prix alternating yearly between Fuji and Suzuka after that. Behind the scenes is a political battleground -- both circuits are owned by car manufacturers with F1 connections -- Honda owns Suzuka, Toyota owns Fuji. Toyota is a relative newcomer to F1 but, having this year surpassed General Motors as the world's number one automobile manufacturer, and reputedly having the best funded team in the paddock (a position that hasn't been reflected in sporting success), it is not without clout. The redesign of the Fuji track was carried out by Hermann Tilke in 2003. Tilke, a German architect redesigned a number of F1 circuits in the 1990s and has since designed many new grand prix tracks including Malaysia, Istanbul, Bahrain and Shanghai, and the tracks for 2008's debut grands prix in Singapore and Valencia. So how do F1 teams prepare for a new circuit such as Fuji without data from previous races to fall back on? The answer lies with computer simulation. Computer-aided design (CAD) is as much a part of the design of a circuit these days as it is a part of the design of the high-tech cars. Every bend, every straight and every camber is fastidiously analyzed on screen before an ounce of dirt is shifted on the ground itself. Despite never having raced on the circuit, the teams have been testing their cars on a virtual Fuji Speedway for some time. BMW Sauber's simulation experts received CAD data from the Japanese race organizers late last year. And when their cars arrive at Fuji for testing next week, their race set-up should be close to optimum. The circuit was analyzed and broken up into between 500 and 800 segments. The radius of each individual segment was measured, allowing the engineers to exactly calculate the optimum racing line (the route around the circuit that covers the shortest possible distance). Then the effects of factors such as gradients and inclines were calculated. The slightest change in angle of a gradient can have significant effects on the downforce and aerodynamic profile of a car. \"In order to avoid losing precious time during the race weekend, we need to have as accurate as possible a picture of downforce levels, gearbox ratios and brake specification in advance,\" says Willy Rampf, Technical Director of the BMW Sauber F1 Team. Dieter Glass, Chief Race and Test Engineer with Toyota F1 explains: . \"You start to determine what downforce level gives the best lap time on the new circuit. Once you know that, you look into which gear ratios suit the track with the given level of downforce, before you get into more detailed simulations of different set-up solutions. \"Getting a bit closer to the weekend, you start running race simulations in order to predict the optimum race strategy. This prediction takes into account estimates of relevant characteristics of the new track, like the degradation of the two Bridgestone tire compounds and the effect the fuel has on lap time. If you have more fuel in the car, this affects your lap time, but we can accurately predict how much time is lost with every extra kilogram of fuel carried.\" One peculiarity of the Fuji circuit is the exceptionally long main straight, which at 1.475 km (0.916 miles) will allow for higher-than average-straight line speeds but, after the straight the track is relatively twisty. The teams have to find a balance between getting the most speed into the straight, and the best grip decelerating into the bends. \"You have some very slow corners which require good mechanical grip,\" says Glass, \"and as always you want good grip in general, but you have to balance that with the long straight, where you need low enough downforce to get a level of drag which allows you to have a good top speed.\" The testing may be virtual, but the teams hope that these virtual figures are a hair's breadth away from real world eventualities: . \"Our aim is to ensure that the lap times and top speed calculated using the simulation software do not vary by more than one percent from the actual values,\" says Rampf. Not that everything can be predicted: \"I think we are quite accurate but the ultimate response to that is very difficult to say for sure because it very much depends on what happens in the race,\" continues Glass. \"Many incidents can happen, which then have a positive or an adverse affect on strategy.\" E-mail to a friend .", "NYON, Switzerland -- Celtic have been fined $50,800 by UEFA and AC Milan's Dida has been banned for two matches after the incident which saw a pitch-invading supporter approach the Brazilian goalkeeper in last week's Champions League match at Celtic Park. Dida's theatrical over-reaction has resulted in UEFA suspending him for two matches. The incident occurred when the Scottish side beat Milan 2-1 in Glasgow. A fan ran onto the field in the 90th minute, soon after the home side scored their winning goal, and made what appeared to be minimal contact with Dida. The Milan goalkeeper turned to chase the supporter before dropping to the ground. He was carried off the field on a stretcher and replaced. Dida's theatrical over-reaction has cost him severely -- but Celtic may choose not to complain about their own punishment, with half of their fine suspended for two years. UEFA did have the power to change the result of the match, although that was always unlikely. UEFA's control and disciplinary body found Celtic guilty of charges of \"lack of organisation and improper conduct of supporters\", while Dida was found to have breached UEFA's \"principles of loyalty, integrity and sportsmanship\". Milan have pledged to appeal against the punishment, which as it stands means he will miss the club's Champions League games against Shakhtar Donetsk. \"It's a suspension that is absolutely excessive,\" said Milan lawyer Leandro Cantamessa. \"It seems to us a very, very unbalanced sentence. It turns Dida into the protagonist of the incident, whereas the protagonist was someone else, and that's not right from a logical point of view.\" Celtic acted swiftly to punish the 27-year-old supporter, who turned himself in and has since admitted a breach of the peace in court and will be sentenced next month. The club banned the fan for life from all their matches, home and away. Celtic chief executive Peter Lawwell said: \"As a club we feel this penalty is proportionate to the incident in question and a fair outcome.\" E-mail to a friend ."]