["WASHINGTON (CNN) -- The White House is blasting Congressional Democrats for not sending a bill that would fund veterans' care programs to the president's desk by Veterans Day. The White House's Dana Perino accused Democrats of holding veterans care funding hostage. \"There's absolutely no reason that the veterans' bill could not have been signed by the president today, except for the political games that the Democrats decided to play with it,\" White House press secretary Dana Perino said Sunday in Crawford, Texas. Congressional Democrats had attached legislation funding veterans programs to a $150.7 billion bill that also funded a number of domestic priorities, including health, labor and education. Democrats also added $3.7 billion to what the president budgeted for veterans programs. The labor-health-education bill would increase funding by more than $10 billion over last year's funding for those programs. The president has threatened to veto the bill because of the added spending. The House passed a health-labor-education bill 269-142 last week with the veterans funding attached, but the Senate later voted to strip out the veterans funding and send the health-labor-education bill to the president. Perino accused the Democrats of \"trying to hold hostage our veterans to extra domestic spending or increases in taxes.\" \"The president wants clean legislation, a clean bill to fund the veterans,\" Perino said. On Saturday, the Democratic congressional leadership sent a letter to President Bush saying they welcomed a dialogue on spending, sayings disagreements over funding levels \"have never been so great that we cannot reach agreement on a spending plan that meets the needs of the American people.\" \"Key to this dialogue, however, is some willingness on your part to actually find common ground,\" House Speaker Nancy Pelosi, D-California, and Senate Majority Leader Harry Reid, D-Nevada, said in the letter. The leadership said last year's Congress, which was still under Republican control, had never passed a separate bill funding veterans programs. Congress also sent to the president legislation that would fund veterans care at the levels requested by the president through December 14, the leadership said. The current funding level \"is still below the $3.9 billion extra that we passed,\" said Nadeam Elshami, spokesman Pelosi. \"We are committed to getting the extra funding that the Congress already voted on the president's desk for his signature.\" The leadership blamed Republican members of Congress for stalling the funding for the veterans programs by blocking its inclusion in the larger spending bill. Perino, though, said the Democrats could still send a separate bill to the president funding the veterans program that passed both chambers of Congress. \"The Democrats decided not to send the president this bill,\" Perino said. \"That has to be laid at their feet.\" E-mail to a friend . CNN's Deirdre Walsh contributed to this report.", "(CNN) -- Muddy but unhurt, three University of Texas students emerged from a cramped cave complex in Austin, Texas, after a day-long search Sunday. A rescuer at the entrance to Airman's Cave in Austin, Texas, Sunday. Lt. Matt Cox, an Austin Fire Department spokesman, said the students -- two women and one man -- were reported missing early Sunday after a trip into Airman's Cave, about four miles south of the university's campus. They were found about halfway down the 12,000-foot-long cave, which has few spaces big enough for an adult to stand upright and is explored primarily by experienced spelunkers. The students were located shortly before 5 p.m. (6 p.m. ET), about 30 hours after they entered. Their names were not released Sunday night. A friend called 911 to report them missing at 5 a.m. The group had told friends to call 911 if they were not back by midnight Sunday, according to Austin-Travis County Emergency Medical Services. Earlier reports that four students were in the cave were incorrect, Cox said. Authorities did not know Sunday evening why the students were in the cave for so long. But Cox said it would have been easy even for experienced cavers to get lost in Airman's, which he compared to the roots of a tree. \"There are so many ways to go,\" he said. E-mail to a friend .", "WASHINGTON (CNN) -- U.S. first lady Laura Bush -- in a rare foray into foreign policy -- called on Myanmar's military junta to \"step aside,\" give up the \"terror campaigns\" against its people and allow for a democratic Myanmar in a commentary published in Wednesday's Wall Street Journal. U.S. first lady Laura Bush said the junta \"should step aside to make way for a unified Burma.\" \"Gen. Than Shwe and his deputies are a friendless regime,\" Bush said. \"They should step aside to make way for a unified Burma [Myanmar] governed by legitimate leaders. \"The rest of the armed forces should not fear this transition -- there is room for a professional military in a democratic Burma,\" Bush said, in keeping with the U.S. policy of still using Myanmar's former name. In Wednesday's commentary, Bush called on Myanmar's military leaders to release Aun Sung Suu Kyi and other opposition leaders so they can meet with and plan for a transition to democracy. \"Meanwhile, the world watches -- and waits,\" Bush warns. \"We know that Gen. Than Shwe and his deputies have the advantage of violent force. But Ms. Suu Kyi and other opposition leaders have moral legitimacy, the support of the Burmese people and the support of the world. \"The regime's position grows weaker by the day. The generals' choice is clear: The time for a free Burma is now.\" The humanitarian rights situation in Myanmar has been a cause for the first lady in the past few months as the crisis there worsened. Myanmar state media has reported that 2,000 people were detained during the demonstrations and the crackdown against them -- under an emergency law imposed on September 25 banning assembly of more than five people -- and that 700 of those people have been released. The official death toll from Myanmar's leadership is at 10, but there are reports that hundreds were killed and thousands arrested in the wake of the demonstrations that peaked late September, which were led by Myanmar's Buddhist monks. On Tuesday morning, Bush received a phone call from U.N. Secretary-General Ban Ki-moon to update her on the efforts of his special envoy to Myanmar, Ibrahim Gambari. A representative of the secretary general said the call was a follow-up to a conversation they had weeks ago. Gambari met last week with the military junta leadership as well as with Nobel Peace Prize winner Suu Kyi, who is under house arrest in Yangon. The U.S. ambassador to the United Nations, Zalmay Khalilzad, told reporters that Laura Bush and her husband's administration believe that there is a \"need to start preparing for transition\" for Myanmar. \"We believe it is very important that progress be made and prisoners be released and conditions for Aun Sung Suu Kyi be improved [so] that she can prepare for participation for negotiations for a transition,\" he said. E-mail to a friend .", "NEW ALBANY, Indiana (CNN) -- President Bush vetoed a $600 billion spending bill Tuesday, accusing Democratic leaders of wasting money and plotting tax increases, then took his budget fight with Congress on the road. Congress should cut spending \"and send me a responsible measure that I can sign into law,\" President Bush said. \"The majority was elected on a pledge of fiscal responsibility, but so far, it's acting like a teenager with a new credit card,\" he said in a speech in New Albany, Indiana. The bill -- which Bush said was laden with $10 billion in \"pork\" -- would have funded the departments of Labor, Education, and Health and Human Services. It also would have funded projects such as a prison museum, a sailing school and a program to teach Portuguese. \"Congress needs to cut out that pork, reduce the spending and send me a responsible measure that I can sign into law,\" the president said.  Watch a report on the veto » . While polls show Bush's popularity remains at near-record lows, Congress ranks even lower as a whole. The president has taken numerous opportunities to mock the spending habits of the Democratic leadership and force confrontations over the appropriations bills needed to fund the government for the 2008 budget year, which began October 1. The bill Bush vetoed Tuesday includes about $150 billion to run those departments and more than $450 billion in mandatory spending on Medicare and Medicaid, the federal health care programs for the elderly and poor, according to the House Appropriations Committee. The committee's chairman, Rep. David Obey, called Bush's veto \"not responsible and not credible.\" \"This is a bipartisan bill supported by over 50 Republicans,\" Obey, D-Wisconsin, said in a statement issued after the veto. \"There has been virtually no criticism of its contents. It is clear the only reason the president vetoed this bill is pure politics.\" Bush said Democrats are supporting $22 billion in additional spending beyond his budget proposals this year and $205 billion over five years -- money he said would ultimately be raised by tax increases. \"When the bill for all that spending comes due, Congress is going to turn to the working people, to the small-business owners and the entrepreneurs,\" he said. Tuesday's veto is the fifth cast since Democrats took control of Congress in 2006. Congress has overridden one of those, voting last week to authorize $23 billion in water projects nationwide over the president's objections. Democrats will schedule another override vote this week, an aide to House Majority Leader Steny Hoyer said. But Antonia Ferrier, spokeswoman for House Republican Whip Roy Blunt, said Bush's GOP allies are confident they will be able to sustain the veto. Bush signed a $470 billion Pentagon spending bill that covers the Defense Department's normal operations, but Democrats split $50 billion in spending for the wars in Iraq and Afghanistan off into a \"bridge fund\" to which they plan to attach demands for Bush to withdraw U.S. combat troops. The measure sets up another confrontation with the White House. Bush also demanded Congress reform the alternative minimum tax -- a measure originally aimed at preventing the wealthy from evading taxes, but one that increasingly affects middle-class earners -- without raising additional revenue. He said a plan proposed by Rep. Charles Rangel, the Democratic chairman of the House Ways and Means Committee, to eliminate the tax was unacceptable. \"Preventing a tax increase in one area should not be an excuse for raising taxes in other areas,\" he said. \"Congress should eliminate the tax increases in the bill and send the AMT relief to my desk as soon as possible.\" The elimination of the tax would cause an estimated $800 billion to be lost over 10 years. To replace that, Rangel's bill would add a 4 percent surtax on individual incomes over $100,000, after deductions, and close corporate tax loopholes. The bill also would cut rates for many individual and corporate taxpayers. Republicans have already started calling it \"the mother of all tax increases.\" \"With all the other pressures on our economy, raising taxes is one of the most unwise things Congress could possibly do,\" Bush said. Bush acknowledged the difficulties Americans face from high fuel prices, a \"challenged\" housing market and \"uncertainty\" in financial markets stemming from the collapse of the subprime mortgage market -- \"but as we have seen in recent years, this economy is resilient, and that's important for the American people to understand.\" E-mail to a friend . CNN's Deirdre Walsh contributed to this report.", "PARIS, France -- France lock Sebastien Chabal has been cited for a dangerous tackle on England's Simon Shaw during Saturday's World Cup semifinal in Paris. Simon Shaw offloads despite being tackled by Raphael Ibanez, left, and Sebastien Chabal. The Sale Sharks forward will face a disciplinary hearing on Monday after his tackle on opposite second-rower Shaw was noted by citing commissioner Dennis Wheelahan. Chabal started the match on the substitutes' bench, but was brought on in the 26th minute to replace the injured Fabien Pelous during hosts France's 14-9 defeat. If he is suspended, then Chabal will miss Friday's third and fourth-place play-off match at the Parc des Princes. Meanwhile, France coach Bernard Laporte said that the defeat was tougher to take than England's 24-7 win in the 2003 semifinals. \"In 2003, they were better then us. In fact they were better than everyone,\" said Laporte, who is leaving his role to take up the post of junior sports minister in the French government. \"They were like the New Zealand of this tournament - the favorite, except they went all the way. This time it's harder because yesterday it was 50-50.\" Meanwhile, England -- seeking to become the first nation to defend the World Cup title -- revealed that star kicker Jonny Wilkinson again had problems with the match balls during the semifinal. The fly-half, who voiced his concerns after struggling with the boot against Australia, rejected a ball before kicking a vital three-pointer against France. \"We didn't say it last week but a non-match ball got onto the field in Marseille which Jonny kicked,\" director of rugby Rob Andrew said. \"He didn't think about it while he was kicking it. \"The match balls are marked, numbered one to six. Last night they had 'World Cup semi-final England vs France' written on them. On match night, Jonny was vigilant when kicking for goal that they were actually match balls he was kicking. \"The practice balls lose pressure and shape. The whole issue last week, the organizers accepted all six match balls should be used by both sides on the Thursday before game.\"  E-mail to a friend .", "DENVER, Colorado -- A Colorado man terrorized by threats after testifying against his daughter's abusive boyfriend says he has spent $10,000 on a security system, hired a bodyguard for his son's wedding and never leaves home without a .45-caliber handgun strapped to his chest. Keith Reynolds was convicted for witness intimidation after threatening witnesses in his domestic assault case. The man, who asked not to be identified because of the sensitivity of the case, says the state did nothing to protect him after the 1999 conviction of Keith Reynolds for domestic abuse -- even after prosecutors told him a hit had been put on his family. A report in the Denver Post pointed out major problems protecting witnesses in the state of Colorado. Paul Logli, chairman of National District Attorneys Association, told Congress this year that witness intimidation has become \"almost epidemic,\" according to the Denver Post. When asked if prosecutors had made the family aware of Colorado's witness protection program, the witness in the Reynolds case said, \"All they told us was maybe we should move.\" \"I'm pretty sure I told one of them -- either him or his wife -- about the program. I can't remember if I gave them all the details.\" the prosecutor assigned to the case, who didn't want to be named, told CNN. After Reynolds' conviction, the witness and his wife saw strange cars parked outside their home. They received phone calls during which the only sound on the other end of the line was a gun being cocked. The couple received a death threat from Reynolds himself through the mail. Watch witness describe fear of being targeted » . Reynolds was then sentenced to ten years in a maximum security prison for witness intimidation. However, it is likely he'll be released within five years. No national statistics on crimes against witnesses exist, and minimal research has been conducted on the subject. The latest National Institute of Justice survey on record -- conducted more than a decade ago -- shows that more than half of big city prosecutors consider witness intimidation a major problem. Colorado has $50,000 allocated to its witness protection budget. In contrast, the city of Denver spent almost $100,000 on landscaping last year. The state, on average, spends about $1,000 per witness. That figure supposedly includes moving expenses, rent, and furniture. The federal program spends in excess of $40 million per year on witness protection. One possible reason for the disparity is that witnesses in state cases do not get new identities, as do federal witnesses. \"It's not designed to be a long-term relocation at the public's expense; it's a way to ensure the immediate safety of the witnesses,\" according to Peter Weir, executive director of the Colorado Department of Public Safety. Colorado's witness protection program is a \"joke,\" according to The Rev. Leon Kelly, founder and executive director of the Open Door Youth Gang Alternatives. Kelly says the state doesn't provide enough incentive for witnesses to come forward. More than a decade ago, a young man named Darryl Givens asked Kelly for advice while deciding whether to testify in a murder case or face prison. Givens chose to testify. A few months later, he was shot twice in the head by men he considered friends. That day continues to haunt Kelly. Rhonda Fields says failures in the witness protection program may have contributed to her son's murder. Javad Fields was a college graduate who was engaged to be married. He had plans to move east when a Fourth of July barbecue in 2004 in changed all that. He witnessed the murder of his best friend and subsequently testified against three men suspected in the killing. Javad Fields and his fiancee were gunned down while driving along a suburban street in Aurora, Colorado. The couple, both 22, died instantly. Rhonda Fields says her son was never told about a witness protection program. She confronted prosecutors after his murder. Fields told CNN, \"I asked them what happened. Why weren't any measures taken to safeguard his life? And I was told he never asked for any protection.\" Javad's mother does not think it was her son's responsibility to ask for protection. \"I think it's the authorities' responsibility to notify witnesses of the dangers that are involved with being a witness,\" she said. Field's case illustrates glaring weaknesses in the witness protection program. Prosecutors filed an order for protection requesting Javad Fields' personal information be kept secret, but it wasn't signed by a judge until one year later, after defense lawyers had already given the suspects Fields' personal information, along with crucial trial documents. \"I felt like the DA's office used my son to win their case but did not take the proper measures to safeguard his life,\" Rhonda Fields told CNN. District Attorney Carol Chambers maintains the program has improved. She says a notice about witness protection is now attached to every subpoena, ensuring witnesses are aware of their options. That didn't start, however, until two years after Javad Fields was killed. E-mail to a friend .", "LONDON, England (CNN) -- Previously unseen footage of Diana, Princess of Wales, taken just hours before she was killed in a car crash, has been shown to the jury at the inquest into her death. The footage showed Diana and Dodi step into an elevator at the Ritz Hotel. Images taken from a security camera at the Ritz Hotel in Paris show the 36-year-old smiling as she and her lover Dodi Fayed step into an elevator and later walk out of the hotel. Further footage shows Fayed visiting a jeweler's shop, images that could lend support to claims that he was buying an engagement ring. Earlier, a British coroner at the inquest said tt may never be known for certain whether Princess Diana was pregnant when she died in the Paris car crash. Lord Justice Scott Baker told the jury at the inquest into the deaths of the princess and her lover Dodi Fayed that scientific evidence might be unable to demonstrate \"one way or the other\" whether she was in the early stages of pregnancy. But he said they would hear \"intimate\" details of her personal life.  Watch footage of Diana's last hours » . Baker told the 11 members of the jury -- six women and five men -- Diana may have been on the contraceptive pill and that evidence she was poised to get engaged to Dodi on the night she died was contradictory. On Tuesday the judge, who is acting as coroner in the case, told the jury that a famous image taken in summer 1997 showing Diana wearing a swimsuit could not be proof she was pregnant with Dodi's child as she had not started a relationship with him at that stage. The jury is set to hear \"scene setting\" evidence, including CCTV and a tourist video. The inquest to establish cause of death is expected to be a six-month process. Fayed's father, Mohammed Al Fayed, has contended from the start that Diana and his son were murdered because the royal family \"could not accept that an Egyptian Muslim could eventually be step-father to the future king of England,\" referring to Diana's son Prince William. \"I'm hoping for justice,\" Al Fayed said outside court. \"At last, we're going to have a jury from ordinary people and I hope to reach the decision which I believe that my son and Princess Diana have been murdered by the royal family.\" Baker told the jury of Al Fayed's allegations, but again reminded them that they were responsible for deciding the facts of the case, but not to assign blame or guilt. \"You have to decide four important, but limited factual questions: who the deceased were, when they came by their deaths, where they came by their deaths and how they came by their deaths,\" Baker said, according to inquest transcripts. \"The first three questions are unlikely to give rise to any difficulty. The fourth is a rather wider question and is directed towards the means by which they died.\" Diana, 36, and 42-year-old Dodi Fayed were killed on August 31, 1997 when the Mercedes-Benz they were traveling in hit a pillar in the Pont de l'Alma tunnel in Paris. They were being pursued at the time by the paparazzi after leaving the Ritz Hotel. Driver Henri Paul, who was also killed, was drunk and driving at high speed. Bodyguard Trevor Rees-Jones was the sole survivor. Next week, the jury is scheduled to travel to Paris to see the crash site, along the River Seine. They are also expected to hear testimony from the paparazzi who were present after the accident. In its evidence section, the Web site for the inquest has posted previously unpublished pictures taken by paparazzi of the limo before and immediately after the accident. One is a closeup -- looking into the front of the vehicle -- that shows Diana, Fayed, Paul and Rees-Jones minutes before the crash. E-mail to a friend .", "WASHINGTON (CNN) -- Republicans reacted with surprise and recrimination Sunday to blistering criticism of the Iraq war from former coalition commander retired Lt. Gen. Ricardo Sanchez. Lawmakers lashed back at retired Gen. Ricardo Sanchez on Sunday after he criticized the war effort. On Friday, Sanchez, who was coalition commander in 2003 and 2004, called the Iraq war \"a nightmare with no end in sight.\" He said the Bush administration, the State Department and Congress all share blame. Speaking with military reporters in Virginia, Sanchez also said such dereliction of duty by a military officer would mean immediate dismissal or court martial, but the politicians have not been held accountable. \"I'm astounded, really,\" South Carolina Republican Sen. Lindsey Graham on CNN's \"Late Edition\" with Wolf Blitzer on Sunday. Graham, who recently returned from Baghdad, said he and GOP presidential candidate Sen. John McCain had visited Sanchez several times in 2003 and 2004. \"Every time we talked to Gen. Sanchez, we got pushback -- we have enough troops; Guard and reserves aren't being strained,\" Graham said. He added that Sanchez's own record in Iraq is blemished: Abu Ghraib \"got out of control under his watch. The war in general got out of control under his watch.\" But Graham said that \"finally,\" with the commitment of nearly 30,000 additional U.S. troops since January, \"We are getting it right.\" Sanchez told reporters that American political leaders have cost American lives on the battlefield with their \"lust for power.\" Sanchez said it had been his duty to obey orders and not object publicly while on active duty, but that he has an obligation to speak out now that he has retired. \"While the politicians espouse a rhetoric designed to preserve their reputations and their political power, our soldiers die,\" he said. That brought a tart response from McCain, the ranking Republican on the Senate Armed Services Committee. \"I wish that he had given us the benefit of that knowledge at the time,\" McCain told CBS's \"Face the Nation.\" He said Sanchez should have spoken out at the time -- or resigned -- but \"unfortunately, that doesn't happen very often.\" One of the reasons few speak out, he said, is evidenced by what happened to former Army Chief of Staff Gen. Eric Shinseki, McCain said. Shinseki was sidelined after telling Congress that hundreds of thousands of troops would be needed to occupy Iraq. Sen. Mitch McConnell, a Republican from Kentucky, told ABC's \"This Week\" that Sanchez is simply wrong. \"My definition of winning is a stable country and an ally in the war on terror,\" he said. \"I think we're making significant progress toward that end.\" But, he added, \"I think the central government in Iraq has been an embarrassment. They've not been able to produce any of the kind of political compromises that we had hoped for.\" Graham said he hopes the government of Prime Minister Nuri al-Maliki will \"step up to the plate and do something meaningful by the end of the year.\" If that does not happen, he said, \"it will be incumbent upon us, as a nation, to devise a new political strategy to find a way forward or create a stable Iraq.\" That brought a blistering response from Zbigniew Brzezinski, national security adviser under President Carter. \"What is this? This is a colony,\" he said. \"That's the heart and essence of the difficulties we encounter.\" Even those Iraqis who were happy to see Saddam Hussein toppled from power more than four years ago are not happy with the continuing U.S. presence, Brzezinski said. Though some countries are willing to go along with the United States, \"No one in the world really supports our policy in Iraq,\" he said. In his Friday speech, Sanchez added that the \"surge\" of U.S. troops into Iraq represents \"a desperate attempt by the administration that has not accepted the political and economic realities of this war.\" National Security Council spokeswoman Kate Starr did not address the comment. Instead, she said, \"We appreciate his service to the country. As Gen. Petraeus and Ambassador Crocker said, there's more work to be done but progress is being made in Iraq. And that's what we're focused on now.\" Gen. David Petraeus is the U.S. top commander in Iraq. Ryan Crocker is the U.S. ambassador to Iraq. E-mail to a friend .", "ST. PETERSBURG, Florida (CNN) -- The acrimony from the Republican campaign trail carried over quickly into the CNN/YouTube GOP presidential debate Wednesday. The debate marked the first time the candidates had faced off on the same stage in over a month. With five weeks to go until the first contest of the 2008 nominating season, the Republican candidates engaged in a free-for-all, trying to differentiate their views on immigration, the Iraq war, abortion, gun control and even whether they believed every word in the Bible was true. Unlike previous debates in which the candidates focused most of their attacks on Democratic front-runner Hillary Clinton, Wednesday night's attacks were launched at each other. Former New York Mayor Rudy Giuliani and former Massachusetts Gov. Mitt Romney traded jabs over illegal immigration, something they have been arguing about on the trail for the past month. Romney attacked Giuliani's record, saying that as mayor, he promoted illegal immigration. And Giuliani shot back, accusing Romney of having a \"sanctuary mansion\" at his own home.  Watch the debate format produce raw moments » . \"In his case, there were six sanctuary cities. He did nothing about them. There was a sanctuary mansion -- at his own home, illegal immigrants were being employed,\" Giuliani said. Romney denied Giuliani's allegation, and the two raised their voices as they tried to talk over each other. In his quest to appeal to the hard-line immigration wing of the party, Romney also turned some of his fire on the same topic toward former Arkansas Gov. Mike Huckabee, who has been rising in the polls. Rep. Tom Tancredo, who has anchored his candidacy on securing the borders and cracking down on illegal immigration, seemed delighted with the give and take, saying the other candidates were trying to \"out-Tancredo\" him. Huckabee drew one of the night's largest cheers when he said that one of the agencies he would abolish to control federal spending was the Internal Revenue Service. \"Most people in this country are more afraid of an audit than they are of a mugging, and there's a reason why,\" he said. Sen. John McCain, freshly back from a visit to Iraq over Thanksgiving and the most hawkish of the candidates, and Rep. Ron Paul, the most anti-war of the candidates, tangled on two occasions over the Iraq war.  Did  YouTubers get their questions answered? » . Asked which government programs they would cut, Paul said bringing the troops home from Iraq would save \"a trillion dollars.\" McCain said: \"It's that kind of isolationism that caused World War II,\" which drew some hoots from the crowd.  Watch McCain, Paul spar on Iraq » . Paul replied: \"The real question you have to ask is why do I get the most money from active duty officers and military personnel?\" A retired brigadier general, Keith Kerr, who is gay, asked candidates if they thought U.S. military personnel were professional enough to work with gay and lesbian troops. CNN later learned that a June media release from the campaign of Democratic  front-runner Clinton listed Kerr as a member of its steering committee for gay and lesbian supporters.  Watch Kerr deny that the Clinton campaign influenced his question » . David Bohrman, CNN senior vice president and executive producer of the debate, said, \"We regret this incident. CNN would not have used the general's question had we known that he was connected to any presidential candidate.\" Political Ticker . Kerr told CNN after the debate that he has not worked for the Clinton campaign and was representing no one other than himself. Kerr also said he is a member of the Log Cabin Republicans, a national gay and lesbian Republican grass-roots organization. Prior to the debate, CNN had verified Kerr's military background and that he had not contributed money to any presidential candidate. In a section of the debate about gun ownership rights, three of the GOP presidential hopefuls said they do not own guns: McCain, Giuliani and Romney. Former Tennessee Sen. Fred Thompson quipped, \"I own a couple of guns -- but I'm not going to tell you what they are or where they are.\"  Watch the candidates address gun control » . The debate turned personal when a viewer, holding the Bible, asked: \"Do you believe every word of this book? And I mean specifically, this book that I am holding in my hand.\" Huckabee, a Baptist minister, said, \"Sure, I believe the Bible is exactly what it is.\" Giuliani said he believes the Bible, but not \"literally true in every respect.\" After that, Romney stammered a bit when moderator Anderson Cooper asked him if he believed every word.  Watch the candidates get personal about the Bible » . \"Yeah, the Bible is the word of God. ... I might interpret the word differently than you interpret the word, but I read the Bible and I believe the Bible is the word of God,\" Romney said. When asked about abortion, Romney said he was wrong in favoring a woman's right to choose -- his position when he was elected governor of Massachusetts. \"If people in this country are looking for someone who's never made a mistake on a policy issue and is not willing to admit they're ever wrong, they're going to have to find somebody else. On abortion, I was wrong,\" he said. His remarks came in response to the 30-second video produced for the debate by Thompson's campaign, which included a clip of Romney expressing support for Roe vs. Wade during a 1994 debate against Sen. Ted Kennedy. When asked what women and doctors should be charged with if abortion was to become illegal,  Paul said it was not an issue for the president or the federal government. \"We don't need a federal abortion police, that's the last thing we need,\" Paul said. He added that the issue should be left to the states and courts and not federal authorities. On the issues of taxes, Thompson said he'd \"never met a tax he liked.\" \"I've got a tax-cut bill on the table. But I don't do pledges to anybody but the American people,\" he said. His response was met by a \"Go, Fred, go!\" from a member of the audience. On the issue of trade with China, Rep. Duncan Hunter said China is \"cheating on trade ... and it's in the interest of the United States to stop China's cheating. Buy American this Christmas season -- that might keep your neighbor from losing his job.\" The candidates fielded video questions submitted by the public via the YouTube Web site, just as Democratic White House candidates did in July. The debate was the first time the GOP candidates had faced off on the same stage in over a month. CNN's political team viewed nearly 5,000 videos for the GOP debate -- about 2,000 more than they saw for the Democrats' debate. E-mail to a friend .", "BAGHDAD, Iraq (CNN) -- None of the 1,000-plus Iraqi detainees freed in recent weeks have broken a pledge not to return to the insurgency, according to the Marine general who oversees the U.S. detention centers in Iraq. A U.S. military panel reviews a detainee's case at Camp Cropper near Baghdad. Speaking in Arabic, Maj. Gen. Doug Stone on Wednesday reassured Iraqis about how the 25,000 detainees -- mostly Sunnis -- are treated after being taken into custody on suspicion of involvement in the insurgency. Stone described the detention system as \"open and transparent,\" saying it makes the detainees better citizens and helps break the cycle of violence and poverty in the country. Stone said detainees get free medical care equal to what he gets as a general, food and water made to Islamic standards, educational opportunities, jobs skills and contact with families. The U.S. detention centers -- at Camp Bucca near the southern port city of Basra and in Camp Cropper near Baghdad -- are political sore points for Sunnis, who make up 83 percent of the detainees held. The main Sunni political coalition -- the Iraqi Accord Front -- cited the centers as one reason for quitting the government during the summer. Last month, the U.S.-led coalition launched Operation Lion's Paw in which between 50 and 70 detainees would be released daily during the Islamic holy month of Ramadan after taking a pledge not to rejoin the insurgency against the Shiite-led government. \"This pledge is an Iraqi pledge, a pledge before an Iraqi judge, frequently with a family member present,\" Stone said. \"I am pleased to tell you that in the more 1,000 that have gone through this program and taken the pledge, not one has returned to threaten Iraqi or coalition forces.\" Stone said the releases would continue at the same pace beyond Ramadan. Stone's description seems a far cry from the Abu Ghraib prison operated by the U.S. military in the first years after the invasion. That prison was closed down and razed in the wake of an international scandal over prisoner abuse. \"There are no secrets that go on in detention,\" Stone said. \"Our facilities are open to inspection by any agency that we in the federal government believe is credible. These agencies are welcomed because they are windows for the world.\"  See what life's like inside Camp Cropper's walls » . By the time of their release, \"detainees grow in terms of working in an inter-sectarian environment,\" he said. Each detainee has a chance to take classes up to a sixth-grade level, and high school classes are being planned, Stone said. About one-third -- or 8,000 -- are in school, with 7,000 having passed the fifth-grade level, he said. The 860 detainees who are 17 or younger are all in school, Stone said. The average stay for a detainee is 300 days, but some have been detained for two years or longer, he said. A review board interviews detainees to decide if they are a threat to security, he said. If they are deemed not to be, they are offered freedom in exchange for taking the pledge. Only 280 detainees are foreigners, mostly from Syria, Egypt, Iran, Sudan and Saudi Arabia, he said. Other developments ."]